data = [
    
      {
    "url": "/2023/05/25/the-hooded-crow-the-pigeon-and-the-trash-can.html",
    "title": "The Hooded Crow, The Pigeon, and the Trash Can",
    "text": " I remember when I first saw a hooded crow (dolmányos varjú). I was around 15 and went for an afternoon trip from our home town to Budapest. We visited a cosy little park at the Buda end of Elisabeth Bridge, and there were these strange-looking, gray-chested crows.   Of course, I had already seen carrion crows (kormos varjú) and rooks (vetési varjú), but it seems to me that I hadn’t ever come across their hooded relatives before. Since then, I associate hooded crows with the city and carrion crows with the countryside, and I like to think that carrion crows are compelled to move inwards due to the lack of food on the countryside in the winter.    The hooded crow. Source: Mike Dickinson.  As for the hooded crow, my inference is that it inhabits the city, so much so that it adapted greatly to the big city life. It was years ago when I first noticed that crows fly to trash cans, land on the top of it, and try to fish some food out of it. They also measure how full the can is, and if the trask is too low for them to pinch on, they fly on to the next one, systematically checking the trash cans in the area.  But it hasn’t been until recently that I’ve noticed another kind of adaptive behaviour in the urban environment. As the hooded crow landed on the trash can, two street pigeons flew closer. The crow was not successful for the first time, and it got scared by some walkers-by, and so did the pigeons. Nevertheless, the second time was a hit, the crow scattered trash all over the sidewalk and found something to chew on in it. To my surprise, the pigeons stayed until the crow left, and then they also started looking for some food in there. They knew what the crow was doing there and they were waiting for the right time to chip in.  However, back to Corvids. They’re social animals living in family groups, and they often feed on carrions (hence the name of the carrion crow), or form foraging groups and scour the area for whatever there is to eat. The high level of cooperation that is needed to such undertakings could be one reason underlying their remarkable intelligence, as it is assumed to have been the case with humans by the Hungarian Centre of Ecological Research (see this article for more on this).  The most prominent feature of their intelligence lies in their communicative skills. Even though we all know Poe’s poem The Raven (“Quoth the Raven ‘Nevermore.’”), it’s a lesser-known fact that ravens can, in reality, mimic human speech. Mischief, the white-necked raven, and Fable, the common raven, became virtual celebrities on Youtube because of their immensive skills when it comes to imitate speech, and even crows (like Tuck) demonstrate this behaviour to some extent.  In the wild, corvids do use a colourful palet of callings, so that they can cooperate within their groups, which is another intriguing aspect to touch upon if you’re interested in ornithology as well as in learning English. Although a group of birds is called a ‘flock’, the collective nouns used for the gatherings of Corvidae are as follows:    a crow → a murder of crows   a raven → an unkindness/conspiracy of ravens   a magpie → a conventicle/mischief of magpies   a rook → a parliament/building of rooks   Not the most endearing terms, are they? Well, in Western culture, these black birds generally have a reputation of being friends with the devil, Death, and the underworld. For example, Poe made use of the raven’s common depiction as a prophet, a messenger of the dead, and Odin sends his two ravens Huginn (Thought) and Muninn (Memory) to gather information on how’s it going in his realms. And let’s not forget about the six ravens of the Tower of London who are carefully tended to by the yeomans lest the Crown falls - I mean, would it really be so unfortunate?  Significant as they are in our culture, it is no surprise that Corvids have a culture of their own with social customs such as funerals and highly sophisticated strategies to scare various animals of prey away from their territory (see a hooded crow getting two cats really miffed or two little magpies taunting a fox). They even cooperate with more distant members of their families as you can see here, for example, with a sparrowhawk harassed by two magpies and a carrion crow. Their intrepidity knows no limit in protecting their chicks and they even put up a fight with humans in the vicinity of the nest. It should be noted, though, that their disruptive behaviour may well be playful in nature, especially in cases when the crow does not, in fact, protect their territory (e.g., this video shows a Russian crow snowboarding on a car), which in turn raises serious questions on the importance and use of play in the animal world (check out this ‘edutaining’ article for more).  And if the above evidence did not suffice, I’d like to give the floor to David Attenborough who explains how city crows use cars to crack chestnuts at the crosswalk:     ",
    "tags": "environment"
},
    
      {
    "url": "/2022/12/23/van-helsing.html",
    "title": "Oh The Movies | Van Helsing (2004)",
    "text": " Van Helsing is an unusual steampunk adaptation of Shelley’s Frankenstein and Stoker’s Dracula. If this weren’t enough, Van Helsing is also hesitant to decide whether it wants to be a serious flip on the stories or a parody of them.    Hugh Jackman on the set of Van Helsing. Image: IMDb.    At first blink, the movie is meant to be a light-hearted comedy with many generic tropes subversed or reflected on. It’s in the very first 15 minutes when we get the essential scene of buddy cop movies subversed: Van Helsing is told that “his results are unquestionable, but his methods attract far too much attention.” Then we also get an ironical remark on the grandiose villain’s monologue: “I think if you’re going to kill someone, kill them; don’t just stand there talking about it!”  Sure, sure. But at the same time, we have a hero and a heroine in all seriousness with their token romance as a must-have, counterpointed by a buffoon monk. And the good old fighting scene with Van Helsing as a fierce werewolf and Count Dracula as, well, the super-vampire with a mimicry of an accent. Lugosi, I guess? (No, not him.)  So which one is it? You tell me. I had a good time, though. ",
    "tags": "movies, American, action, gothic, vampire, horror"
},
    
      {
    "url": "/2022/12/23/old-people.html",
    "title": "Oh The Movies | Old People (2022)",
    "text": " Have you seen Shyamalan’s Old (2022)? The Taking of Deborah Logan (2014)? The Relic (2020)? Hereditary (2018)? And The Visit (2015)?  Getting old is scary, and Old People is another example for that. The basic concept of the German horror is the same as any other zombie with zombies swapped for elderly people. Straight outta Saalheim,  the retirement home.    German ballerina Eveline Hall was a perfect pick for the role. Image: IMDb.    Although the movie was awful, the idea of old people in horror movies is incredibly productive. And when I say productive, I also mean relevant, the elderly do not only represent the old-timer of the genre, the fear of death and dying, the movies listed above also points out two important features of today’s world: 1) changing family models, and 2) the demographic crisis of Western countries.  The idea of the nuclear family model (two parents and few children) took off in the previous century, and brought about severe changes of lifestyle with the older generations living separately from their children and grandchildren. Death is an obvious source of fear, and horror/thriller movies has been feeding on that since the beginning of times, but the world of the elderly entails more than that. It means an unfamiliar world with dreads that the viewer hasn’t ever thought there are: syringes, catheters, stoma bags, and an impenetrable atmosphere of odours. As part of the death taboo, this world is kept hidden from the public eye with aged people being sent to retirement homes, or left alone to die at their own, which makes it all the more frigthening for us to face them.  Other than that, the demographic crisis in aging societies may also develop an unconscious hate towards the elderly appearing as the embodiment of the expectations to, and burdens of, the younger generations. Social security can’t be based on an unwavering respect towards the wisdom of the senior members of society, as age doesn’t automatically equal with knowledge and reliance anymore. Add that to agism against the old and the cult of youth, and you’ll get the idea why Old People wanted a slice of that cake.  Anyway, it’s an awful movie, don’t watch it. ",
    "tags": "movies, German, horror, getting-old"
},
    
      {
    "url": "/2022/12/23/nosferatu-the-vampyre.html",
    "title": "Oh The Movies | Nosferatu the Vampyre (1979)",
    "text": " Werner Herzog is a versatile master of cinematography. I remember seeing his Grizzly Man (2005) and listening to him narrating Timothy Treadwell’s incredible story. Now, Nosferatu the Vampyre (1979) is a whole different story, and not just another shot at Bram Stoker’s Dracula.   Herzog’s shots are mesmerising, in the ’70s’ horrors sense of the word There’s an extensive use of close-ups, a shade of white so cold that it is barely white anymore, and the (micro-)movements of the camera that resembles modern-day hand camera horrors. The dreamlike sequences are exceptionally convincing; however, the slow pace of the movie with the genre’s ubiquitous suspense adds up to hard-to-consume “cinematic experience”, and we’re not accustomed to such movies.    Klaus Kinski as Nosferatu. Image: IMDb.    As a person who struggled through fantastic movies like The Cabinet of Dr Caligari (1920), I found it strange how much the language of movies, especially thrillers and horrors, has changed during the last three decades. Back in the ’70s, filmmakers had to apply creative solutions, acrobats and trick shots to thrill their audience. In a way, The Exorcist (1973) paved the way for today’s supernatural horrors with a rotating head sprinkling vomit all around in the room and an acrobat coming down the stairs in a bridge.  Now, as I’ve said, Herzog’s movie is much slower, therefore it doesn’t allow for such solutions. It’s not really horrifying, there’s not one scene that we can describe as such (except for the rats, perhaps, who, incidentally, were Hungarian rats); it could be captivating, though, a little disquieting. In a way, unforgettable, even, at least the following four scenes are:   Roland Topor's every moment as Renfield (he could have been given more screen time); the sneezing kid when the ship arrives to Wismar; Nosferatu arriving to Wismar, as happy as a clam, and seems to have found his dream home (with uplifting runs of violin in the background, of course); a burlesque conversation between Rijk de Gooyer and Clemens Scheitz on arresting Van Helsing.   The slow pace of the movie may have something to do with the fact that it is an homage movie imitating an 1922 silent movie, Nosferatu. With Nosferatu the Vampyre, Herzog pays honour to “the greatest German film”. Well, me and Herzog, we might be namesakes, but we’re clearly not playing the same game. ",
    "tags": "movies, German, French, vampire, horror"
},
    
      {
    "url": "/2022/12/23/enver-simaku.html",
    "title": "Oh The Movies | The Invocation of Enver Simaku (2018)",
    "text": " When mockumentary meets horror, a good old found-footage/hand-cam horror is right around the corner. Marc Lledó Escartín, the director of The Invocation of Enver Simaku (2018) went for something else: he made a mockumentary with immensive narration. The plot of Simaku follows Julien whose wife was murdered during a pogrom in Albania. 18 years after the incident, the footage of that fateful night still haunts Julien’s dreams, so he returns to Albania to find out more about the circumstances of his wife’s death. Simaku is an awful movie, but it’s also an interesting cautionary tale on how not to shoot a horror movie.    Julien Blaschke as Julien in The Invocation of Enver Simaku. Image: Netflix.    First of all, the coherence of the narrative is quite arbitrary. Even though we readily “suspense our disbelief” and buys into Julien just returning to Albania to find out more about the killer of his wife, the Communist “Anti-Paranormal Brigade” is much harder to get us do the same. However, Escartín’s blunders in building a narrative would be easy to forgive, the exceptionally large amount of narration can’t be disregarded. It seems that such narration could effectively kill any horror movie. Why is that, though?  On the one hand, narration is an element of organisation and order, which is alien to the development of thrillers and horrors. Especially if it’s a past-tense narration, which builds upon the premise that the narrator’s and the story’s present are two different plains of time, that is, no matter how terrible the events are, we can be sure of the fact that the narrator is still alive. As opposed to that, horror mockumentaries feeds upon the audience’s uncertainty on the characters’ well-being. Not only does Simaku break that uncertainty principle, its non-diegetic narration (ie. a narration with a narrator who’s “outside of the story”) also relieves the tension, in that it comes from an external space, so it tears down not only the fourth wall but all four walls at the same time. The viewer is not trapped into a world of suspense, there’s a way out, no need to worry!  So, Simaku as a movie is a great disappointment. It is rather a failed experiment with non-diegetic narration in horror movies. And that’s about it. ",
    "tags": "movies, Albanian, Spanish, horror, mockumentary"
},
    
      {
    "url": "/2022/12/22/the-blind-side.html",
    "title": "Oh The Movies | The Blind Side (2009)",
    "text": " The Blind Side is an inspiring sport drama with Sandra Bullock, who was perfectly casted for a WASP housewife, Mrs Tuohy, embracing a young African-American athlete, Big Mike. Other than that, it’s a perfect basis for an  case study on the concept of biographical movies.    Although it seems to be the easiest job in the world, adapting a biographical book to screen is actually a tricky concept. “Art imitates life”, true that, but life itself doesn’t necessarily make up for a good movie. And that’s where the creators have to step in, and do either of two things (or both of them at the same time).  First of all, they have to “narrow down” the story, so that it takes the form of an easy-to-follow narrative with processable concepts, distilled (visual) language. Of course, for fiction, it’s sort of a given: stories are always created with some sort of narrative coherence in mind. Hovewer, life is much more complex than that. When it comes to making a biographical movie, creators have to omit certain subplots and characters, so that there’s a very basic, inherent emphasis in the biography. Michael Jordan, for example, is a hypercompetitive can-do fighter. John Nash is a peculiar scientist fighting schizophrenia. Just like Frida Kahlo, who is, again, a physically hindered artist with a spirit of a bird, always struggling with an inexplicable attraction to her unfaithful husband. Any subplots pointing in different directions must be eliminated; that’s the rule.  On the other hand, sometimes biographies needs a little push. That’s when screenwriters have to “add” to the story, so that a specific aspect of the story is underline. These additions often wreaks havoc online, as they can be interpreted as ignoring one of the most essential criteria of non-fiction, which is truthfulness. Obviously, stories fall far from the world of realism; they depict events from a limited number of select perspectives and are maintained by narrators and interpreters, therefore they can be, at most, construed as interpretations of reality.  The Blind Side is a shining example of a poorly designed biographical drama. Not only does it fail to construct a “readable” story of Michael Oher’s starting of his career, it’s also a trainwreck of a drama. With unbelievably flat characters, and especially stock characters (the cheerleader, the athlete etc.) in the house, it couldn’t have been more difficult to introduce conflict to the story, except for Big Mike’s (inner) conflict between the hood and the American Dream of WASP Land at the Tuohy’s.  There’s a  dialogue in the movie that takes place between Big Mike and Mrs Tuohy, which illuminates the defects of the movie better than any words of mine. So here we go:  MRS TUOHY: I know I should have asked this a long time ago but do you even wanna play football? I mean, do you even like it?’  BIG MIKE: I’m pretty good at it.  MRS TUOHY: Yeah, you are.  And that is an awful drama that even Sandra Bullock, no matter how great an actress she is, can’t fix. ",
    "tags": "movies, American, sport, drama"
},
    
      {
    "url": "/2022/12/20/gothika.html",
    "title": "Oh The Movies | Gothika (2003)",
    "text": " In this 2003 classic, Halle Berry plays a desperate pychiatrist who gets possessed by one of her patients’ ghost. No matter how hard she tries, Halle Berry could not really kill the movie with her ham-like acting. Even though her screaming all the time easily exhausts the viewer, the plot holds firm with a so-so unexpected twist in the end. And there’s even a young Robert Downey Jr. somewhere. And Penelopé Cruz, I guess? Wasn’t really paying attention.   Asylums are one of the favourite locations of thriller writers, especially with sane characters diagnosed with some mental condition. This allows for the narrative to unfold in the telling of an unreliable narrator who at first seems like a reliable one. That places the audience into a suspenseful crux: “Who do I believe?” The visual designers of Gothika made sure that this duplicity pervades the whole movie with the extensive use of contrast between shadow and light. Gothika, as the name suggests, evokes a dark, apathetic institution with its filtered lights, enclosed spaces, and general lack of colours. Seemingly, the producers of The Machinist (2004) followed the concepts of Gothika in that.    Halle Berry and Robert Downey Jr. in Gothika. Image: IMDb.    Compared to its contemporaries, the visual effects were very much limited to a few seconds of CGI flames, in harmony with the 2000s filmmakers’ motto: the shorter the CGIs the better chance they don’t see it. What compensates for this cheap trick is the professionalism of the camera crew, especially that of Matthew Libatique, who had already worked and continued to work on similar movies with the same dedication to cinema (eg. Requiem for a Dream [2000] Black Swan [2010], mother! [2017]). ",
    "tags": "movies, American, horror, thriller, mystery, asylum"
},
    
      {
    "url": "/2022/12/20/birdman.html",
    "title": "Oh The Movies | Birdman (2014)",
    "text": " A very arty way of self-loving, from Hollywood to Hollywood with a mild touch of Broadway. For some reason, I would always mistake Birdman for Kingsmen, but today I learned the difference. The movie is a one-shot dramady with a struggling actor who is dying to prove the world he’s more than his signature movie character, the Birdman.     Michael Keaton in Birdman. Image: IMDb.    Birdman is the particular movie a shrewd critic would describe as a “cinematic experience”, in that the tension, as we expect something, anything to happen, leads to a painstakingly boring one-and-a-half-hour-long journey edging on the something’s about to happen and the nothing will ever happen in this movie, which in the meantime gets us excited about, if nothing else, a theatre play’s premier.  After two hours’ runtime, the movie serves us a punch in the face.   SPOILER The camera lands on the daughter's face who stands in the window of the hospital room where the actor is kept after shooting off his nose. Sam gazes to the distance and starts to smile as she notices her father flying in the air. Of course, we just see Sam's face, as the screen slowly fades to black with Sam relieffuly laughing in the background. As in you know, that's been you the whole time.   And even though I’m a huge fan of great “cinematic experiences”, the catharsis didn’t really make me think about the way I’m living my life. The only thing I started thinking about was if I should refrain from watching art movies in the new year… but I doubt that was the point. ",
    "tags": "movies, American, black-comedy, drama, superhero"
},
    
      {
    "url": "/2022/12/19/8-mile.html",
    "title": "Oh The Movies | 8 Mile (2002)",
    "text": " 8 Mile is a semi-autobiographical movie about B-Rabbit (Eminem), an aspiring rapper in the ’90s’ rap scene of Detroit. The protagonist seeks to launch a career in hip-hop while stuck in a rat race with his awful job at a car (?) factory and his even more awful family living in a trailer park. The movie creates an original atmosphere of tragicomedy, which is hardly ever seen in hood movies. They either dramatically overexaggerate the exasperations of poverty and crime, or quite the opposite, they tend to dip the story in comedy, catering more for the consumers’ taste.   However, Eminem creates an ingenious atmosphere, using music to process through the tragic hood reality. Take for example the scene with B-Rabbit and Future tinkering B-Rabbit’s car while rapping about the trailer park, B-Rabbit’s mom, and that damnation of a car, jamming to Sweet Home Alabama (“You live at home in a trailer”). Not only do they jam to cope with the situation that life brought about, music quite literally takes them away from the godforsaken Detroit trailer park to the lush green hills of Alabama.  Originally, Scott Silver’s screenplay included animated sequences for a similar purpose. As B-Rabbit closes his eyes on the bus, listening to some music, he “[escapes] his earthy bounds &amp; dull reality”, turning into Superman, flying high above the “bad” streets of Detroit, going back in time to the previous night, going full-on samurai on Lil Tic, the rapper he lost a freestyle battle to, starting a Tarantino-esque bloodbath, ending up in the present, at a fancy hotel in the suburbs where he works as a bellboy. Make no mistake, Tarantino was considered directing the movie, and I can’t really explain why the producers refrained from going with Silver’s animations.  Eminem, on the other hand, greatly plays a quasi-cameo in the movie, which shouldn’t come as a surprise, as he had already experimented with several alter-egos such as Slim Shady, the rapper known for his penchant for violence and dark humour. Although B-Rabbit is no Slim Shady, the aggressive look on his face has the same roots, and I don’t really wonder why 8 Mile didn’t pass the Bechdel test, either. ",
    "tags": "movies, American, music, drama, rap"
},
    
      {
    "url": "/2022/12/18/barbarian.html",
    "title": "Oh The Movies | Barbarian (2022)",
    "text": " In spite the obvious generic differences, both 8 Mile (2002) and Barbarian (2022) are set in Detroit and document vital aspects of the deteriorating city. What’s more, the widely celebrated thriller Don’t Breathe (2016) – featuring Hungarian actress Franciska Törőcsik – also takes place there; there’s something in the Detroitan air that not only serves as a particularly fitting setting for these movies, urban space is very much a narrative in itself.    Georgina Campbell as Tess in Barbarian. Image: IMDb.    The story of Detroit’s downfall starts in the early 20th century. Initially, the establishment of the local auto industry, especially the factories of the Big Three (Ford, General Motors, Crysler) made the city’s future prospects very promising. As part of the Great Migration, the Motor City saw an influx of millions of African American workers and their families, which resulted in the city’s population growing to 1.85 million. However, Detroit’s heavy reliance of one single industry soon led to dire consequences when companies decided for relocation or automation, which in turn resulted in unemployment, poverty, and crime rates to rise.  In the subsequent years, the so-called suburban sprawl intensified, including white population leaving the city in masses (white flight). Racial tensions led to, among others, the 1967 riot, resulting in the death of more than 50 people (including civilians, rioters, and policemen), and causing serious amount of insurance damage.  The riot, alongside with desegregation policies introduced in the field of education (cf. Milliken v. Bradley), led to the continuation of white flight, and gradually, the city was depopulated. By 2021, the population decreased to 630,000, which is just a little over the half of the city’s population in 1980. The depopulation of the urban areas was largely supported by infrastructural developments that took place in the course of the last century. As Amy Padnani discusses, Detroit’s downfall may also have something to do with the lack of public transport and the establishment of highways under the mayorship of Albert Cobo in the ’50s. Highways helped white families leave the city, while the poor means of the public transportation system made the commuting of workers impossible.  After all, it’s no wonder that the patchily populated ghost streets of Detroit make up for a perfect setting for a horror movie, just like the blocks of the abandoned Soviet airbase in Kiskunlacháza (as seen in Chernobyl Diaries [2012]), or the ghost town stage-set in the Morrocan desert from The Hills Have Eyes (2006), or the lonesome streets of New York in I Am Legend (2007), emptied by special effects. The uncanniness of Detroit is very much inherent, embedded in, and deeply entwined into, the urban fabric of the city. Take a look at any of the abandoned Detroit locations listed here, and you’ll feel the strange uneasiness that works at its best in movies like the Barbarian.  Buildings imply human presence, so the lack of their inhabitants leaves this implication unfulfilled, giving rise to suspense, the fuel of good thrillers. But not only that, an abandoned piece of a settlement, let it be an asylum, a church, or a castle, is always part of a spatial narrative: there’s always a reason a building is empty. At night, buildings are empty because, you know, people sleep; however, empty streets in broad daylight are not what they’re supposed to be. That’s why Tess’s face grows grim as she notices that she spent the night in a run-down neighbourhood of Detroit.  In addition, Barbarian lives by the rules the spatial concept invitation. As opposed to invasion type of horror movies, invitation movies are set in a place which is home to the villain(s) and unfamiliar to the protagonist(s). Barbarian throws in another twist: Tess (Georgina Campbell) arrives to her Airbnb just to find it already taken due to a double-booking. The other resident is Keith (Bill Skarsgård), a guy with some serious psycho killer vibes and looks. It’s late and it’s raining, so Tess goes inside, and doesn’t get killed.  Other than this impressingly original opening and the suspenseful first part of the movie with the circumstances looking out to no good, the second subplot of Barbarian is just as relevant as the whole homestay conundrum. AJ (Justin Long) is a celebrated action movie star who is fired from his show after being accused of raping his co-star.  The angle from which Barbarian examines the #metoo movement is quite an interesting one. First, AJ is presented as an innocent man falsely accused, and the character even gets a hauntingly lifelike line that goes: “Maybe I’m a bad person, or am I a good person who did a bad thing?”   SPOILER Of course, AJ is a bad person who pushes Tess down from the roof to save himself.   There’s a similar, thought-provoking twist  SPOILER in the way Frank, the kidnapper and serial rapist is shown as a bedridden old geezer, pitiful, whereas the product of his crimes, the inbred creature referred to as The Mother is construed as the monster, fearful.   The title adds even more complexity to all of this. Just as in the case of the Hungarian short story by Zsigmond Móricz, we don’t really get an affirmative answer as to who the Barbarians are. Are they the inhabitants of the Barbary Street where the house is at? Are they the degenerated dwellers of the basement? Are they the coward actor who fails to take responsibility for his actions?  With Tess, the last person standing escaping the scene with The Ronettes singing Be My Baby in the background, the viewers are left with an abrupt ending and a heroine barely survived but liberated from being infantilised. This is the most I can make of it.     ",
    "tags": "movies, American, horror, thriller, mystery"
},
    
      {
    "url": "/2022/12/10/10-times-trevor-noah-proved-he-is-the-goat.html",
    "title": "10 Times Trevor Noah Proved He's the GOAT of GOATs",
    "text": " After his announcement of leaving The Daily Show in September, yesterday marked the day Trevor Noah hosted the show for the very last time. The South African comedian spent seven years on Comedy Central, during which time he:     interviewed President Obama, Michelle Obama, Oprah,   hosted the White House Correspondents’ Dinner,   hosted the Grammy’s,   published his autobiography on growing up during the South African apartheid as a mixed race child (hence the title Born a Crime),   voiced a Wakandan AI system in Black Panther and Black Panther: Wakanda Forever,   carried us all the way through Corona times by relocating The Daily Show into his own New York apartment,   released three Netflix specials.   Of course, these achievements in themselves fail to show why I consider Trevor Noah one of the greatest TV hosts and comedians of all time. That’s why I compiled a list of 10 of his most memorable moments, let them be interviews with political figures (from the left and the right), heartfelt conversations with his audience, or an insightful monologue on France winning the World Cup.     The Daily Show with Trevor Noah. Image: (Paramount Plus).    1. Interviewing Tomi Lahren  “I’m in the lion’s den, Trevor,” says Tomi Lahren as she enters the set.  Then Trevor just goes, “I am not a lion at all. Is that, like, an African thing?”  The invitation of the anti-BLM, conservative commentator was indeed a great big challenge for Trevor Noah. Being an advocate for communication with the people on the other end of the political spectrum, Trevor highlighted in one of his later comments on the interview that it’s important “to challenge your ideas, otherwise you get trapped in the bubble with people who agree with you.” On the other hand, Trevor had to strike a delicate balance between showing hospitality (being the host, you know) and challenging Lahren’s controversial views.  With his audience bursting out in boo’s of contempt on the side, Trevor puts great effort into not hurting his guest’s feelings. The way he forms his questions mirrors a kind and thoughtful approach to understand his guest:  “What do you wish people would understand about you on the other side,” he asks Tomi.  On the top of all this, his general communication supports this kind of openness without ever letting himself be hammered by Tomi’s ready-made panels (eg. “a black man is 18.5 times more likely to shoot a police officer than a police officer is to shoot a black man”). One of the main sources of this is upward inflection, which is the question-like elevation of voice at the end of statement-like sentences (“So what you’re saying is you have to right to say anything you want, so shut up?”).  Such an interview between a conservative Republican and a progressive supporter of minority rights is exactly what a world getting more and more polarised needs now. The fact that, shortly after the interview was conducted, rumours started that Trevor and Tomi are dating tells a lot.      2. The Daily Social Distancing Show  In the wake of 2020, COVID hit the world, hard.  In spite of the travel bans on China and other countries of early outbreaks, the infection rates continued rising exponentially all around the world; the board game Pandemic and the zombie movies we love so much seemed not so light-hearted narratives anymore. Even with the introduction of social distancing in public spaces and mask mandates, it was inevitable to start working, studying, shopping, watching movies, and doing close to everything remotely.  It was no different for The Daily Show, and in March, Comedy Central suspended the show. Even though we had Netflix, HBO, and Disney, the void this left was not to be filled with movies and series, as the essence of TDS was not really entertainment, it was a reliable source of news and information for a number of people. And that was something that there was a shortage of at the time; I vividly remember the hoaxes flying all around our heads, so fast that we couldn’t really catch a breath before we would meet two opposite versions of the same story.  The production crew of TDS started streaming The Daily Social Distancing Show on March 18, 2020, which was. at least in the first, rawest format, a stand-up performance with Trevor Noah sitting down on his couch and discussing, commenting news, of course, without an audience or crew around there. Later, more and more Zoom interviews took place with TDS correspondents, invited celebrities, scientists, sportspeople etc.  Here’s the first episode of The Daily Social Distancing Show that may remind you of the hard times we went through those days with perhaps one or two laughable memories, provided that we are now entering the post-COVID times.      3. President Obama: Thank You, Man  Rarely do American presidents invite talk show hosts to the White House, so it was quite a historical moment for all of us. Presumably, the reason for President Obama doing so was that he could support Hillary Clinton’s presidential campaign, fearing that the radical ideas of Donald Trump and the controversies around Hillary’s emails might lose the Democrats an important race; an ominous suspicion that turned out to shape America’s reality and politics for the next four years (and on and on and on and on…).  Obama had already guested at Jimmy Kimmel’s, Jimmy Fallon’s, and Stephen Colbert’s, endorsing Hillary every way he could. And yes, he did. He participated in comedy sketches, danced, shared intimate secrets about his marriage with First Lady Michelle Obama, slow-jammed with Jimmy Fallon, read mean tweets in the Jimmy Kimmel Live!; in other words, he had to endure every kind of media torture.  With Trevor, however, it was less about comedy. There was no audience, there was no studio, no teleprompter, just two black men discussing Russia interfering 2016 elections, polarisation in the US, Obamacare. With Trump winning the presidential race in November, this interview is one that reflects a depressing Christmastime that was followed by an even more depressing era, both affectively and economically.  At the end of the 22-minutes interview, Trevor shakes hands with the President, saying “thank you, sir,” to which President Obama just responds casually, “thank you, man.”  [Unfortunately, the full 2016 interview is not available on YouTube anymore, so if you are not located in the US, you have to access Comedy Central Online via a VPN. Hola works wonders.]  As for now, I will just put another interview here, one featuring a much more relaxed, retired President Obama, after Democrats retained the Senate, and an equally loosened-up Trevor Noah, one month before his leaving the show.      4. Interviewing Oprah  Having these two wonderful hosts in the same studio, it is sometimes hard to decide if it is Oprah at Trevor’s or the other way round. The audience applauds her arrival for 50 seconds straight, not letting Trevor starting his first sentence. However, Trevor is the GOAT, remember? He pulls a joke, and then goes on discussing, quite wittingly, the enormous effect Oprah has on people.  Along with this genuine modesty, Trevor starts his inquiries with I-statements, describing his own personal connection to his guests and the topics at hand, which adds a personal touch to the conversation and opens easier paths to more controversial, hence more provoking topics. This is how he found manageable means of communication with Tomi Lahren, Will Smith, and Maggie Haberman, and this is how he interacted with Oprah. Starting from the Leadership Academy For Girls in South Africa, the conversation flew flawlessly towards Michael Jackson, the #metoo movement, and Oprah’s interviews with Neverland victims.  In addition to the 17-minute interview, Oprah also participated in another segment, Between the Scenes. The Between the Scenes segment of The Daily Show usually involves Trevor receiving questions from the audience and discussing them before the crew is ready to go on. Of course, having Oprah on the show, it was different: Trevor used the opportunity to have two audience members to ask Oprah their questions. But before that, he threw in a question which is quite emblematic of what kind of host will be missed in him: How many normal random things happen to you?      5. Between the Scenes  Some of my favourite moments with Trevor happened in the segment of TDS called Between the Scenes, in which Trevor turns to the audience and answer their questions, having a casual chit-chat with them, or commenting on serious topics that were not included in the show.  One time he was asked about what he would transplant to America from South African culture. Anytime he draws a parallel between the US and South Africa, no matter if it is 911 operators, racism, infrastructure, or Hollywood, it is pure gold. His answer to this one is, again, down-to-earth, pointing at serious issues from a personal angle of the everyman.      Of course, starting a conversation with his audience also brought us some unforgettable moments; like that time Trevor talked with a Frenchman in the audience about living in Atlanta and French fries (which turned out to be not from France), or with an Egyptian woman about the similarities between Egyptian leaders and Donald Trump. Or when he had a guy who had to change his name because he was always selected by the airport security for a pre-check.  I could go on and on about how swiftly and wittily Trevor reacted to these questions and stories, never offending these people, but see for yourself:      6. Hosting the White House Correspondents’ Dinner  The White House Correspondents’ Dinner is an annual event of, as the name suggests, the White House correspondents, journalist covering the sometimes problematic functioning of the administration and the White House. The get-together is traditionally attended by most members of the current administration including the president and the vice-president. Another tradition is to invite a comedian to roast politicians and media figures sitting by the tables, often causing a public outcry and guests standing up and leaving the event.  However, there were some notable cases of these two conventions not being followed through, especially when the administration eschewed inviting a comedian for one reason or another, or when the president refused to participate. President Donald Trump, for example, didn’t attend a single White House Correspondents’ Dinner during his four years in office, and even boycotted it in 2019, banning their staff members from attendance. One of the main reasons Trump disliked the event is that, since 1983, it has been roast-hosted by a comedian.  But the aftermath of Trump’s losing of the 2020 elections didn’t immediately lead to the rekindling of the tradition as the event had to be cancelled in 2021. It was not until 2022 Trevor Noah was invited to host the event, and host it, he did!  Besides being a wonderful comedian, Trevor is an exceptional jester. A jester who confronts the administration, head-on and spot-on. After Trump left office, I was afraid of what will happen to the American comedy world as they lost their inexhaustible source of humour, and of course, I also had my doubts on how many media outlet in favour of the Democrats would continue criticising the administration once Biden’s at the wheel.  Well, Trevor caused no disappointment in that. Criticising the corrupt cosiness of media and politics, he went after MSNBC, for example, jokingly remarking that “when Trump was in office your shows were all about how bad he was, and now that Biden’s in office your shows are all about how bad Trump was. Consistency is important!” And then he turned to the President and quipped that the reason he was hosting the event might just be that “[Biden] gets [his] highest approval ratings when a biracial African guy is standing next to [him].”  But the audience members not walking out on him is more about what shined through his words all along and what he immaculately summarised in the final part of his speech:  “The reason we’re here is to honour and celebrate the fourth estate, and what you stand for: an additional check and balance that holds power to account and gives voice to those who otherwise wouldn’t have one, and I’m not just talking about CNN or Fox or any of the other major organizations. I’m talking about everyone, you know; the young journalists we saw today, intrepid journalists who aren’t even in this room in Flint, Michigan, or that daring reporters at The Des Moines Register, or the unflinching local newscaster in El Paso, Texas. Every single one of you, whether you like it or not, is a bastion of democracy.”      7. France Winning the World Cup  Tonight, France might make it to the semi-finals, but I don’t want to spoil it, especially because I’m on a losing streak when it comes to the 2022 Football World Cup. Back in 2018, when they did make it there, they triumphed over Croatia 4-2. History might just repeat itself, provided that Croatia beats Argentina next Tuesday.  But let’s not jump ahead and continue our reel of the greatest moments of Trevor Noah. As France won that year, Trevor celebrated their victory, chanting “Af-ri-ca won the World Cup! Af-ri-ca won the World Cup! Af-ri-ca won the World Cup!”  This insightful remark maddened the French ambassador to the US, so much so that he sent a letter to Trevor, in which he resentfully complained about the comedian “denying [the French players] Frenchness” by celebrating an African victory. However, Trevor didn’t just back up without a fight, he commented on the issue and put it into the broader context of (post)colonialism, wisely reflecting on the difference between the alt-right and him talking about these players as Africans:  “When I’m saying they’re African, I’m not saying it as a way to exclude them from their Frenchness, but I’m rather using it to include them in my Africanness.”      This year, by the way, Trevor is rooting for Ghana, Senegal, Brazil, and France. Well, as for now, France’s still in the game!  8.	Doing the Accents  Ah, doing the accents: Trevor’s number one skit! As he explains, the reason he’s so good with accents might be his family background, where at least three languages were spoken (English, Swiss German, Xhosa), not mentioning the accents of English he was surrounded as a child. In his book Born a Crime, he goes into details on how he had to learn proper English in school, and how his prayers were regarded more valuable than African prayers, as it was widely believed that God speaks the English of the colonisers.  One more thing I liked about him is his philosophy on doing the accents: he’s not impersonating general accents; he’s impersonating his friends’ accents. That’s why his bits on accents and nationalities hit so close to home.  I once looked into postcolonial comedy. There’s an intriguing idea somewhere that one of the most defining characteristics of postcolonial humour is the twofold identity of the colonised: being part of two cultures at the same time enables Trevor, for example, to subvert the colonial discourse. Discussing the “sing-song-y” qualities of Trinidadian accent, Trevor does a bit on a Trinidadian Liam Neeson on the phone with the kidnappers to make a point. Again, see for yourself how that sounds:      9.	Oh Trevor, he's never forgotten his roots!  When Trevor was back in South Africa for a short time, he visited his late grandmother Gogo in Soweto. Now, you must know that Trevor’s mom was a single parent, so Gogo took the lion’s share in Trevor’s upbringing. That required great care with the child, literally, “born a crime”, as it was illegal in apartheid for a White man and a Black woman to have a child together. Trevor even describes a situation in his book where his mother had to deny him in a local shop when asked whose child he was, fearing, not without foundation, that Trevor may be taken if the truth gets found out.    Born a Crime by Trevor Noah. Image: (Wikipedia).    Gogo recalls the struggles of South African people against that system, or how afraid she was from the Flying Squads (patrolling policemen in apartheid) taking Trevor when playing on the streets with the black kids. Of course, she also shares what Trevor and his mom were like as children, both naughty and headstrong.      10. Bidding Farewell  Of course, Trevor had to go, but the correspondents for The Daily Show didn’t just let him without a word or two. Michael Kosta, Desi Lydic, Ronny Chieng, Roy Wood Jr., and Dulcé Sloan bid farewell to their – our – great host in a segment that was introduced this year in TDS: the correspondents not doing the weather, the traffic, the stocks etc. but rather commenting on, joking about, the current news.  Ronny Chieng’s skit, for example, was quite heart-warming. The Asian correspondent thanked Trevor for trusting in him and “being adamant about Asian representation in the show”, then took everything back, just to say it was all a joke. Well, his initial reaction went viral and became a meme, and that reflected the feelings we the viewers all shared when hearing about his leaving.  All five correspondents said goodbye in their own way, and it was all so emotional. However, the best was when in the end of the goodbye ceremony, a “senior” field correspondent showed up to “finger the pulse” of New Yorkers on Trevor’s departure. Well, as always, New Yorkers tell you the truth:     ",
    "tags": "trevor-noah, the-daily-show, comedy, politics, racism, USA"
},
    
      {
    "url": "/2022/12/06/d7-in-christmas-songs.html",
    "title": "D⁷ in Christmas songs",
    "text": "     When it’s Christmas, it’s time for carolling.  It happened that I grabbed my guitar last Thursday to set the mood for December. I was checking out the guitar chords of some evergreens (yes, pun intended) when I noticed something strange. A chord kept coming up, regardless of what song I was strumming along: the mighty D7. No matter if it’s White Christmas, O Come All Ye Faithful, or We Wish You A Merry Christmas, D7 is apparently a must-have for yuletide composers.   The rabbit hole of D7 is an incredible place. Once you start unravelling the mystery, new horizons show and memories come flooding back, memories of deadly boring solfège lessons. It seems D7 isn’t the only thing these goldies have in common, they’re also written in the key of G with D7 functioning as a dominant seventh.    It's time to get yourself a mug of hot chocolate, pop some corn, and get comfortable in front of the fireplace. Image: JillWellington (Pixabay).    The function of chords in a key  What’s that gibberish? You may ask. Based on my research and my blurred memories from my early years of music education, songs are written in keys, meaning that they’re arranged with the help of pitches from a particular scale. For instance, the key of G (ie. the G major scale) consists of the following seven pitches: G, A, B, C, D, E, F#:   ▶   OK, so now we have a key. The above pitches serve as the roots of the seven chords in the key of G, that is, the base pitch of the chord. These chords are assigned roman numbers (lowercase if it’s a minor chord), based on their place in the scale: I, ii, iii, IV, V etc. These numbers indicate the function of the given chord in the given key.  Chord progressions, or in other words, the way a song progresses from one chord to another, are based on these chord functions. One of the most frequent chord progressions is I-IV-V-I, which starts from the tonic (the chord established with the root of the key), goes to the subdominant, the fourth chord, culminates in the dominant, causing a great deal of tension, and finally, resolves in the tonic (also known as the home chord). That leaves us G-C-D-G in the key of G.   ▶ G C D G   The dominant seventh  The dominant seventh is an alternative for the dominant chord, which causes a momentary ambiguity, a slight tension, as one of its notes is not in the scale. Let’s just take a look at D and D7, for example. D consists of D, F#, and A, while D7 spices up the whole thing with the addition of C (a seventh note, hence the name), which gives the chord a touch of dissonance with a contrast between the third and the seventh, F# and C. Again, it’s mainly because C is not on a scale of D major, but it belongs to the relative minor (Dm).   ▶ G C D7 G   That is why the application of the dominant seventh brings an uncanny feeling. An unheimlich feeling if you will, truly in its Freudian sense, feeling of being at home, but not quite. Nostalgia might be another emotion that dominant sevenths evoke. It comes as no surprise that the root of the Greek word refers to a certain ‘homecoming pain’, in a broader sense, longing back for the past that’s lost forever, except for our memories.  Nonetheless, dominant seventh awake tension that needs resolution immediately. That’s why, more often than not, D7 leads us back to G. If it is our home chord, the root, we’re alright set. But what if it isn’t our root? Then it is called tonicization, meaning that the chord calls for a tonic that is not the tonic of the key. For example, D7 can be placed into a chord progression as the following: C F D7 G. As soon as we start leaning towards that direction (ie. G), we are dealing with modulation and a different key than what we’ve started with.  Tonicization (in C):  ▶ C F D7 G   Modulation (C → G):  ▶ C F D7 G G7 C D G   All in all, D7 is a dominant seventh that may function as a V7 chord in a I IV V7 I progression (as an ambiguous substitution for D), or it may resolve on another tonic (tonicization), possibly introducing a new key (modulation).  The dominant sevenths in Christmas songs  Huh. Now back to Christmas.  As established above, Christmas songs are often written in the key of G which is a go-to “happy” key, or the reason might just be that it is an “easy” key for guitarist with most of its basic chords can be played as an open chord (except for F#dim), that is, as unbarred chords, chords without your finger pressing down the strings across the fingerboard.  Now, in the key of G, you can always have D or D7 as a dominant, so it is quite obvious we have a lot of those around the house if it is a song written in G.  Why D7 then?    These houses do not have a clue of the impending danger of D7 chords invading the city. Image: Couleur (Pixabay).    Before we answer, let’s just take a detour to explore another honourable mention when it comes to christmassy chords. It’s been 6 years since journalist Adam Ragusea figured out what the most christmassy chord is, namely the Dm7b5. And in came musician Adam Neely to almost immediately debunk his theory, interpreting the function of that god-awful transcription of a chord as one that, in that context, adds bittersweetness to the melody, as minor sevenths usually do. Neely also indicates that it might be the roots of today’s popular Christmas songs where we should start investigating, as most of these songs (eg. White Christmas, Have Yourself a Merry Little Christmas) were written in an era where these bittersweet harmonies were quite popular in the US.  Likewise, D7 might just be a jazzy alternative for D. On the other hand, it is arguably true that the dominant seventh evokes an even greater desire to resolve on the home chord. What if this what makes D7, G7, C7, B7 etc. so ubiquitous in Christmas songs?   ▶ G C D G    ▶ G C D7 G   Causing tension that is always released the same way, they’re chords that mirror our waiting for Christmas, the suspense before the overflow of joyous celebration with the family around the fireplace.  Similarly, remembering the long auld, almost forgotten Christmases evokes nostalgia, that is to say, it is Christmas but not that Christmas. D7 is the chord of nostalgia in that it brings us nice memories just to take us back home with a bittersweet taste in our mouth.  Then again, it might just be Neely’s jazz thing. Who knows? ",
    "tags": "christmas, guitar, music, chords"
},
    
      {
    "url": "/2022/11/15/the-crown-season-5.html",
    "title": "The Way Forward... Ahead",
    "text": " There is nothing new in the palpable tension between the portrayal of Englishmen in coursebooks (such as the English File and Solutions) and the reality of Britain. The tea-sipping, ever so polite Englishmen are what’s left from the long-forgotten (?) Empire, and such colonial discourses are still all around us teachers and students of ESL.  Nevertheless, the demise of Elisabeth II placed ESL teachers on the horns of a dilemma. May we address the controversies surrounding the Royals, or go on teaching what we were taught to?  The way I see it, The Crown is not only an one-of-a-kind historical drama series with elaborate stage design, but also, a product of imaginative speculation, sheding light on stories that have been either kept secret, or blurred by the nonstop media attention that the royal family suffered since the past century.     A crown. Not St Edward's, but a regular old crown.    The reason I am discussing all this is that there is a scene in the new season of The Crown that I was unable to wrap my head around. The scene revolves around a meeting in Edinburgh, involving the senior members of the royal family and a bunch of lords. The meeting was initiated by the Lord Chamberlain that time, David Ogilvy, and was opened by the late Prince Philip, His Royal Highness.    LORD CHAMBERLAIN: And so, in consultation with Her Majesty the Queen and His Royal Highness the Duke of Edinburgh, we've decided to set up an informal council of war. A task force to safeguard the monarchy's survival in a rapidly changing world. And, since the idea is to find new directions for a way forward...  HIS ROYAL HIGHNESS: Ahead.  LORD CHAMBERLAIN: Sir?  HIS ROYAL HIGHNESS: Ahead, David.  LORD CHAMBERLAIN: Way ahead... we would call it the Way Ahead Group.    Why does Prince Philip correct the Lord Chamberlain there?  1. Semantics: little difference Let’s just first address the white elephant in here: just another metaphor, progress is forward motion along a path.  According to Cambridge  Dictionary, forward and ahead both mean in or into the future, and, by extension, are used in expressions related to progress, development, or achievement (cf. a step forward, get ahead, [way] ahead of sy/sg).  The use of the expressions the way ahead and the way ahead, on the other hand, is a whole different issue. Clearly, Prince Philip is strongly opposed to forward here, and truly, he is not forward-thinking at all. Yes, pun intended.  Here, ahead draws the focus onto the way so far, in contrast to forward focusing on the way still to go. After all, His Royal Highness might just want to express his dissatisfaction with the way the Royals are treated those days, in spite of their achievements so far.  No spoiler: they were treated badly. No spoiler: they deserved most of it.  2. Pragmatics: he an old grammar nazi Given that His Royal Highness in Season 5 tends to remind the viewers of a doddery old man, it wouldn’t surprise us to see him interrupting, correcting people all the time, telling them how to behave, speak, and so on. Were that the case, his interrupting would be, after all, just another symptome of the problem being discussed in the meeting.  Eventually, it mirrors the purist attitude that has appeared in then Prince Charles’s speech about the English language devolving in a worrying degree. Make no mistake: purist is just a fancy word for what we call a grammar nazi in everyday contexts. And may I go out on a limb to say a grammar nazi is to language as a royalist is to society?    The Queen Victoria Syndrome.    What do you make of it? Vote below.     he is old and senile he is a grammar nazi he implies that they're already on the way forward     ",
    "tags": "the-crown, movies"
},
    
      {
    "url": "/2022/07/12/why-yoda-speaks-like-that.html",
    "title": "Why Yoda Speaks Like That",
    "text": " Since 1977, the year the first episode of Star Wars was released, the epic space opera has been mesmerising generations after generations. Now when I say epic, I am not only referring to the enormous money that these movies usually require, nor do I have their impressive box office results in mind. Epic here is an adjective that you can use to describe a grandiose work of art that is embedded in a mythical universe, in a world that is highly elaborate to the minutest detail.    Table of Contents  	How Yoda Speaks 	Language Transfer 	When 900 Years Old You Reach 	Inversion 	Dubbing Yoda in Hungarian 	What’s Up with Other Languages?    Given the fact that filmmakers don't have unlimited hours for a movie, epic movies necessarily involve parts of the universe that can't be fully explained on-screen and are left to audiences, especially to the fan base, to find out more about. One of the widely debated questions of the Star Wars universe is Master Yoda's syntax, that is, the way he constructs his sentences, word by word.    Jedi Master Yoda. Photo: Thomas Hawk (Flickr).    How Yoda Speaks  Let's first take a look at how Yoda speaks.   More to learn, he has... (The Phantom Menace) Good friends you are. (Revenge of the Sith) Found someone, you have. (The Empire Strikes Back)   If you Google why Yoda speaks like that, the most common way to describe Yodish or Yodaspeak &ndash; as fans call his way to build sentences &ndash; is using the concepts of syntax, the way words (and phrases) are organised into sentences.  Whoever speaks a little bit of English knows that the usual way to speak of themselves reading a book is I am reading a book where I is the subject, am reading is the verb, and a book is the object, a word that designates the most typical of those: a physical object. That gets us a subject-verb-object (SVO) word order, which is the general syntax of English statements (also called declaratives), and that is why English is often referred to as an SVO type of language among other languages like German, Polish, French, Italian, Spanish etc.  As opposed to modern-day English, Yoda's lines above are based on an object-subject-verb (OSV) syntax. For example, the sentence More to learn, he has has an object more to learn, a subject he, and a verb has, which are put in an OSV order, meaning that the object comes first, then the subject, and then the verb.  Now, for the non-beginners, it is plain and clear that this is very much of an oversimplification. In our second example (Good friends you are.), the phrase good friends can't even be an object, as this sentence is based on a no-object structure (AKA intransitive) with a state-of-being verb (be). And even though the third line includes an object (someone), it is the main verb (found) that is put in the front, which leaves us with a split verb phrase (have | found). Suffice to say, the syntax of Yodish is much more complex than it seems, but it is, indeed, the OSV structure that dominates it.  Language Transfer  It seems that, at least on the surface, Yodish is as simple as it gets. Well, the answer to the question How? is relatively simple; however, the reason why Yoda speaks like that is a different issue. The most common answer that a Star Wars fan would give you is a long-standing misconception: Yoda apparently transfers the syntax of his first language and applies those rules to English.  Many Hungarian ESL (English as a Second Language) learners do something similar: they simply forget to use a verb in a sentence, especially in sentences with be in first-person singular. The English sentence The wall is white. translates into A fal fehér. in Hungarian where the adjective (fehér) takes on the role of a predicate, compared to the usual case with a verb. And that is why Hungarian students are more likely to produce errors such as *The wall white, *I reading, *She born in 2011 etc.  Similarly, Yoda is heavily influenced by his mother tongue, fans argue, that is, he uses syntactic rules alien to modern English because his mother tongue works with an OSV structure. But is it true, and, if not, is it possible to deny it?  After having checked the Old Trilogy as well as the New Trilogy (OT and NT, respectively), I can assure you: Yoda also uses other structures such as SVO and inverted SVO. Examples include the following:   Fear is the path to the dark side... fear leads to anger... anger leads to hate... hate leads to suffering. (The Phantom Menace) You seek Yoda. (The Empire Strikes Back) Twilight is upon me and soon night must fall. (Return of the Jedi) Not far are we from the emergency ship. (Revenge of the Sith) No more training do you require. (Return of the Jedi)   Let's just take the second and the fifth, so that we have each an example for SVO and inverted SVO. In the line You seek Yoda, you is the subject, seek is the verb, and Yoda is the object. Easy as pie, isn't it? The negative inversion in the fifth line is just a little different: because of the fronting of no more training, Yoda needs do-support, i.e. the inclusion of an auxiliary do, and that is what makes the sentence different from More to learn, he has (see above).  Now the only question is how you define an error, and that is a question of high importance if you want to learn, and eventually speak, a language. What Merriam-Webster gives us is some mumbo jumbo about an ignorant or imprudent deviation from a code of behaviour, but that suits us well. Breaking it down into three chunks, so that we can digest it more easily, we arrive at ignorance + deviation + code.  That is to say, an error is when you don't know the code, so you break it. However, Yoda seems to know the code, as approximately one in every five of his sentences is in SVO. So, it is not accidental, nor is it an error of some kind. The only question is the function of the unusual syntax.    Amigurumi Baby Yoda. Photo: Lskbrown (Wikipedia).    When 900 Years Old You Reach  Some say that OSV structures have something to do with the fact that Yoda was born more than eight centuries before the events of the first movie (chronologically speaking). His age shows in his language being an archaic version of the Galactic Basic (English spoken in the Star Wars universe), just as Shakespeare would sound strange if he were alive today.  Shakespeare is a good parallel to Yoda in that he also makes use of the syntactic freedom the users of Early Modern English enjoyed (cf. Right glad I am he was not at this fray. [Romeo and Juliet]). His archaic diction adds to his wisdom, and also, it results in a mysterious, mythical atmosphere that surrounds him as the misty swamp does his little hut. At the same time, it makes it harder for his listeners to decipher his message; a characteristic that some might call riddle-like.  Nonetheless, being a speaking puzzle is not the only explanation for Yodish. It may well be quite the opposite.  Inversion  What we, learners of ESL, can take away from the way Yoda speaks is efficiency: the little green Jedi master doesn't speak much, but when he does, you'd better listen! His syntax supports your attention, [Yoda's] language was designed to make you focus on the boring philosophical lessons, as George Lucas recalls.  If used for the right purposes, inversion is truly a wonderful device, and it serves its master well just as a lightsabre does the Jedi. Both of these structures are about putting emphasis on the elements of a sentence. Consider the sentence that every Padawan wants to hear someday: You require no more training. If Yoda places the object no more training to the front, i.e. he says No more training do you require., he puts more emphasis on the fact that it is not more training Luke needs but something else.  Now again, we know if for a fact that Yoda knows what he's doing.  Check out what he means when using an inversion here:            YODANo more training do you require. Already know you that which you need.    LUKEThen I am a Jedi.    YODANo. Not yet. One thing remains. Vader. You must confront Vader. Then, only then, a Jedi will you be. And confront him, you will.         Here, Yoda leads Luke to the conclusion that, with his training complete, he has become a Jedi. However, this is an inference that only the most inattentive would make: even though Luke has finished his training, he still needs to overcome a challenge that lies in front of the Padawan; namely, he needs to confront Darth Vader.    Still Life with Baby Yoda. Photo: Eric Peacock (Flickr).    Dubbing Yoda in Hungarian  During the past days as we were having a Star Wars marathon, what stroke me the most was that the speech of the Hungarian Yoda was very much ordinary.  Of course, I am not the first person noticing this peculiarity, a journalist at the Hungarian linguist blog Nyelv &eacute;s Tudom&aacute;ny (Language and Science) already wrote about in her 2010 article Master Yoda and Language Typology.  Hungarian, as she also remarks, has a free word order (szabad szórend), but it doesn't mean that you can do whatever you want with the phrases in a sentence. The element that you put right before the verb is the focus of the sentence. However, the basic word order of a neutral sentence is subject-verb-object (SVO), and even though you can deviate from this, some structures may sound just as mysterious, poetic, or enigmatic as Yodish lines to an English speaker.  For example, the OSV-ed translation of the famous quote May the Force be with you would be Veled az Erő legyen. Given the focus at az Erő (the Force), this sentence would refer to the force as an alternative to something else, let's say, another abstract idea such as love. Check out the following mini-discourse, based on Nyelv és Tudomány:            OBI-WANMay the Force be with you!Az Erő legyen veled!    YODAAnd may love with you!Veled a szeretet legyen.         In comparison, the Hungarian OSV would sound strange in an environment where the subject doesn't need to be stressed.            OBI-WANMay the Force be with you!Az Erő legyen veled!    YODAMay the Force be with you!Veled az Erő legyen.         Functionally speaking, this is almost identical to what we were dealing with in the previous part. The syntactic riddle that Luke faces when Yoda uses the inverted order in a conventional way (cf. No more training do you require [but a challenge, you need.]) could easily be translated to Hungarian.  Actually, the problem is never with OSV. It is rather the S-part of the sentence, as the verb often carries the essential information about the subject, so much so that you don't need an explicit subject. Were one to use personal pronouns (&eacute;n, te, ő etc.) everywhere, they'd sound like the somewhat racist depiction of Native Americans in dubbed movies. And remember the case that I have already mentioned above: the copular be is implicit in third-person singular.  Luckily, there's a handful of other solutions.      EnglishNeutral HungarianProposed Translation More to learn, he has.Sokat kell még tanulnia.Sokat tanulnia kell még. I hope right you are.Remélem, hogy igazad van.Hogy igazad van, remélem. Good friends you are.Jó barátok vagytok.Barátaim, jók, vagytok. Stay and help you, I will.Maradok és segítek neked.Maradok és neked segítek. But agree on you taking this boy as your Padawan learner, I do not.De azzal nem értek egyet, hogy a fiú a padawanod legyen.De, hogy a fiú a padawanod legyen, egyet azzal nem értek. 	 	 	 	  The techniques I used here were the following: OSV (5C, 5D), appostion (értelmező jelző [5E]), main clause–subordinate clause inversion (5D), and unusual focus (5F). However, the length of the sentence very much limited the number of solutions as the shorter the sentence was, the less combinations there were for me to replace the words in it. Sure, this doesn’t tell you a lot, as we know: language is all about context. Without a discourse, the strangeness of 5F is close to non-existent. Therefore, we have to check what surrounds it:            LUKENow will you move along, little fella?  We've got a lot of work to do.Most már állj tovább, kisbarátom! Nekünk sok dolgunk van még itt.    YODANo!  No, no!  Stay and help you, I will. Find your friend, hmm?Nem! Nem, nem! Maradok és neked segítek. A barátod megtalálni, hm?    LUKEI'm not looking for a friend. I'm looking for a Jedi Master.Nem a barátomat keresem, hanem egy Jedi mestert.         What’s Up with Other Languages? It was not until 11 years ago that Reddit user Shakedown_1979 raised a similar question on the translation of Yodaspeak. The worldwide discussion started with their list containing 11 languages and the way Yoda’s language was adapted to them, but many languages were added thanks to the contribution of people from all around the world. Unlike Hungarians,  translators of other languages seemed to have concentrated on the archaic, wise, and unusual quality of Yoda’s language. In Turkish, for example, the OSV was applied due to the alleged preference of that structure in Ottoman poetry, but archaisms were added in Japanese and Romanian, too. For Czech, Polish, and Estonian viewers, the syntax of their own Yodas sound quite weird, and putting the object before the verb (SOV, OVS) does so in other Slavic languages (such as Russian), as well, while the Polish and Estonian translations both applied strange foci – just like I did above. Now it is question time. Why do you think Hungarian translators did very little to translate Yodish, and what other ways do you think Yodish may be translated to Hungarian? Let me know what you think in the comments!  ",
    "tags": "translation, ESL, star-wars"
},
    
      {
    "url": "/2022/01/27/the-house.html",
    "title": "Filmek | Egy ház, három család (2022)",
    "text": " A már tavaly decemberben beharangozott és idén debütált The House (magyar címén: Egy ház, három család) című stop-motion antológia viszonylag ismeretlen rendezők kísértetiesen fura bábfilmjeit fűzi össze egy hátborzongató kötetté.    Para patkányok in da house. Image: IMDb.    Az, hogy egy STOP-MOTION BÁBFILM mennyire képes létrehozni bármi nem hátborzongatót, legalábbis kétséges: a thriller alaphangulata ezeknek a filmeknek, olyannyira, hogy tűvé kell tenni a fél Google-t, hogy találjunk valamit, ami akárcsak súrolja a vígjáték határait. Komikum ide vagy oda, para egy rövidfilm az is. Az, hogy mennyire ANTOLÓGIA a film, nehéz kérdés. A Netflix először háromrészes minisorozatként harangozta be a projektet, aztán végül mégiscsak egy bő másfél órás, három fejezetre osztott film lett belőle. A fejezeteket egyenként egy svéd, egy brit és két belga rendező jegyzi, akik váltott lovakkal, a maguk fél-félórájában járják körbe azt a kérdést, hogy mit is jelent pontosan a címben szereplő ház a benne lakóknak. Enyém a ház vagy én vagyok a házé? Az első fejezetben (És hallják bent, hogy hazugság van szövődőben) egy viktoriánus kori család a materializmus fránya ördöge (jelen esetben egy hibbant sztármérnök) jóvoltából kap egy új otthont, teljesen ingyen, pusztán annyi kitétellel, hogy le kell mondaniuk korábbi otthonukról. Persze az ördögi alku nyilván nem merül ki ennyiben: az impozáns épület hamarosan egy pokoljárás színhelye lesz, ami végül is stílszerűen jelöli ki a fejezet kifutását, merthogy anyu függönnyé, apu fotellé változik, a ház meg leég a fenébe. A második fejezetben (Akkor elvész az igazság, amelyet már nem lehet visszanyerni) folytatódik a szereplők kálváriája, sőt meg is találja a csúcspontját. Egy antropomorf városi kisegér rájön arra, hogy az ingatlanfelújítás bizony rizikós befektetési forma: a falakból csótányok és mindenféle aranyos rovarfajok özönlenek elő, ami jól rímel arra, hogy egyszer csak átmegy a fejezet egy laza home invasion-be, tekintve, hogy a háznézőbe érkező patkányok hosszabb távon gondolkodnak. Először csak hunynak egyet a hálószobában, aztán felzabálják az összes kaját, végül pedig megjelenik a csótánycsalád is. A kisegér vesződik velük egy darabig, de aztán feladja a harcot: az eddig emberszerű kisegér valódi kisegérré változik és berágja magát a ház falába. Tök üres a horizont Mondhatnánk, hogy a harmadik fejezet (Hallgasd meg újra, és keresd a napot) egy kicsit kilóg a sorból: nincs átváltozás, nincs horror. A ház persze továbbra is kulcsmotívum: Rosa szeretné kitatarozni a kis emeletes házat, hogy fizetőképes bérlőket szerezzen, holott maga sem tudja pontosan, miért. Hogy felújítsa a házat? Hogy aztán még fizetőképesebb bérlők jöjjenek? Hogy aztán még jobban fel kelljen újítani a házat? Ezek a kérdések nyilván ott bujkálnak valahol a The House antimaterialista példázataiban, ahol minden fejezet főszereplője változtatni akar valahogyan az anyagi helyzetén, de a csúcsszuper ház végtére is bedarálja az elanyagiasodott lakóit. Hogy a harmadik fejezet ilyen szempontból mennyire lóg ki a sorból, nyilván annak kérdése, mennyire olvassuk rá ezt a törvényszerűséget a nagy happy endre. Ha elhisszük, hogy Rosa valóban a felszabadulásba hajózik el, akkor a harmadik fejezet helyét nem nagyon lehet belőni ebben az antológiában. De azért van egy másik vetülete is ennek a befejezésnek. Vegyük az első fejezetet: a főcíménél az óra szerint körülbelül egy perccel vagyunk dél előtt. A fejezet végén a kastélyból kimenekülő gyerekek még egy utolsó pillantást vetnek a házra, a felkelő nap lassan emelkedik a horizont mögött. A következő fejezet elején az óra 5:59-et mutat, a végén pedig a házat felújító kisegér kirágja magát a házból. Végül a napóra fél tizenegyet mutat, a harmadik fejezet végén pedig Rosa elhajózik. Ha úgy vesszük, persze, a szabadságba, a boldogságba, a mindenbe. De a horizont üres, a világ a víz alatt van, Rosa pedig ugyanúgy jut csak ki a házból, ahogyan a gyerekek, a kisegér és végül is mi is: hiszen most is ugyanabban a házban vagyunk.    Annyit bölcsészkedtünk, hogy leszakadt a plafon. Image: IMDb.    De bárhogy is próbálja az ember megbölcsészelni, a The House végtére is csak három, változatosan para tanmese arról, hogy...   ... a legjobb dolgokat nem lehet pénzért megvenni. ... a legfontosabb a család. ... az ingatlan veszélyes befektetés. ... aki függönyöket varr magának, végül maga is függönnyé válik.   A film mindhárom fejezete minőségi stop-motion, ezt el kell ismerni, de a sztori valahogy elfáradt, eltompult a végére. Hiába a ha-úgy-vesszük nyitott befejezés, nagy biztonsággal kijelenthető, hogy az Egy ház, három család jobban működik minisorozatként, mint egészestés játékfilmként. ",
    "tags": "movies, stop-motion, anthology, animated"
},
    
    
    
    {
        "url": "/projects/friendly-feud",
        "title": "Friendly Feud",
        "text": " ",
        "tags": "ESL, Vocabulary, Culture"
    },
    
    {
        "url": "/projects/gap-filling-generator",
        "title": "Gap Filling Generator",
        "text": " ",
        "tags": "ESL, Grammar, Vocab etc."
    },
    
    {
        "url": "/projects/hangman",
        "title": "Hangman",
        "text": " With its variations played all around the world, hangman is a widely known letter-guessing game. Teachers of ESL often apply it in their classroom to revise vocabulary and improve general spelling skills (eg. animals, professions etc.).  The game is very simple.  One of the players thinks of a word and draws as many dashes (–) on the board as many letters in the word (indicating word boundaries if necessary). The other players take guesses on the letters. If they're right, the player reveals the position(s) of the given letter. If they're wrong, the player writes the letter separately from the word, and starts drawing a hanging tree by adding one additional element to it. If the drawing is complete, the guessers lose. The guesser may, at any point of the game, guess the word (without having to guess all the letters).   In most variations, the guessers have appr. 10-14 guesses, and the schematic drawing shows a hanging tree and ragdoll hanged on it.  Violent as it may seem, students love the game without the slightest concern over the brutality of the image.  My motivation in creating an online hangman game was that I’m the worst player of the game.  Although I’m as good at spelling as they come, I have troubles with counting the dashes, revealing all positions of the word; in a word, I’m incompatible with Hangman.  That is why it was hugely important to me to create an algorhythm that, without fail, helps me in that.  Luckily enough, I came across a Github repository containing every word from the Oxford 3000 list. The Oxford 3000 consists of the core vocabulary of English, equivalent to the vocabulary of an A2 level ESL student. Even with the introduction of slight changes (excluding abbreviations and capitalised words), there are 3804 words on the list the game is based on.  Compared to the word list, establishing a fair score system was way more challenging. It goes without saying that the number of tries is one of the main factors influencing the player’s score. However, the length of the word plays just as critical a role in the game, as it is much more difficult to guess a shorter word with a significantly lower probability of hitting the right letter from a narrow set of letters. Therefore, the player’s score should be inversely proportional to the length of the word (i.e., the shorter the word, the greater the score). Of course, the role of chance is always strong with guessing games, and the strategy of going for the shorter words and “skipping” the longer ones may prove effective.  On the other hand, Hangman is more than just a game, it may also be an effective learning tool in developing students’ phonological (phonotactic) and morphological awareness (e.g., possible consonant clusters, frequent suffixes etc.). Let me illustrate this with an example. So, I am given a five-letter word, and, as per usual, no matter if it is Hangman or Wordle, I am going straight for the most common letters of English: R, A, T, E, S. After that, I have R E _ _ _ , so I know it may be a noun or, more likely, a verb with the prefix re- (meaning ‘back’ or ‘again’). Based on my phonotactic instincts, I can safely say that there should be another (semi)vowel in there (and I could have just started with vowels after all), so I guess the letter Y, and olé, it is a hit, now I have R E _ _ Y . As it cannot be RETRY, RELAY, or REPAY (which might not even be on the list), it should be REPLY.             Hangman   First, enter your name:   Guess the word(s) to save the ragdoll.  Name: -Score: -   &nbsp;     LOOK IT UP   HANGMAN TOP 100                                                        ENTER           ",
        "tags": "ESL, Vocabulary, Oxford 3000"
    },
    
    {
        "url": "/projects/point-and-click",
        "title": "Point and Click",
        "text": " ",
        "tags": "ESL, Vocabulary"
    },
    
    {
        "url": "/projects/storyline-teaching",
        "title": "Storyline Teaching",
        "text": " ",
        "tags": "Hungarian Literature, Literary Puzzles, Storyline"
    },
    
    {
        "url": "/projects/text-adventure",
        "title": "Text Adventure",
        "text": " ",
        "tags": "ESL, Vocabulary, Storytelling"
    }
    
]