[
    {
        "taskId": "standard-23maj-reading-1",
        "type": "reading-dialogue",
        "solutions": "[\"G\",\"F\",\"H\",\"B\",\"K\",\"L\",\"M\",\"I\",\"D\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"Read the following questions and answers from the website of a library.\",\"The questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"What other services does the library offer besides lending materials?\",\"B\":\"Can someone else pick up my books?\",\"D\":\"If the library doesn’t have a title I’m looking for, is it possible to order it from another library?\",\"E\":\"Do you charge a fine if the items are not returned in time?\",\"F\":\"What can I do if my library card is not accepted?\",\"G\":\"Is there a membership fee?\",\"H\":\"How many books can I borrow?\",\"I\":\"What can I take into the reading rooms?\",\"K\":\"How long can I keep my borrowed materials?\",\"L\":\"How many times can I renew the items that I borrowed?\",\"M\":\"What happens if I lose or damage the borrowed item?\"}",
        "textTitle": "CITY LIBRARY FREQUENTLY ASKED QUESTIONS",
        "example": "How do I get a library card?",
        "text": "<p>Thank you for being interested in learning more about the City Library. Answers to the most common questions about our services can be found below.</p>(0)<p>You can apply for one in person at the circulation desk. You must bring a photo I.D. and a document that shows your address.</p>(1)<p>No, registration is free for local residents. However, people who live outside the city are required to pay if they want to join the library.</p>(2)<p>Check the dates on the card. You may need to renew your membership. Cards are valid for two years.</p>(3)<p>You can check out up to 20 items at a time, including books, e-books, magazines, CDs and DVDs.</p>(4)<p>Yes, but only if they can show your library card at the desk.</p>(5)<p>The loan period is four weeks. If you would like to keep the items longer, you may renew them in person or online.</p>(6)<p>Up to two times if no one else is waiting for them.</p>(7)<p>You will need to pay the replacement cost of the material that you are unable to return in the original condition.</p>(8)<p>Pencils, paper and a laptop. Bags bigger than A4 size and other items, such as food, drink and pens, must be left in lockers on the ground floor.</p>(9)<p>Yes, our librarians will place the request for you. However, depending on where it comes from, it can take a week or longer for the item to arrive.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-23maj-reading-2",
        "type": "reading-text",
        "solutions": "[\"H\",\"G\",\"D\",\"A\",\"I\",\"B\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this article about providing internet service to mountain climbers.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"As an added bonus, the tourist industry may benefit as well.\",\"B\":\"But the plan caused anger among climbers and expedition guides.\",\"D\":\"They’ll also be able to call for help if they need it.\",\"E\":\"Scientists believe global warming is responsible for the loss of ice.\",\"F\":\"They became the first recorded European climbers to reach Kilimanjaro’s summit in 1889.\",\"G\":\"Roughly one third of the people who try to climb it finally give up.\",\"H\":\"Most of them are trying to climb Mount Kilimanjaro.\",\"I\":\"Only about 83% of the population in Tanzania can get cell phone service where they live.\"}",
        "textTitle": "MOUNT KILIMANJARO GETS INTERNET SERVICE",
        "example": "It’s also the world’s tallest mountain that’s not part of a mountain range.",
        "text": "<p>At 5,895 meters, Mount Kilimanjaro is the highest mountain in Africa. (0) It rises out of a large, flat area in Tanzania and Kenya. The mountain is part of Kilimanjaro National Park, which has around 50,000 visitors each year. (10) But climbing Africa’s tallest mountain isn’t easy. It has snowy glaciers surrounding its peak. (11) </p><p>The government of Tanzania has recently set up a high-speed internet service on the mountain to make it easier for climbers to reach the top. They’ll be able to use the internet to check the weather and use navigation tools. (12) </p><p>The government says safety is the main reason for setting up the internet service on the mountain. (13) Having people post selfies on social media as they work their way up the tallest mountain could certainly make the spot even more popular with visitors. Residents in Tanzania, however, are upset that the government is focusing on tourists instead of helping the people who live in the country. (14) </p><p>Also with tourists in mind, last year the Tanzanian government approved a $72 million project to build a cable car on Mount Kilimanjaro to allow tourists who weren’t climbers to enjoy the mountain. (15) It also bothered people who were worried about how the construction might affect the environment on the mountain. They point out that as a World Heritage site, Mount Kilimanjaro is a place which is important to protect.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-23maj-reading-3",
        "type": "reading-matching",
        "solutions": "[\"B\",\"F\",\"D\",\"I\",\"E\",\"H\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read the following description of escape rooms available for adventurous teams and then read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there are <u>two extra half-sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"the story takes place in space.\",\"B\":\"the team has to escape from an imaginary island which is full of mystery.\",\"D\":\"the players have to prevent an explosion in a tall building.\",\"E\":\"the story is set in the past.\",\"F\":\"the story starts with an accident.\",\"G\":\"the team must save people from a sinking ship.\",\"H\":\"the team’s mission is to solve a murder mystery.\",\"I\":\"the team will go underground to search for something.\"}",
        "textTitle": "CHOOSE YOUR ADVENTURE ",
        "example": "your team must complete challenges to show that you are not spies.",
        "text": "<p>If you’re looking for a fun afternoon with friends, book one of our escape rooms. Here are the missions for your team to choose from.</p><p>The Yellow Room: Spies must be removed from the ministry of wizards where you work. You have one hour to undertake a trial of magic to prove that you are true wizards.</p><p>The Pink Room: You find yourselves on a mysterious island, home to strange animals and magical plants. You’ll need to solve puzzles, unlock portals and find your way back to the real world.</p><p>The Green Room: Going on holiday overseas, your plane has crashed and now you’re all stuck on a small island in the Pacific Ocean. With the weather getting worse, you need a place to hide until the rescue team finds you. You have 45 minutes to build a shelter.</p><p>The Grey Room: The secret service has been working on locating and removing threats from the city centre. As a team of experts, you must find the last bomb at the top of a tower block and save the city.</p><p>The Black Room: Enter a mystical cave and navigate your way in the dark to find the magic lamp without being trapped forever. The cave is full of puzzles designed to guard the powerful lamp.</p><p>The Blue Room: Step into 1942, when the world is at war. As MI6’s top agents you’ve been chosen to discover the location of the enemy’s superweapons, destroy them and save Britain. The Red Room: The mystery takes place at a research laboratory, where a professor has been killed by one of his colleagues. You and your team are detectives who are invited to solve the case and find the criminal.</p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>In The Yellow Room </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'>In The Pink Room </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'>In The Green Room </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'>In The Grey Room </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'>In The Black Room </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'>In The Blue Room </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'>In The Red Room </div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-23maj-reading-4",
        "type": "reading-true-or-false",
        "solutions": "[\"B\",\"C\",\"B\",\"A\",\"A\",\"B\",\"C\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about some scientific research and then read the statements following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "SCIENTISTS LEARN THAT DOGS CAN SMELL STRESS \r",
        "example": "true",
        "text": "<p>Scientists ran an experiment which showed that dogs can tell the difference between the smell of a person when they’re relaxed and when they’re stressed.</p><p>Researchers at Queen’s University Belfast worked with four dogs and 36 humans. The dogs included in the study were pets, volunteered by their owners. First, researchers taught the dogs to use a special smell-testing device. Then, they collected sweat and breath samples from the human participants under two different conditions: in a non-stressful and a stressful situation. When people were calm, their blood pressure and heart rates were measured and then they were asked to wipe their skin with a clean piece of cloth. Then they had to put the cloth sample in a tube and breathe on it hard three times.</p><p>The study team then collected another round of breath and sweat samples a few minutes later, after the people had completed a difficult maths task, counting backward in their heads from 9,000 in units of 17 in front of two researchers for three minutes. The researchers kept telling the people to hurry up. After the task the participants reported feeling stressed, and their blood pressure and heart rate had gone up.</p><p>Then the dogs were given a relaxed and a stressed sample from each person. The dogs correctly identified the stressed sample in 94% of 720 tests.</p><p>The study provides evidence that dogs can smell stress from breath and sweat. Researchers say the skill could be useful when training therapy dogs.</p>",
        "text2": "<div class='gap-container'><div class='statement'>Four universities took part in the research.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The experiment involved police dogs.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Sweat and breath samples were collected from students.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> In the experiment the dogs smelled the participants’ clothes.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The relaxed and stressed samples were taken on the same day.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The stressful task lasted for three minutes.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Each dog was given three samples to choose from.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The study was published in an international journal.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-23maj-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"stressful\",\"stressed\",\"stressing\"],[\"delayed\"],[\"flying\",\"flight\"],[\"emergency\",\"emergent\",\"emerging\"],[\"simpler\"],[\"enjoyable\"],[\"annoying\"],[\"permission\"],[\"immediately\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about what flight attendants don’t like about some passengers’ behavior.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "MAKE THEM HAPPY",
        "example": "irritating",
        "text": "<p>We asked flight attendants about the most (0) <b>(irritate)</b> things passengers do on planes.</p><p>As any frequent traveler will tell you, traveling by air can be a rather (1) <b>(stress)</b> experience, especially as more and more flights are (2) <b>(delay)</b> or canceled. But it's important to remember that (3) <b>(fly)</b> is a miracle, and those who help you get from point A to point B safely — your flight crew members — deserve the highest respect.</p><p>&quot;Our job is much more than serving food and drinks. We are safety professionals and are trained to handle (4) <b>(emerge)</b> situations that can occur during a flight,&quot; Andy, a current crew member at a major airline, shared with Travel + Leisure.</p><p>So, how can you get treated like a VIP in the air by your cabin crew? It couldn’t be (5) <b>(simple)</b>: be nice.</p><p>&quot;If you show me a little respect, I'll be more than happy to make your flight as (6) <b>(enjoy)</b> as possible,&quot; said Andy.</p><p>We carried out a survey to ask flight attendants about what passengers do that crew members find (7) <b>(annoy)</b>. Here are the most offensive actions you should avoid: touching a crew member without their (8) <b>(permit)</b>, asking for water (9) <b>(immediate)</b> upon boarding, using the bathroom at an inappropriate time, pressing the call bell every two minutes, and last but not least, not saying thank you.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-23maj-uoe-2",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"D\",\"H\",\"F\",\"K\",\"M\",\"A\",\"G\",\"I\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read the following questions and answers from the website of a library.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there are <u>three extra words</u> you do not need.\"]",
        "wordList": "{\"A\":\"ACHIEVEMENT\",\"B\":\"COULD\",\"D\":\"COUPLE\",\"E\":\"DIRECTION\",\"F\":\"GIVE\",\"G\":\"MANAGED\",\"H\":\"SEVERAL\",\"I\":\"SAY\",\"K\":\"TAKE\",\"L\":\"TELL\",\"M\":\"WAY\"}",
        "textTitle": "A BUSY JOURNEY",
        "example": "ONCE",
        "text": "<p>The famous biographer David McCullough (0) told the following story from the early life of Theodore Roosevelt:</p><p>Once upon a time, in the coldest days of winter, in the Dakota Territory, Theodore Roosevelt took off in a small boat down the Little Missouri River to catch a (10) of thieves who had stolen his favorite rowboat.</p><p>After (11) days on the river, Roosevelt caught up with the thieves. He drew his trusty Winchester rifle, and forced them to (12) up the stolen boat. Then he set off in a borrowed horse-drawn wagon to (13) the thieves cross-country to prison. They traveled across the snow-covered wilderness to the railway at Dickinson, North Dakota, and Roosevelt walked the whole (14), the entire forty miles. It was an extraordinary (15). But what makes it especially important is that during that time, he (16) to read all of Anna Karenina, Leo Tolstoy’s 900-page novel.</p><p>I often think of this story when I hear people (17) they haven’t time to read.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-23maj-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"to\"],[\"up\"],[\"as\",\"in\",\"become\",\"becoming\",\"inspire\"],[\"to\"],[\"be\",\"feel\"],[\"like\",\"resembling\"],[\"makes\"],[\"out\",\"in\",\"their\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about a new Barbie doll inspired by Dr. Jane Goodall, one of the world's most famous conservationists.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "DR. JANE GOODALL BARBIE DOLL MADE OF RECYCLED PLASTIC",
        "example": "be",
        "text": "<p>Barbie is going green with a new doll modeled after Dr. Jane Goodall, which will (0) released next Tuesday ahead of World Chimpanzee Day. According (18) Mattel company, Goodall's Barbie doll is made of 90 percent recycled plastic that otherwise would have ended (19) in the ocean.</p><p>The 88-year-old researcher tells People Magazine she &quot;couldn’t be happier&quot; to see herself (20) a Barbie doll, something she long hoped for. Goodall says she wants her Barbie (21) &quot;inspire little girls&quot; everywhere. &quot;So many people know about Jane because they learn about me at school,&quot; she says, &quot;so I think they'll (22) delighted to be given a Barbie Jane.&quot;</p><p>Lisa McKnight, Executive Vice President of Barbie and Dolls at Mattel, said in a statement that the company is &quot;excited to introduce&quot; the new doll. &quot;Kids need more role models (23) Dr. Jane Goodall because imagining that they can be anything is just the beginning – seeing it (24) a huge difference,&quot; said McKnight.</p><p>&quot;We hope this collection and our respect for women in science will inspire girls to learn more about green careers, how they can protect the planet, and act (25) stories about the environment in their doll play,&quot; she added.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22okt-reading-1",
        "type": "reading-dialogue",
        "solutions": "[\"H\",\"E\",\"K\",\"I\",\"B\",\"A\",\"F\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"Read the following collection of frequently asked questions and answers from the website of a language school.\",\"The questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"Will I get a copy of the listening materials that are used in the class?\",\"B\":\"Can I pay a deposit and then pay the rest of the fee later?\",\"C\":\"What is the profile of the students on the courses?\",\"D\":\"What is the minimum number of students?\",\"E\":\"How do I know what level I am?\",\"F\":\"If I like my teacher and classmates, can I continue with them next term?\",\"G\":\"Am I allowed a discount if I book two courses?\",\"H\":\"How big are the classes?\",\"I\":\"Can I join a class in the second week?\",\"K\":\"How soon should I enrol?\"}",
        "textTitle": "FAQS LANGUAGE COURSES UK",
        "example": "What is the profile of the students on the courses? ",
        "text": "<p>Cannot find the information you are looking for? Email info@languagecoursesuk.co.uk for a response within 24 hours.</p>(0)<p>Our evening courses are for adults of all ages and for all levels from beginners upwards. For most courses, the average age range will be mid-20s to mid-40s.</p>(1)<p>Our maximum class size is 12 students per class for face-to-face courses. If the course takes place online, the maximum class size is 10.</p>(2)<p>If you are unsure where to start or progress to, take our online placement test.</p>(3)<p>The earlier the better. If we don’t receive enough bookings for a course, we will regrettably have to cancel it.</p>(4)<p>Yes, if there is space in the classes, we can take bookings for students to join the class a week later, although there will be no discount on the price.</p>(5)<p>No, the entire amount must be paid by card at time of booking.</p>(6)<p>No, our coursebook CDs are designed to be used in class and with a teacher; they are not designed for self-study.</p>(7)<p>Although we can’t guarantee that your teacher will be available, we’ll do our best to assign them to your next level.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22okt-reading-2",
        "type": "reading-headings",
        "solutions": "[\"H\",\"G\",\"B\",\"E\",\"D\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"In the following text about volunteering, the headings have been removed.\",\"Your task is to match the headings to the paragraphs.\",\"Place the headings into the appropriate box.\",\"Place the headings in the gaps as in the example.\",\"Remember that there are <u>two extra headings</u> you do not need.\"]",
        "wordList": "{\"A\":\"Find what fits your timetable\",\"B\":\"Look after abandoned pets\",\"D\":\"Support a health-related cause\",\"E\":\"Help the environment\",\"F\":\"Help and see the world\",\"G\":\"Help during the holiday season\",\"H\":\"Help kids learn and grow\"}",
        "textTitle": "VOLUNTEERING",
        "example": "Find what's best for you",
        "text": "<p>Volunteering is an opportunity to change lives, including your own. If you'd like to support a cause but can't afford to donate money, you can donate your time instead. So how do you go about it?</p>(0)<p>When volunteering, you can pick what really interests you and who or what is most deserving of your time. Here are some ideas to get you started:</p>(8)<p>Become a camp counsellor, or volunteer for an after-school sports program. Provide homework help in a specific subject or become a reading partner for students who struggle with reading.</p>(9)<p>Serve Christmas dinner to the homeless, volunteer at your local food bank, or distribute toys to kids. Local charities also may be able to use your help then.</p>(10)<p>Most shelters depend on volunteers to keep the cats and dogs happy and well exercised. And when you're walking rescued dogs, you get a workout too.</p>(11)<p>Join a conservation group and count wildlife or plants. Take part in a local park clean-up day. You don't have to be an outdoors type — you could help out in a park office or education centre as well.</p>(12)<p>Lots of us are close to people who have a medical problem. It can feel good to donate your time to an organization that raises money for research, delivers meals, or offers other help to people with an illness.</p><p>Volunteering gives you a place to be where you can have a good time, keep busy and make the world a better place.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22okt-reading-3",
        "type": "reading-true-or-false",
        "solutions": "[\"C\",\"C\",\"B\",\"A\",\"C\",\"A\",\"B\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this article about a meteorite that landed in a Canadian home and then read the statements (13-19) following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "METEORITE CRASH-LANDED IN A CANADIAN WOMAN’S BED WHILE SHE SLEPT",
        "example": "false",
        "text": "<p>When Ruth Hamilton woke up on October 3 to the sound of her dog barking, followed shortly by an explosion and drywall pieces falling on her face, she was afraid there was a burglar in the house. But instead, she noticed a dark grey rock behind her pillows that matched the size of the hole in her ceiling.</p><p>The police officer who visited Ms Hamilton’s home first suspected that a nearby building site might be responsible for the damage. But the construction workers made the officer think of another explanation. They had heard a loud noise and seen an explosion in the sky just before Ms Hamilton reported the incident. “The police officer came back in and said: ‘Well, I think you have a meteorite in your bed,’” says Ms Hamilton.</p><p>Ms Hamilton shared the space-rock, which weighs about 1.3 kilograms, with researchers at the University of Western Ontario, which has a collection of meteorites, so they can study it further. &quot;It's certainly a meteorite,&quot; says meteor physicist Peter Brown, member of the research team. &quot;Everything about the story pointed to a meteorite fall, and the fact that the bright fireball had occurred basically right at the same time made it a pretty obvious case.&quot;</p><p>The researchers are asking local residents for videos that may have captured the fall of the fireball. They can use video to reconstruct the path that the meteorite followed from the asteroid belt to Earth.</p><p>Ms Hamilton considers herself lucky to be unharmed. “I didn’t get hurt,” she says. “I didn’t even get a scratch. So, all I had to do is have a shower and mop the floor.”</p><p>Because the meteorite landed on Ms Hamilton’s property, it belongs to her, and she plans to keep it as a souvenir of the unusual night. Her grandchildren also think it’s pretty cool.</p>",
        "text2": "<div class='gap-container'><div class='statement'>Ruth Hamilton was woken up by pieces of wall falling on her bed.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The incident happened shortly after midnight.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Ruth Hamilton’s home had been broken into before.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The construction workers did not notice anything strange.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Researchers are sure that the rock is a meteorite.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Residents will be paid a small sum of money for sharing videos that capture the fireball.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Ms Hamilton did not get injured when the space-rock hit her home.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Ms Hamilton has given the meteorite to her grandchildren as a souvenir.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-22okt-reading-4",
        "type": "reading-text",
        "solutions": "[\"A\",\"G\",\"B\",\"H\",\"K\",\"F\",\"D\",\"I\",\"M\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about a library delivery service.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"have access to books\",\"B\":\"work for delivering books to students, too\",\"D\":\"required summer reading for a 14-year-old student\",\"E\":\"used school buses to deliver reading material to kids\",\"F\":\"loaded each book onto a drone\",\"G\":\"deliver food and other items\",\"H\":\"lived in the delivery zone\",\"I\":\"allowed to request more than one book\",\"K\":\"put them in a special package\",\"L\":\"find a satisfied customer\",\"M\":\"returned to in-person classes\"}",
        "textTitle": "DRONE DELIVERS BOOKS TO KIDS",
        "example": "delivered to their homes by drones",
        "text": "<p>Kids in the Montgomery County school district had a special way of getting books to read when the pandemic started: the books were (0). A drone is a small remote-controlled aircraft, like a toy-sized plane or helicopter.</p><p>Kelly Passek is a librarian at a local school. When schools closed because of the Covid-19 pandemic, she wanted to make sure students in her school district would still (20).</p><p>A company called Wing Aviation uses drones to (21) from restaurants and stores in Ms Passek’s town. She had used the drone service to have things delivered to her own home, and she thought it could (22).</p><p>The people at Wing agreed and the company began making deliveries. Students who (23) could fill out a Google form to request a specific book, or ask Ms Passek to choose one for them.</p><p>Ms Passek received the requests, then got the books from the library, (24), and took them to Wing’s shipping centre.</p><p>Wing (25), which flew to the delivery location, lowered the book on a cable, and released it when it was close to the ground.</p><p>The first book sent out this way – and maybe the first library book ever to be delivered by drone – was <i>All Quiet on the Western Front</i>, by Erich Maria Remarque. It was (26) in the district.</p><p>The drones have a wingspan of about one metre, and weigh about 4.5 kilograms. They can carry packages that weigh up to 1.3 kilograms, so students were (27).</p><p>Students have now (28), but many are hoping to use the drone service in the future.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22okt-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"pollution\"],[\"natural\"],[\"fashionable\",\"in-fashion\"],[\"description\"],[\"offer\"],[\"suitable\"],[\"creative\"],[\"environmental\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about a new way of gardening.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "RENT A GOAT",
        "example": "healthy",
        "text": "<p>It’s hard to keep your backyard tidy and (0) <b>(health)</b> without harming the Earth. Just consider the tools. Lawn mowers use fossil fuels, adding to the (1) <b>(pollute)</b> of the atmosphere every time you push them across the grass.</p><p></p><p>That’s why many are trying out a more (2) <b>(nature)</b> form of lawn care and management: goats. According to Forbes, goat rentals are becoming a(n) (3) <b>(fashion)</b> service for homeowners and farmers who want to get their land under control.</p><p></p><p>Goat rental businesses function very simply. Customers call in with the (4) <b>(describe)</b> of their land — the size, the landscape, and any other important features. Then the goat rental service makes a(n) (5) <b>(offer)</b>. Once the price is settled, the two parties agree on a(n) (6) <b>(suit)</b> date of service. On that day, the goats arrive. They graze the grass until the evening, then leave, and possibly return the next morning if the size of the job makes it necessary. When their work is done, customers are left with a freshly manicured lawn, achieved without burning any fossil fuel.</p><p></p><p>These (7) <b>(create)</b> businesses can send 100 or more goats at a time. Goats offer obvious (8) <b>(environment)</b> benefits, since they replace both mowers and chemical insect killers.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22okt-uoe-2",
        "type": "uoe-multiple-choice",
        "solutions": "[\"B\",\"C\",\"C\",\"A\",\"A\",\"D\",\"B\",\"B\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about the mystery of the Hanging Gardens of Babylon. Some words are missing from the text.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\"]",
        "wordList": "{\"0\":{\"with\":\"A\",\"in\":\"B\",\"of\":\"C\",\"about\":\"D\"},\"1\":{\"might be\":\"A\",\"were\":\"B\",\"had\":\"C\",\"have been\":\"D\"},\"2\":{\"as\":\"A\",\"very\":\"B\",\"so\":\"C\",\"much\":\"D\"},\"3\":{\"then\":\"A\",\"there\":\"B\",\"than\":\"C\",\"that\":\"D\"},\"4\":{\"far\":\"A\",\"much\":\"B\",\"many\":\"C\",\"that\":\"D\"},\"5\":{\"has\":\"A\",\"had\":\"B\",\"never\":\"C\",\"was\":\"D\"},\"6\":{\"How\":\"A\",\"Must\":\"B\",\"Would\":\"C\",\"Did\":\"D\"},\"7\":{\"passed\":\"A\",\"past\":\"B\",\"several\":\"C\",\"late\":\"D\"},\"8\":{\"certain\":\"A\",\"unlikely\":\"B\",\"likely\":\"C\",\"certainly\":\"D\"}}",
        "textTitle": "THE HANGING GARDENS OF BABYLON",
        "example": "of",
        "text": "<p>Ancient writers describe a fantastic series (0) gardens constructed at the ancient city of Babylon in modern-day Iraq. It’s not clear when these gardens (9) built, but some writers were (10) impressed that they called them a “wonder of the world”. Around 250 B.C., Philo of Byzantium wrote that the Hanging Gardens had “plants grown at a height above ground level, and the roots are planted in an upper terrace rather (11) in the earth.”</p><p></p><p>So (12), archaeologists who have excavated Babylon have been unable to find the remains of the garden. This (13) left archaeologists with a question: (14) the hanging gardens really exist? In 2013, a researcher at the University of Oxford proposed that the gardens were actually located at the Assyrian city of Nineveh. Over the (15) two decades, both Babylon and Nineveh have suffered damage from wars, and it seems (16) that this mystery will ever be solved.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22okt-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"for\"],[\"there\",\"here\"],[\"others\",\"some\",\"many\"],[\"that\",\"which\"],[\"out\",\"around\"],[\"to\"],[\"to\",\"over\",\"but\"],[\"all\"],[\"in\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read about a journalist’s experiences in the Bahamas.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "WHERE PIGS SWIM FREE",
        "example": "own",
        "text": "<p>For more than 30 years, I have photographed animals. It is important to me to portray animals as having their (0) thoughts and personalities.</p><p>I heard about the swimming pigs from an Englishwoman, who told me that she was 300 feet offshore in the Bahamas when a pig smelled her pizza and swam out to ask (17) a bite.</p><p>The pigs live on Big Major Cay, a tiny, uninhabited island with thick forests. About a dozen pigs live here, and (18) are different stories about how that happened. Some say the pigs swam to the island after a shipwreck; (19) say sailors left them here, planning to come back and eat them. Recently, they’ve become celebrities. The comedian Amy Schumer posted a photograph on Instagram (20) showed her and her buddies hanging (21) with one of the pigs on the island.</p><p>On the island, the pigs are very tolerant of tourists. They expect (22) be fed. When I was there in February, a lot of people brought salad and bread. My guide, Dreko, said the pigs prefer anything (23) salad, as they already have that on the island, but being pigs, they ate it all.</p><p>All in (24), it was more interesting to watch the people. They want this exciting pig experience and can become unbelievably and noisily happy, (25) spite of the fact that they probably ate bacon and eggs for breakfast.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22maj-reading-1",
        "type": "reading-true-or-false",
        "solutions": "[\"B\",\"A\",\"C\",\"B\",\"A\",\"B\",\"C\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"Read this article about a road incident and the sentences following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "FIVE-YEAR-OLD CAUGHT DRIVING PARENTS' CAR IN UTAH",
        "example": "true",
        "text": "<p>Five-year-old Adrian took the family car, and was only caught when police in Utah State stopped him on the freeway. A patrolman saw the car, which was crossing lanes at 50km/h, and made the car stop. He was shocked to discover the child behind the wheel, who said he was on his way to buy a Lamborghini.</p><p>The boy told police that he had left home after his mother refused to buy him the luxury car – lower-priced models cost over $180,000 –, which caused an argument.</p><p>&quot;He decided he'd take the car and go to a car salesman in California to buy one himself,&quot; Utah Highway Patrol said on Twitter, &quot;but he only had 3 dollars in his wallet.&quot;</p><p>Camera footage posted by the local TV shows the car in traffic before stopping at the police signal. Highway patrol first thought it might be a driver with health problems behind the wheel. In the recording, the officer can then be heard saying &quot;How old are you? You're five years old?&quot; when he sees the boy. The boy was sitting at the very edge of the seat to be able to reach the pedals. He was stopped about five minutes' drive from home.</p><p>No-one was hurt in the incident. The boy’s parents were at work and he was in the care of a relative when he took the car. Police asked parents to make sure car keys are not easily accessible to children.</p>",
        "text2": "<div class='gap-container'><div class='statement'>The boy was stopped by the police.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The boy told the policeman he was going to a toy shop.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The boy wanted his mother to buy an expensive car but she said 'no'.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The boy wanted to get the car as a present for his birthday.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The boy’s wallet was empty.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> A video recording of the incident was made.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The boy was injured in the car.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The boy’s parents were interviewed by TV reporters.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-22maj-reading-2",
        "type": "reading-dialogue",
        "solutions": "[\"I\",\"A\",\"K\",\"F\",\"B\",\"G\",\"E\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read the following questions and answers about buying products online.\",\"The questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"How can I check the status of my order?\",\"B\":\"How much time do I have if I decide to return an item?\",\"D\":\"When will I get my refund?\",\"E\":\"Why did I only receive part of my order?\",\"F\":\"How can I change my order?\",\"G\":\"My order is damaged – what can I do?\",\"H\":\"Are the products available for international delivery?\",\"I\":\"How long will it take for me to get my order?\",\"K\":\"Can I cancel my order?\"}",
        "textTitle": "ONLINE SHOPPING – FREQUENTLY ASKED QUESTIONS",
        "example": "How can I pay for my order?",
        "text": "<p>Here you'll find answers to some of the questions we are asked most frequently. Please contact our customer service with any further questions you have.</p>(0)<p>We currently accept Visa, MasterCard and American Express. We also accept payment via PayPal.</p>(8)<p>For standard shipping, you should receive it within 4-5 business days.</p>(9)<p>We will notify you via email when your order is on the way. You can also track your delivery by clicking here.</p>(10)<p>Yes, but only within 30 minutes of placing it. You can, however, return any unwanted items to us for a refund once you receive them.</p>(11)<p>Unfortunately, once you’ve placed your order, we are unable to accept any changes. This means we cannot alter your payment details or the quantity, size or colour of the item you’ve ordered.</p>(12)<p>Unwanted items can be sent back to us in the original packaging within 35 days of purchase.</p>(13)<p>We are sorry to hear that your order did not arrive in perfect condition. Please contact our customer service team, who will be happy to help with your replacement order or refund.</p>(14)<p>While we do our best to ship all orders in one package, there are times when orders will ship from different locations. Please allow a little extra time for the next parcel to arrive.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22maj-reading-3",
        "type": "reading-text",
        "solutions": "[\"H\",\"E\",\"A\",\"D\",\"F\",\"K\",\"G\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this article about public restrooms in Japan.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"the see-through walls solve two problems\",\"B\":\"upgrade public restrooms across the country\",\"D\":\"where they are located\",\"E\":\"the glass clears up again\",\"F\":\"others worry that the walls might not work properly\",\"G\":\"architects have been asked\",\"H\":\"and locks the door\",\"I\":\"privacy is needed from time to time\",\"K\":\"that will be installed across Tokyo\"}",
        "textTitle": "JAPAN TRIES OUT SEE-THROUGH PUBLIC TOILETS",
        "example": "including some with automatic lids and self-warming seats",
        "text": "<p>In recent years, Japan has had many advanced and unusual toilets, (0). Now one area of Tokyo is trying something completely new – public toilets with see-through walls. To be fair, the walls of the new public toilets aren’t always transparent. They are made of a special “smart glass”. When someone enters the toilet (15), the glass becomes opaque – it clouds over so that no one can see in. When the door is unlocked, (16).</p><p>The idea of a transparent public toilet may sound unusual, but (17). Without ever entering the restroom, people can now check to see how clean it is, and whether anyone else is using it.</p><p>The new toilets have been built in two parks in Tokyo, which opened to the public this month. As the restrooms are lit up at night, they help provide light for the part of the parks (18).</p><p>So far, the public has had mixed reactions to the see-through restrooms. Some people are excited to use them, while (19) and could allow them to be seen when they’re using the toilet.</p><p>Transparent toilets are just one of several new public toilet designs (20) in the coming months as part of the Tokyo Toilet Project. 16 designers and (21) to come up with new designs to improve the image of public restrooms in Tokyo.</p><p>The important part of improving public restrooms isn’t just about changing styles. It means making sure they are clean and well-lighted as well.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22maj-reading-4",
        "type": "reading-matching",
        "solutions": "[\"I\",\"D\",\"A\",\"H\",\"F\",\"B\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read the following article about award-winning wildlife photos and then read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there are <u>three extra half-sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"won a prize for a portrait of an animal with an unusual ‘face’.\",\"B\":\"took a picture of a moment in the life of an animal family.\",\"D\":\"took a picture of a small endangered animal eating another animal.\",\"E\":\"show wildlife underwater.\",\"F\":\"was helped by another person to be able to take the picture.\",\"G\":\"is held every two years.\",\"H\":\"has three age categories.\",\"I\":\"had been waiting for months to take the award-winning picture.\",\"K\":\"was awarded in three categories.\"}",
        "textTitle": "THE BEST WILDLIFE PHOTOS OF THE YEAR",
        "example": "received over 40 thousand entries this year.",
        "text": "<p>The Natural History Museum in London holds a yearly contest for the Wildlife Photographer of the Year, with over 10 categories. This year’s contest had 49,000 entries from around the world.</p><p>This year’s grand prize winner was Sergey Gorshkov’s picture of a Siberian tiger. Siberian tigers are endangered; only about 500 of them live in Russia’s far east. It took Mr. Gorshkov ten months to get a shot of one of them. It looks like the tiger is hugging the tree, but it’s actually trying to leave its smell as a way of communicating with other tigers.</p><p>Another endangered animal, a glass frog, was a category prize winner. Jaime Culebras said he had walked for four hours in the Andes mountains in the middle of a rainstorm, before he captured the picture of the frog snacking on a spider.</p><p>Mogens Trolle won the Animal Portraits prize with his picture of a young proboscis monkey, which is sitting calmly, enjoying the sunlight with its eyes closed. Proboscis monkeys look strange because the male’s nose can eventually grow so big that it hangs over its mouth and may have to be pushed aside to eat. They’re endangered and only found on Borneo and the islands nearby.</p><p>There is a separate contest for people under 18, known as the Young Wildlife Photographer of the Year. In this contest, pictures are judged in three separate age groups.</p><p>In the 10 and under category, Andrés Luis Dominguez Blanco of Spain won with his picture of a bird called a “stonechat” sitting on a bending plant. He asked his father to drive him to the field, in order to use the car as a hiding place for taking photographs. Andrés managed to take the picture without scaring the bird.</p><p>Another young winner, Liina Heikkinen had spent a day watching two adult foxes bring food to their cubs. After one parent brought home a goose, the cubs fought over it. Liina took a picture of a young fox eating the goose, while hiding away from his siblings.</p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>The Wildlife Photographer of the Year contest </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Sergey Gorshkov </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Jaime Culebras </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Mogens Trolle </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The Young Wildlife Photographer of the Year contest </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Andrés Luis Dominguez Blanco </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Liina Heikkinen </div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-22maj-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"difficulty\"],[\"better\"],[\"achievements\"],[\"records\"],[\"professional\"],[\"extraordinary\",\"out-of-the-ordinary\",\"inordinary\",\"unordinary\"],[\"impossible\"],[\"famous\",\"famed\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about a Guinness World Record holder who builds houses of cards.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "THE HOUSE OF CARDS CHAMPION",
        "example": "creations",
        "text": "<p>Bryan Berg is a cardstacking legend from Iowa. He began building card structures with his grandfather when he was about 8 years old. He built his first (0) <b>(create)</b>, simple boxlike “houses,” with great (1) <b>(difficult)</b>. But Berg didn’t give it up and worked hard to make the cards stand much (2) <b>(good)</b> and longer. Today he holds the Guinness World Record for the largest playing card structure and the tallest house of cards — reaching the first of these (3) <b>(achieve)</b> while in high school. Since then, he’s broken each of his (4) <b>(record)</b> several times.</p><p></p><p>As a (5) <b>(profession)</b> cardstacker, Berg creates card structures around the world. They’re so strong, they can hold a cement brick, yet he never uses glue — nothing but thousands of regular playing cards. His most (6) <b>(ordinary)</b> creations include some really (7) <b>(possible)</b> structures, such as Cinderella’s castle from Walt Disney World, New York’s Empire State Building and the Guggenheim Museum, as well as these (8) <b>(fame)</b> Washington landmarks: the U.S. Capitol, the Lincoln Memorial and the Washington Monument.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22maj-uoe-2",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"H\",\"M\",\"G\",\"E\",\"L\",\"I\",\"K\",\"D\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read a joke about choosing the right present.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there are <u>three extra words</u> you do not need.\"]",
        "wordList": "{\"A\":\"ACCEPTING\",\"B\":\"AS\",\"D\":\"AT\",\"E\":\"BELIEVE\",\"F\":\"COULD\",\"G\":\"CHARMING\",\"H\":\"HAPPENS\",\"I\":\"HOW\",\"K\":\"MUST\",\"L\":\"OWNED\",\"M\":\"TAKES\"}",
        "textTitle": "A COSTLY PRESENT",
        "example": "FOR",
        "text": "<p>A rich man walks into a pet store for people with fat wallets. He explains that he’s looking (0) a birthday present for his friend.</p><p>And his friend (9) to like birds, so he needs a very talented parrot. The store owner says that he’s just got some perfect birds and (10) the man over to a huge stand with three exotic parrots.</p><p>“These birds are very special; the first one here on the right speaks three languages, knows a bunch of jokes, loves whisky and Cuban cigars. We’re selling him for five million dollars. The second one on the left speaks ten languages fluently, is a(n) (11) entertainer and loves kids and women. (12) it or not, his ancestry goes back all the way to a parrot (13) by Queen Elizabeth I, and trust me, these birds know (14) to pass an anecdote from generation to generation! This one goes for fifty million dollars. And finally, the third one, here in the middle, is the most special and expensive; we are selling him for a hundred million.”</p><p></p><p>Amazed, the guy shouts: “He (15) speak at least twenty languages!” </p><p>“You know, this one doesn’t talk (16) all, but those two call him Boss,” the owner explains.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-22maj-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"to\"],[\"their\"],[\"by\"],[\"of\"],[\"his\"],[\"for\"],[\"have\"],[\"that\",\"which\"],[\"one\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read about the history of M&M’s.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "THE UNTOLD TRUTH OF M&M'S",
        "example": "a",
        "text": "<p>With so many colors and flavors to choose from, surely, there’s (0) pack of M&M’s for everyone. And it’s pretty safe (17) say almost everyone has tried these little candy-coated chocolates at some point in (18) lives.</p><p>M&M’s were first introduced in the U.S. (19) Forrest E. Mars in Newark, New Jersey in 1941. But the story started earlier. Frank C. Mars had founded a candy business in 1911, and his son, Forrest, took on the job years later. Forrest wasn’t too fond (20) how his father had been running the company, and he had a new candy idea of (21) own. So, he found a business partner to make the candy-coated chocolates.</p><p>Forrest Mars eventually paired up with Bruce Murrie, and they began making M&M’s at their new company Mars & Murrie, which has since put Twix, Snickers and lots of other brands on the market.</p><p>Original M&M’s and Peanut M&M’s were the only two flavors (22) quite some time, until Peanut Butter M&M’s debuted in 1989. Since then, more and more flavors (23) followed.</p><p>There are only a few brands (24) can say they made it to space. M&M’s is (25) of them. According to M&M’s history, M&Ms were actually the first candy to be chosen to go to space in 1981.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21okt-reading-1",
        "type": "reading-headings",
        "solutions": "[\"H\",\"D\",\"A\",\"I\",\"F\",\"E\",\"B\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In the following text about online gaming, the headings have been removed.\",\"Your task is to match the headings to the paragraphs.\",\"Place the headings into the appropriate box.\",\"Place the headings in the gaps as in the example.\",\"Remember that there are <u>two extra headings</u> you do not need.\"]",
        "wordList": "{\"A\":\"Say no to meeting in person.\",\"B\":\"Stay legal.\",\"D\":\"Protect your account.\",\"E\":\"Avoid unwanted charges.\",\"F\":\"Take regular breaks.\",\"G\":\"Avoid online interactions.\",\"H\":\"Keep personal information safe.\",\"I\":\"Know what to do if other players are ruining the game.\",\"K\":\"Notice and control your emotions during the game.\"}",
        "textTitle": "TOP TIPS FOR GAMING",
        "example": "Check if you are old enough to play.",
        "text": "<p>Whether it is done via mobile devices or using games consoles, gaming is one of the top activities enjoyed by young people online. Here are our tips to play safely:</p>(0)<p>It is important to find out information on age ratings. Look out for the icon on the game that shows what age classification it has been given.</p>(1)<p>Don’t share identifying details like your full name, mobile phone number or address. Sharing this type of information could put you at great risk.</p>(2)<p>To avoid being hacked, pick a strong password. Make sure you include a combination of letters, numbers and symbols. Treat your password like your toothbrush: you shouldn't share it with anyone else.</p>(3)<p>Online friends are still strangers even if you have been talking to them for a long time and meeting someone you have only been in touch with online can be dangerous.</p>(4)<p>Make sure you know what tools are available if someone is being aggressive in a game. Learn how to block, mute, delete and report on the games and consoles you use.</p>(5)<p>Games have been designed to be fun and exciting and to keep us coming back for more. But remember, for healthy gameplay, it’s important to stop for at least five minutes every hour.</p>(6)<p>You may be asked to pay for items in the game or to upgrade to the next level. The amount may seem small, but you can run up a large bill before you even realise it. We suggest blocking in-app purchases.</p>(7)<p>Don’t break the law by downloading non-copyrighted games or cheat programmes to skip to a higher level.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21okt-reading-2",
        "type": "reading-text",
        "solutions": "[\"E\",\"H\",\"K\",\"B\",\"F\",\"D\",\"G\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this article about an unusual job advertisement.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"always wear a wig, as well\",\"B\":\"if the parents have to work late\",\"D\":\"share that love of those characters\",\"E\":\"where they describe in detail\",\"F\":\"are crazy about Disney princesses\",\"G\":\"working just four days a week\",\"H\":\"a new character every month\",\"I\":\"looking after them when they are sick\",\"K\":\"perform regular nanny duties\"}",
        "textTitle": "DISNEY PRINCESS FOR A NANNY?",
        "example": "in a part-time nanny role",
        "text": "<p>If you’re tired of your office job and want a creative challenge, you might want to consider this new position. A married couple are looking for someone to take care of their six-year-old twin girls (0), but there’s a catch – you have to do it dressed as a Disney princess. The parents posted an advert on <i>Childcare</i>, (8) exactly what they are looking for.</p><p></p><p>You’ll need to dress and play (9), whether that’s Anna from <i>Frozen</i>, Snow White, Rapunzel or Cinderella. The chosen nanny will be asked to arrange Disney-related activities, such as arts and crafts, baking and singing, as well as (10), including picking the girls up from school, cooking dinner and putting them to bed (11).</p><p></p><p>According to the couple, the twin girls (12) and their parents believe this is the best way to communicate some important values to them. The pair admit that it’s an unusual request, but want to use Disney princesses to teach the twins about “things like kindness, empathy, bravery and ambition.” According to the couple, the right person will “have a passion for all things Disney” and will be able to (13) with their girls.</p><p></p><p>The right candidate will take home £40,000 a year, (14). The Disney costumes will also be paid for by the parents, and 25 days’ holiday is on the table.</p><p></p><p>So now is the time to ask yourself the question: Do you have what it takes to be a part-time Disney princess?</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21okt-reading-3",
        "type": "reading-matching",
        "solutions": "[\"E\",\"I\",\"D\",\"A\",\"G\",\"H\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read the following article about an incident on a plane and then read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there are <u>two extra half-sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"gave Mr Bennet sleeping pills.\",\"B\":\"apologised for the incident.\",\"D\":\"was unable to wake up Mr Bennet before take-off.\",\"E\":\"didn’t speak English well enough to explain the situation.\",\"F\":\"paid some money as compensation.\",\"G\":\"decided that Mr Bennet should get off the plane.\",\"H\":\"offered another flight a week later.\",\"I\":\"examined Mr Bennet and said that he was able to fly.\"}",
        "textTitle": "CANADIAN MAN KICKED OFF WESTJET FLIGHT FOR BEING ASLEEP BEFORE TAKE-OFF",
        "example": "missed part of the vacation.",
        "text": "<p>Mr Bennett, his wife and their son were taking a WestJet flight from Toronto to Cuba on 13 October. Mr Bennet hadn’t slept well the night before, so before the flight he took a sleeping pill which he had been given by his doctor. He fell asleep immediately after boarding the plane. The trouble began when a flight attendant couldn’t wake him up as the plane was preparing to take off. He became worried that there was something medically wrong with the passenger. WestJet requires all passengers to be awake during take-off for safety reasons.</p><p></p><p>Mr Bennet’s wife, whose first language is not English, couldn’t tell the crew why he needed a rest. She was eventually able to wake her husband up, who explained he had taken medication. However, the cabin crew wanted him to get off the plane.</p><p></p><p>Paramedics were called, removed him from the plane, checked him and said he was medically fit to fly. Bennett also got an email from his doctor saying he was healthy enough to fly. However, they were not allowed back on the flight.</p><p></p><p>The family, who had booked an all-inclusive vacation in Cuba, were told by WestJet they could take the next flight the following week.</p><p></p><p>The Bennets didn’t want to miss a week of the family vacation, so instead of waiting for another WestJet flight, they paid more than $2,000 to buy a plane ticket from another airline. They had to cut their vacation short by two days.</p><p></p><p>The family would like to receive compensation from the airline.</p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>The Bennets</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Mrs Bennet</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Paramedics</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> A flight attendant</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Mr Bennet’s doctor</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The crew on the plane</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The airline</div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-21okt-reading-4",
        "type": "reading-true-or-false",
        "solutions": "[\"C\",\"B\",\"C\",\"B\",\"B\",\"A\",\"A\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about a strange work of land art in Australia and then read the statements following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "MARREE MAN",
        "example": "true",
        "text": "<p>Since a pilot first noticed Marree Man in South Australia in 1998, the mysterious work of land art has attracted international attention. Marree Man is so large it is best viewed from high above. The artwork represents a hunter with what looks like a stick or boomerang in his hand. Its length is 3.5 kilometers (2.2 miles) from top to bottom.</p><p>For many years, Marree Man, named after a nearby town, was a well-known feature in satellite images of the area, but the wind and the rain destroyed many of the lines. By 2013, they were hardly visible in natural-color images.</p><p>In August 2016, local business owners, who were worried about the loss of what had become a tourist attraction, decided to restore the fading lines. They used machines to redraw Marree Man, which took them five days.</p><p>The restoration team thinks the updated work of art will last longer than the original because they designed it to trap water and planted trees along the lines. Over time, they hope plants will turn the lines green.</p><p>Who created the huge work of art, and why, remains unknown, although a cash reward has been announced for information about it. Some people believe that it was probably an artist living in Alice Springs who created Marree Man; others think that maybe the creator was an American.</p>",
        "text2": "<div class='gap-container'><div class='statement'>It was a pilot who discovered the large geoglyph.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The pilot was checking geographical data when he saw the huge image.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Marree Man was discovered in the early 21st century.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The artwork was named Marree Man immediately after its discovery.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The lines of the image had completely disappeared by 2013.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The restoration work lasted more than a week.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The restoration team wants plants to grow along the lines.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The creator of Marree Man has not been named yet.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-21okt-uoe-1",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"F\",\"E\",\"B\",\"K\",\"L\",\"G\",\"A\",\"H\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about how a school in Derbyshire, England, is trying to get parents to talk to their children more.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there are <u>three extra words</u> you do not need.\"]",
        "wordList": "{\"A\":\"DONE\",\"D\":\"EITHER\",\"G\":\"REMIND\",\"K\":\"WHAT\",\"B\":\"EACH\",\"E\":\"LISTEN\",\"H\":\"SHOULDN’T\",\"L\":\"WHEN\",\"F\":\"PLACED\",\"I\":\"THAT\",\"M\":\"WON’T\"}",
        "textTitle": "SMILES VS MOBILES",
        "example": "DOWN",
        "text": "<p>A school has asked parents to put (0) their phones and communicate with their children at the end of the day. The signs (1) at the entrances to Redwood Primary School in Derby advise adults to &quot;greet your child with a smile, not a mobile.&quot; The school said it wanted parents and children to talk and (2) more to each other at home. They have mostly received a positive response from parents.</p><p>Teachers Rachel Kirk and Sarah Chaffe produced signs for (3) of the school's three gates. &quot;(4) we've been trying to do is help parents be more effective (5) they're chatting with their children at home,&quot; said Ms Kirk. &quot;The signs are just to (6) parents how important it is to greet their children and encourage them to get into a conversation about all the fun things they have (7) that day.&quot;</p><p>However, Kerri Hilton, who has two children at the school, said: &quot;Parents (8) be told to pay attention to their children. I always ask my kids about their day at school.&quot;</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21okt-uoe-2",
        "type": "uoe-word-transformation",
        "solutions": "[[\"Welsh\"],[\"recorded\"],[\"European\"],[\"used\"],[\"internationally\"],[\"programmer\",\"programer\"],[\"existing\",\"existent\"],[\"another\"],[\"looking\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about the origins of the @ sign.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "A WELL-KNOWN SIGN",
        "example": "Hungarian",
        "text": "<p>In Dutch the @ sign is called a “monkey tail”, in (0) <b>(Hungary)</b> a “maggot”, in Danish an “elephant’s trunk”, and in (9) <b>(Wales)</b> a “snail”. Appearing everywhere now in emails, the @ sign has history.</p><p></p><p>The first (10) <b>(record)</b> use was in <i>The Mannasses Chronicle</i> in 1345, where an @ sign is the first letter in the word ‘Amen’. By the 16th century, in southern (11) <b>(Europe)</b> documents of trade, the sign represented amphora, a storage jar (12) <b>(use)</b> since Roman times. By the 18th century it was called ‘commercial A’ and meant ‘at the rate of’ (eg.: 10 hats @ 1 shilling = 10 shillings).</p><p></p><p>It didn’t make it onto the earliest typewriters but was included by 1889, when it became a standard character. By 1963 @ was included in the new (13) <b>(international)</b> recognised character set. </p><p></p><p>In 1971 computer (14) <b>(programme)</b> Ray Tomlinson was at work on Arpanet, the prototype of the internet. He added some of his own code to an (15) <b>(exist)</b> programme and sent a message from one computer to (16) <b>(other)</b> – the first email. Ray needed a character to separate the message’s recipient from the computer it would arrive at, and (17) <b>(look)</b> down at his teletype keyboard, he chose the @ symbol and changed the world forever.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21okt-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"which\"],[\"it\"],[\"keep\"],[\"to\"],[\"with\"],[\"called\",\"named\"],[\"next\",\"close\",\"near\"],[\"of\",\"on\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about the history of ice cream.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "ICE-CREAM",
        "example": "when",
        "text": "<p>A kind of ice-cream was invented in China about 200 BC (0) a milk and rice mixture was frozen by packing it into snow. It is believed that Roman emperors sent slaves to mountain tops to bring back fresh snow, (18) was then flavoured and served as an early form of ice-cream.</p><p></p><p>The explorer, Marco Polo &#40;1254-1324&#41;, is believed to have seen ice-cream being made during his trip to China and introduced (19) to Italy. The King of England, Charles I, offered his chef £500 a year to (20) his ice-cream recipe a secret from the rest of England.</p><p></p><p>Ice Cream Sundaes were invented when it became illegal (21) sell ice-cream sodas on a Sunday in the American town of Evanston during the late 19th century. To get around the problem, some ice-cream sellers replaced the soda (22) syrup and called the dessert an &quot;Ice Cream Sunday&quot;. They changed the final &quot;y&quot; for an &quot;e&quot; to avoid upsetting religious leaders.</p><p></p><p>Probably a Syrian man (23) Ernest E Hamwi invented the ice-cream cone in 1904. During the St Louis World's Fair in the United States, his waffle booth stood (24) to an ice-cream seller who ran short (25) dishes. As a favour, Hamwi rolled a waffle to hold his ice-cream and the cone was born.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21maj-reading-1",
        "type": "reading-dialogue",
        "solutions": "[\"H\",\"A\",\"D\",\"F\",\"I\",\"E\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In the following interview about a common illness, the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"What are the signs and symptoms of a cold?\",\"B\":\"What’s the difference between a cold and flu?\",\"D\":\"Can a cold be passed from one person to another?\",\"E\":\"When should I go to the doctor?\",\"F\":\"How long do colds last?\",\"G\":\"Will taking vitamin C help me to prevent colds?\",\"H\":\"What causes colds?\",\"I\":\"What can I do to feel better?\"}",
        "textTitle": "COPING WITH COLDS",
        "example": "What exactly is a cold?",
        "text": "<p>Despite being a minor illness, a cold can make you feel miserable. Here's some information about it.</p>(0)<p>A cold is in fact an infection which can affect the nose, throat, or sinuses.</p>(1)<p>The cold virus. When it gets through the nose and throat, the body answers with an immune system reaction. Dry air, lack of sleep, stress, or not eating properly can increase one’s chances of getting the cold virus.</p>(2)<p>What people first notice is usually a runny nose or sneezing. You also might feel very tired and have a sore throat, cough, headache, temperature, or muscle aches.</p>(3)<p>Well, viruses can stay alive in the air or on surfaces for hours. So, sick people can easily spread the cold to others if they don’t wash their hands after coughing or sneezing.</p>(4)<p>Although some people may be sick for as long as two weeks, most colds clear up within a week.</p>(5)<p>Getting plenty of rest and drinking warm liquids like tea or chicken soup can make you feel less miserable.</p>(6)<p>People who catch colds usually don't need medical attention. But talk to your GP if your symptoms get worse after 3 days instead of getting better.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21maj-reading-2",
        "type": "reading-true-or-false",
        "solutions": "[\"C\",\"B\",\"C\",\"A\",\"A\",\"B\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this article about valuable charity gifts and then read the sentences following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "GOLD COINS FOUND IN A CHARITY KETTLE",
        "example": "true",
        "text": "<p>The Salvation Army regularly uses donation kettles to collect money for charity purposes. Not long ago they found five gold coins in their donation kettle at a food store in Mebane, North Carolina — three South African <i>Krugerrand</i>, one American <i>Riverman</i> and one Canadian <i>Maple Leaf</i>. All came in little plastic packages to keep them safe.</p><p>“We got the <i>Riverman</i> about a week ago, and we got the other four over the last two days,” said the Salvation Army spokesman. The organisation had already received such coins before with the exception of the <i>Riverman</i>.</p><p>All the coins were dropped in the kettle by an anonymous donor.</p><p>The organisation is planning to take the five coins to a shop in High Point to determine their value. “We have a guy that we go to every year. He buys them from us,” the spokesman said. The group will use the money they get for the coins like any other gifts they receive. “I think it’s amazing to get these coins every year because that is a really large donation,” the spokesman said.</p>",
        "text2": "<div class='gap-container'><div class='statement'>The five coins found are all made of gold.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The five coins are all of the same size.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The five coins came within two days.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The five coins were put in the kettle at night.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> It was not the first time someone had given the Salvation Army gold coins.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The organisation doesn’t know who the coins came from.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The Salvation Army is going to give the coins to a museum.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-21maj-reading-3",
        "type": "reading-matching",
        "solutions": "[\"E\",\"G\",\"B\",\"K\",\"H\",\"A\",\"F\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read the following story about a prize-winning house and read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there are <u>two extra half-sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"to choose the winner.\",\"B\":\"to hand in a project and enter the competition.\",\"D\":\"to make a modern building out of an old one.\",\"E\":\"to build a <i>Cubo</i> house.\",\"F\":\"to find a site for building several <i>Cubo</i> houses.\",\"G\":\"to organise the competition.\",\"H\":\"to work out the details of their projects.\",\"I\":\"to live in an old part of the city.\",\"K\":\"to help the participants in the finals.\"}",
        "textTitle": "BAMBOO HOUSE: <i>CUBO</i> WINS TOP PRIZE",
        "example": "to get the award of £50,000.",
        "text": "<p>Earl Forlales, the creator of a house made of bamboo, has won a £50,000 top prize to develop cities for the future. Earl Forlales, 23, a graduate in engineering, was awarded first prize by the Royal Institute of Surveyors for his house, known as <i>Cubo</i>. The Royal Institute decided to give top prize to the house because of its use of low-cost eco-friendly material, and the speed with which it could be constructed. The house could be manufactured in a week, constructed in four hours and costs £60 per square metre.</p><p>The competition was aiming to find practical solutions to housing problems that the world’s cities face. There were more than 1,200 competitors; they were narrowed down to 12 finalists, who were given a mentor from the Royal Institute to help develop their ideas over several months and then finally build their houses.</p><p>The competition head judge said: “There is a need for clean and comfortable places to live for future generations. There were many exciting designs among the projects. However, Earl’s idea stood out for its cheap and simple solution to the world’s growing accommodation problem.”</p><p>The winner, Forlales has already selected a suitable area of land to start building his <i>Cubo</i> houses in Manila, capital of the Philippines, because there are huge pressures on housing in the city. He plans to begin work next year. He said: “<i>Cubo</i> started as an idea while I was spending time at my grandparents’ house – it is great that it will now become a reality.”</p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>A bamboo house project was chosen</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> It would take less than a day</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Housing problems in cities encouraged the Royal Institute</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> More than a thousand people decided</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The Royal Institute mentors were asked</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> It took the 12 competitors months</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The judges considered the cost of the house in order</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> After winning the competition Earl Forlales managed</div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-21maj-reading-4",
        "type": "reading-text",
        "solutions": "[[\"E\",\"K\"],[\"K\"],[\"B\"],[\"L\"],[\"I\"],[\"A\"],[\"H\"],[\"F\"]]",
        "taskTitle": "Task 4",
        "instructions": "[\"In this article about some traditional Christmas cakes called mince pies, some parts of sentences have been left out.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"and missing Phil very much\",\"B\":\"that the pies were possibly hidden under the floorboards\",\"D\":\"to send back a thank-you note\",\"E\":\"and later given to the local museum\",\"F\":\"why sailor Davis never ate his mince pies\",\"G\":\"without a place to find them\",\"H\":\"what his mother was feeling\",\"I\":\"that sailor Davis was attending a radar training school\",\"K\":\"together with a letter\",\"L\":\"to protect what is yours\"}",
        "textTitle": "WORLD WAR 2 MINCE PIES FOUND UNDER HOTEL FLOORBOARDS",
        "example": "which were a wartime gift",
        "text": "<p>The little cakes, (0) from a mother to her sailor son, were discovered at the Loch Hotel in Douglas on the Isle of Man. They were found during the hotel's 1998 renovation (20). The pies are now on display for the first time.</p><p>Probably air-tight conditions under the hotel floor helped conserve the cakes for almost 80 years. They were sent to sailor Phil Davis (21), which was signed &quot;love from mum&quot;.</p><p>Matthew Richardson, the museum’s curator said (22) so the other soldiers couldn’t find them. &quot;If you're in a shared room with five or six other men that you don't know, the only way (23) is to find a place to hide it,&quot; he said.</p><p>The sweets were found when the hotel was developed into apartments. The letter found with the box says (24) on the island. It gives news of happenings at the sailor's home in Birmingham, including details of family and friends enjoying the Christmas holidays together (25). It also reads: &quot;We shall be glad to see you when you get some time off.&quot;</p><p>Mr Richardson said: &quot;This box of mince pies shows that although wars are international events, they have an effect at a very human level. Here was a young man, possibly away from home for the first time in his life, training to go to a war zone. We can only imagine (26) as she posted this box to him.&quot;</p><p>&quot;We can't say for sure (27). Perhaps he was unexpectedly sent to the front and didn't have time to take them.&quot;</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21maj-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"thanks\"],[\"lovers\"],[\"carefully\"],[\"based\"],[\"designer\"],[\"imagine\",\"imagined\"],[\"protected\"],[\"exhibition\",\"exhibit\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about new technology in art.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "RAIN ART",
        "example": "pouring",
        "text": "<p>Most people would laugh if you told them they could go for a nice walk in the (0) <b>(pour)</b> rain — without getting wet. But that idea has become reality, (1) <b>(thank)</b> to an amazing show which allows art (2) <b>(love)</b> to walk in falling water without getting soaked to the skin.</p><p></p><p>The art installation, titled the Rain Room, uses a 3D camera system that creates a (3) <b>(careful)</b> designed path through the heavy rain, (4) <b>(base)</b> on the movements of visitors.</p><p></p><p>Hannes Koch, the (5) <b>(design)</b> of the Rain Room told CCTV News: “I think the initial idea didn’t have much to do with rain; it had to do with how visitors (6) <b>(image)</b> it would feel to be inside rain but to be (7) <b>(protect)</b> from it.”</p><p></p><p>The Rain Room (8) <b>(exhibit)</b> has attracted thousands of visitors to the Barbican Centre in London. A permanent version of the Rain Room has opened at the Yuz Museum in Shanghai.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21maj-uoe-2",
        "type": "uoe-multiple-choice",
        "solutions": "[\"D\",\"B\",\"A\",\"C\",\"D\",\"B\",\"C\",\"D\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about a new kind of family therapy.\",\"Some words are missing from the text.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\"]",
        "wordList": "{\"0\":{\"While\":\"A\",\"under\":\"B\",\"during\":\"C\",\"through\":\"D\"},\"1\":{\"are like\":\"A\",\"have liked\":\"B\",\"used to like\":\"C\",\"would like\":\"D\"},\"2\":{\"Make\":\"A\",\"could\":\"B\",\"try\":\"C\",\"needed\":\"D\"},\"3\":{\"we’ve found\":\"A\",\"we’d find\":\"B\",\"we’ve founded\":\"C\",\"we might find\":\"D\"},\"4\":{\"lots\":\"A\",\"several\":\"B\",\"couple\":\"C\",\"few\":\"D\"},\"5\":{\"would get\":\"A\",\"had left\":\"B\",\"have saved\":\"C\",\"are sending\":\"D\"},\"6\":{\"and\":\"A\",\"without\":\"B\",\"while\":\"C\",\"instead\":\"D\"},\"7\":{\"need\":\"A\",\"had to\":\"B\",\"must\":\"C\",\"may\":\"D\"},\"8\":{\"sent back\":\"A\",\"hand\":\"B\",\"be given up\":\"C\",\"be returned\":\"D\"}}",
        "textTitle": "YOUR KIDS CAN EAT FREE IF …",
        "example": "during",
        "text": "<p>Parents who give up their phones (0) dinner will be rewarded with free meals for their kids at a British restaurant chain. In December, Frankie & Benny’s is running its “no-phone” campaign as they (9) to see more families who pay attention to each other at the dinner table.</p><p></p><p>“We looked at various ways we (10) encourage people to communicate with each other at the dinner table, and (11) that giving families the chance to put down their phones for a (12) of hours is a great opportunity to bring them closer to each other,” a Frankie and Benny’s spokesperson explained.</p><p></p><p>Psychologist Susan Atkins agrees, saying: “By putting away screens parents (13) the message that their children are important to them … Parents are role models in everything that they do, so by talking to their kids (14) reading and typing messages they are teaching their kids when and where technology use is appropriate.”</p><p></p><p>If parents want to use the promotion, they (15) put their phones in a special box before the meal begins. After dinner, the phones will (16) to them, and their children’s meals will be free of charge.</p>",
        "text2": ""
    },
    {
        "taskId": "standard-21maj-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"was\"],[\"it\"],[\"at\"],[\"that\",\"which\"],[\"best\"],[\"what\",\"everything\",\"anything\"],[\"of\",\"showing\"],[\"for\"],[\"never\",\"hadn’t\",\"hardly\",\"scarcely\",\"barely\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about a lost wallet.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "LOST WALLET RETURNED",
        "example": "his",
        "text": "<p>Hunter Shamatt had just arrived in Las Vegas when he realized he had lost (0) wallet. It contained $60, a $400 paycheck, his bank card and his identification card. He was very upset, but he didn’t want to make a big deal of it because it (17) his sister’s wedding weekend. He thought he might have lost it on his Frontier flight from Omaha to Vegas, so he</p><p>called the airline and reported (18) missing. No luck.</p><p></p><p>After the wedding, a package arrived (19) his home. It contained his wallet — completely intact — with a note (20) said: “Hunter, I found this on a Frontier flight from Omaha to Vegas – row 12, under seat F. Thought you might want it back. All the (21), Todd.”</p><p></p><p>And below that: “P.S. I rounded your cash up to an even $100 so you could celebrate getting your wallet back. Have Fun!!!”</p><p></p><p>It took Hunter Shamatt a few minutes to believe (22) the note said. He wanted to thank the kind stranger, so he posted a picture (23) the note on Facebook with a message asking (24) help to find Todd. Within days, he was in contact with the man, identified in local media reports as Todd Brown of Omaha.</p><p></p><p>Shamatt wrote Brown a heartfelt thank-you:</p><p></p><p>“Sir, what you’ve done for me is unheard of. I (25) expected to see my wallet again, let alone with $40 more. Thank you so much, I’ve got student loans and it makes all the difference.”</p>",
        "text2": ""
    },
    {
        "taskId": "standard-20okt-reading-1",
        "type": "reading-headings",
        "solutions": "[\"D\",\"G\",\"E\",\"I\",\"B\",\"F\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In the following text about how to use smartphones really smartly, the headings have been removed.\",\"Your task is to match the headings to the paragraphs.\",\"Place the headings into the appropriate box.\",\"Place the headings in the gaps as in the example.\",\"Remember that there are <u>two extra headings</u> you do not need.\"]",
        "wordList": "{\"A\":\"Set yourself a daily screen time limit.\",\"B\":\"Remove social media from your phone.\",\"D\":\"Make your screen monochrome.\",\"E\":\"Study with your phone out of sight.\",\"F\":\"Download apps that help you get back to real life.\",\"G\":\"Get a real alarm clock.\",\"H\":\"Make your meals device-free.\",\"I\":\"Send audio notes instead of text messaging.\"}",
        "textTitle": "TAKE CONTROL OF YOUR PHONE",
        "example": "Turn off all notifications except from people.",
        "text": "<p>Here is a list of simple changes that can help you become a mindful user of your device.</p><p></p>(0)<p>Get rid of unnecessary banners, red dots and vibrations that take you back into apps you don’t need to be in. Allow only messaging apps to send you notifications, when real people want your attention.</p>(1)<p>Colourful icons give our brains shiny rewards every time we unlock. Keep colours for when you really need them.</p>(2)<p>Leave your phone in another room for the night. This way, you can wake up without finding yourself checking your phone before you even get out of bed.</p>(3)<p>Placing your phone in a drawer or a place where you can’t see it can help reduce the anxiety of wanting to check it. Ideal solution for homework time.</p>(4)<p>It's easy to misinterpret written messages. Recording a quick voice message instead is safer – and faster – than typing out each letter.</p>(5)<p>These apps tend to use up most of our time. Train yourself to use them from your computer only. Or even better: make efforts to interact with people in person.</p>(6)<p>Meditation and monitoring apps will give you back the time that other apps have stolen. Through short, daily exercise, they help you use your phone in a healthy way.</p><p><i style='font-size:small'>(www.humanetech.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20okt-reading-2",
        "type": "reading-text",
        "solutions": "[\"E\",\"I\",\"B\",\"H\",\"F\",\"K\",\"A\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this article about an interesting find.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"which she believes is a ‘once in a lifetime find’\",\"B\":\"where he wrote his play ‘As You Like It’\",\"D\":\"which was the only ring he liked\",\"E\":\"who spends her spare time looking for hidden treasure\",\"F\":\"who said it was probably a ‘posy ring’\",\"G\":\"who lived in the 17th century\",\"H\":\"when I took a closer look\",\"I\":\"when she got a strong signal at the bottom of the grounds\",\"K\":\"where it is going to be examined\"}",
        "textTitle": "LADY WITH METAL DETECTOR DISCOVERS ‘GOLD RING’ IN FIELD",
        "example": "which was owned by William Shakespeare’s family in Tudor times",
        "text": "<p>An antique ring was discovered near the hall (0).</p><p>Sue Kilvert, 66, a retired postlady, (7), found a ring that may have belonged to William Shakespeare.</p><p>Ms Kilvert was searching the fields next to Shakespeare Hall in Warwick with her metal detector (8) and discovered a small ring with the words on the inside of the band ‘Truth Betrayes Not’. Shakespeare Hall was owned by the famous playwright’s family and it is probably the place (9) in 1595.</p><p>Ms Kilvert said: ‘It was tiny so I thought it might be a modern child’s ring but (10) I could see the words and realised it could be something very valuable.’ Ms Kilvert showed her find to a group of fellow metal detectorists, (11). Such gold rings were popular between the 15th and 17th centuries as gifts for lovers.</p><p>The ring has been sent to a museum in Birmingham (12) to see if it has a deeper connection with Shakespeare.</p><p>The 66-year-old lady hopes to keep the ring, (13), but she will have to give it up if it is declared as a ‘treasure’ under the Treasures Act. In that case, she will have to offer it for sale to a museum at a price set by the Treasure Valuation Committee.</p><p><i style='font-size:small'>(metro.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20okt-reading-3",
        "type": "reading-true-or-false",
        "solutions": "[\"C\",\"C\",\"B\",\"A\",\"C\",\"B\",\"A\",\"B\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this article about some scientific research and then read the statements following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "RESEARCHERS PAY PEOPLE TO STAY IN BED",
        "example": "false",
        "text": "<p>Getting paid $23,000 to stay in bed for two months sounds pretty good. That’s what a medical research team is offering to 24 volunteers.</p><p>Researchers are looking for volunteers to help them study the effects of weightlessness on the human body by spending 60 days lying down. Lying in bed isn’t exactly the same as being weightless, but it affects the body in a similar way.</p><p>When astronauts spend a long time in an environment with no gravity, their bodies are affected in many ways; for example, their hearts don’t pump as hard, their muscles become weaker because they no longer have to work against gravity, and their bones may break more easily. There may also be changes in their immune systems and sleep habits.</p><p>The goal of the present study, which will take 88 days altogether, is to measure the effects of weightlessness, and also to find ways to prevent problems. During the first two weeks, the volunteers’ levels of health and fitness will be measured. Then, they will spend 60 days lying in bed with their heads slightly lower than their bodies. They will have to do everything while lying down, including eating, brushing their teeth, and going to the bathroom. The rule is that they must have at least one shoulder touching the bed at all times. Half of the volunteers in the study will be taking special food supplements to see if they help reduce the health problems caused by weightlessness. The last two weeks of the study will be spent taking more measurements and trying to build up their strength again.</p><p>Volunteers must be men between the ages of 20 and 45 who are in perfect health and physically active. They must be non-smokers and have no allergies.</p><p><i style='font-size:small'>(https://teachingkidsnews.com)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'>A total of $23,000 will be spent on the medical research project.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Companies are welcome to sponsor the research.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Volunteers will be paid the money when the research is finished.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The aim of the research is to study how weightlessness affects astronauts while they sleep.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Lying in bed has a similar effect on the body to weightlessness.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Astronauts have reported difficulty falling asleep after spending months in space.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> People who take part in the test can sit up only during their meals.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Volunteers’ health and fitness will be checked during the research.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Anyone who does not smoke and is physically fit may take part in the research.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-20okt-reading-4",
        "type": "reading-free-gap-filling",
        "solutions": "[[\"swimming\",\"snorkelling\",\"snorkeling\",\"diving\"],[\"blog\",\"diary\"],[\"6\",\"six\"],[\"English\",\"communication\"],[\"week\"],[\"free\",\"nothing\"]]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about a dream job in Australia.\",\"In the sentences that follow the text, there are some gaps.\",\"Your task is to fill each gap with one word so that the sentences correspond to what the text says.\",\"An example has been given for you.\"]",
        "wordList": "{}",
        "textTitle": "DREAM JOB ON THE BEACH",
        "example": "island",
        "text": "<p>Queensland’s latest tourism campaign is offering job seekers a fantastic opportunity on the Great Barrier Reef in Queensland, Australia.</p><p><i>Tourism Queensland</i> is looking for applicants willing to walk white sandy beaches, sit under palm trees and swim with turtles as they soak up the sun. The successful candidate will be asked to keep a blog and photo diary in exchange for living on Hamilton Island, and a $150,000 monthly paycheck for half a year. According to the job advertisement, applicants must be willing to “swim, snorkel, make friends with locals and generally enjoy the tropical Queensland climate and lifestyle.”</p><p></p><p>The “island caretaker” position was created as part of a $1.7 million marketing strategy by <i>Tourism Queensland</i> to boost tourism on the island. Australian Marketing Institute president Roger James said the campaign was an interesting idea. “The goal is to find someone who is able to write interesting blog entries, post inspiring videos weekly, and show their followers that Queensland is worth visiting.”</p><p>The winning candidate must be a good swimmer, excellent communicator, be able to speak and write English, have an adventurous attitude, enjoy snorkelling and/or diving and be willing to try new things. The job includes free accommodation in a three-bedroom home on Hamilton Island with an amazing view of the sea.</p><p></p><p></p><p><i style='font-size:small'>(https://www.traveller.com.au)</i></p>",
        "text2": "<ol start='0'><li><i>Tourism Queensland</i> is looking for a(n) (0) caretaker on the Great Barrier Reef in Australia.</li><li>The job involves sunbathing and (22) in the sea.</li><li>The person who gets the job will have to write a(n) (23) about their adventures in Queensland.</li><li>The duration of the job is (24) months.</li><li>The island caretaker has to have a level of (25) good enough to communicate with locals.</li><li>The caretaker will have to share videos once a (26).</li><li>The person who gets the job will stay in a house for (27).</li></ol>"
    },
    {
        "taskId": "standard-20okt-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[\"exhausted\",\"difference\",\"first\",\"unfriendly\",\"annoying\",\"reply\",\"hard\",\"calmly\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read a joke about a father explaining words to his daughter.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "ANGRY OR FURIOUS?",
        "example": "final",
        "text": "<p>A young girl was preparing for her (0) <b>(finish)</b> exam. One day she came home (1) <b>(exhaust)</b> and asked her father, “Dad, what is the (2) <b>(differ)</b> between anger and fury?&quot; </p><p>The father replied, “The second is much stronger than the (3) <b>(one)</b>. Let me show you …”</p><p>The father went to the telephone and dialled a number at random. To the man who answered the phone, he said, “Hello, is Melvin there?”</p><p>A rather (4) <b>(friendly)</b> male voice answered, “There is no Melvin here. Check that number again!”</p><p>“See,” said the father to his daughter. “That man was not really happy with our call. He was probably busy, and found our call a bit (5) <b>(annoy)</b>. Now watch ...”</p><p>The father dialled the same number again. “Hello, is Melvin there?” asked the father. “Now look here!” came the heated (6) <b>(reply)</b>. “I’ve just told you that there is no Melvin here! Leave me alone!” The receiver was slammed down (7) <b>(hard)</b>.</p><p>The father turned to his daughter and said, “You see, that was anger. Now I’ll show you what fury means.”</p><p>He dialled the same number, and a violent voice shouted, “HELLO!”</p><p>The father (8) <b>(calm)</b> said, “Hello, this is Melvin. Have there been any calls for me?”</p><p><i style='font-size:small'>(http://jokestop.net)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20okt-uoe-2",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"D\",\"K\",\"B\",\"G\",\"H\",\"M\",\"F\",\"L\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about a young boy who is planning his first business.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there are <u>three extra words</u> you do not need.\"]",
        "wordList": "{\"A\":\"AS\",\"E\":\"HOW\",\" I\":\"LOCK\",\"B\":\"DECISIONS\",\"F\":\"KEY\",\"K\":\"NUMBERS\",\"G\":\"LACK\",\"L\":\"SLEEP\",\"D\":\"DOUBT\",\"H\":\"LIKE\",\"M\":\"WHAT\"}",
        "textTitle": "BOY’S LETTER TO QANTAS BOSS",
        "example": "ALREADY",
        "text": "<p>Alex Jacquot may be only 10, but he has (0) learned one important lesson in business: when you are in (9), ask for advice. The Sydney schoolboy has big plans for his future airline “Oceania</p><p>Express”. He’s creating flight (10) and making important (11) about staff. He has already appointed his classmate Wolf his “vice-president”. Jacquot did not let his (12) of experience slow him down; he wrote a letter to Alan Joyce, chief executive of Qantas, the oldest airline in Australia, asking for advice on how to build his company further. (13) any smart businessman, Jacquot kept it short and sweet. “Please take me seriously,” he wrote. “I like working on my airline. Now, in the school holidays, I have more time to work. But I cannot think of anything else to do. Do you have any ideas of (14) I could do?” The boy is planning a nonstop flight from Sydney to London, and he knows that passenger comfort will be the (15) to Oceania Express’s success. “As it is a 25-hour flight, we are having a lot of trouble thinking about how passengers will (16),” Jacquot wrote. “Do you have any advice?”</p><p><i style='font-size:small'>(https://www.washingtonpost.com/)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20okt-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"has\"],[\"than\"],[\"on\",\"around\"],[\"never\",\"not\",\"hardly\"],[\"spend\",\"expend\"],[\"to\"],[\"as\",\"being\"],[\"because\"],[\"look\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read about a street musician and his cat Bob.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "HOMELESS MAN AND CAT WHO SAVED HIM",
        "example": "from",
        "text": "<p>James Bowen and his cat Bob became world famous after James wrote a story about how the animal rescued him (0) a life of homelessness and drug addiction.</p><p></p><p>Since then James Bowen (17) become a successful writer. His eight books, including the first, A Street Cat Named Bob, have sold nine million copies in more (18) 40 languages. The film adaptation won Best British Film in 2017 and is based (19) James and Bob’s relationship.</p><p>James will (20) forget the day when the injured stray cat turned up in the hallway outside his room in Tottenham, in spring 2007. James decided to (21) his last £30 on a visit to the vet to treat the cat’s injured leg. In that period, James Bowen’s world was a mess. His only aim in life was (22) survive – and keep off drugs. He earned some money</p><p>(23) a street musician. While he was playing, Bob was sitting in the guitar case.</p><p></p><p>‘It was only (24) of Bob that I changed my life,’ he says. ‘I had to be responsible as he needed me to (25) after him. Everything positive in my life started with him.’</p><p><i style='font-size:small'>(https://metro.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20maj-reading-1",
        "type": "reading-dialogue",
        "solutions": "[\"F\",\"D\",\"G\",\"L\",\"I\",\"A\",\"H\",\"B\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In the following interview with an electrician, the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"What do you dislike about your job?\",\"B\":\"What do you do in your free time?\",\"D\":\"What kind of education and training did you have?\",\"E\":\"What kind of people do you find it difficult to work with?\",\"F\":\"What made you want to become an electrician?\",\"G\":\"How did you get your present job?\",\"H\":\"What qualities or skills are important for an electrician?\",\"I\":\"What do you enjoy about your job?\",\"K\":\"How do you feel about working long hours?\",\"L\":\"Could you describe a typical working day?\"}",
        "textTitle": "",
        "example": "What is your present job?",
        "text": "(0)<p>I’m an electrician.</p><p></p>(1)<p>My dad worked with electricity and he taught me some basics. It was exciting. From my childhood I knew I wanted to be an electrician.</p><p></p>(2)<p>I went to a vocational school, then I took a 4-year course with on-the-job experience.</p><p></p>(3)<p>I searched job websites and sent letters of application. Then I did some interviews and I was offered this position by the company.</p><p></p>(4)<p>First, I collect the materials I need. Then I go and do the job. At the end of the day we usually have a quick meeting.</p><p></p>(5)<p>I like the opportunities that come with the job. Last year I got to travel to Africa with my company.</p><p></p>(6)<p>Sometimes travelling long distances and cold weather can be difficult.</p><p></p>(7)<p>You’ve got to have a logical, open mind. You also have to be able to solve problems quickly.</p><p></p>(8)<p>I meet my friends at the weekends and we often play football.</p><p><i style='font-size:small'>(www.careersportal.ie)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20maj-reading-2",
        "type": "reading-paragraphs",
        "solutions": "[\"F\",\"H\",\"A\",\"D\",\"B\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this story about an archaeological discovery.\",\"Some paragraphs are missing.\",\"Your task is to put the jumbled paragraphs back in order.\",\"Place the paragraphs in the boxes as in the example.\"]",
        "wordList": "{\"A\":\"The next day dad showed the sword to an archaeologist. She called it “sensational”. She asked us to keep it a secret.\",\"B\":\"People are saying I am the queen of Sweden, because in the legend of King Arthur, he was given a sword by a lady in a lake, and he became king.\",\"D\":\"The archaeologist went to the beach too, and she also found a small medal. Then she announced the news, so it wasn’t secret any more.\",\"E\":\"The waves were so big because of the storm that I had to be very careful.\",\"F\":\"I went into the water with the buoy. Daddy asked me to hurry so he could watch the World Cup final, but I didn’t rush.\",\"G\":\"The fishermen on the boat asked if they could stay in the cabin until the water level was high again.\",\"H\":\"I was in the water, when I felt something long and hard in the sand. I pulled it out and shouted, “Look what I’ve found! I think it’s a sword!”\"}",
        "textTitle": "GIRL DISCOVERS VIKING SWORD",
        "example": "One sunny day last summer, Daddy told me to get a buoy from the cabin to warn any boats because the water level was dangerously low.",
        "text": "<p>Every summer, we go to stay in a cabin by lake Vidöstern in southern Sweden. I like to play on the beach.</p><p></p>(0)<p></p>(9)<p></p>(10)<p></p><p>I ran to my mum shouting, “I found a sword!” She said it looked like a Viking sword. Daddy got so excited that he didn’t even watch the football match.</p><p></p>(11)<p></p>(12)<p></p><p>Unfortunately, I had to give the sword to the local museum – Daddy explained it’s part of history.</p><p></p>(13)<p></p><p>I am not a lady, but it’s true I found a sword in the lake. I wouldn’t mind being queen for a day, but when I grow up, I want to be a vet.</p><p></p><p><i style='font-size:small'>(www.theguardian.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20maj-reading-3",
        "type": "reading-true-or-false",
        "solutions": "[\"B\",\"C\",\"C\",\"C\",\"A\",\"C\",\"B\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this article about a language which is really two languages, and then read the sentences following it\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "UBANG: THE NIGERIAN VILLAGE WHERE MEN AND WOMEN SPEAK DIFFERENT LANGUAGES",
        "example": "true",
        "text": "<p>In Ubang, a farming community in southern Nigeria, men and women say they speak different languages. Wishing to demonstrate the two different languages, village chief Oliver Ibang calls over his two young children.</p><p>He holds up a cup and asks his daughter what it is called. &quot;It's <i>ogbala</i>,&quot; she says, without thinking for a moment. But in Ubang's &quot;male language&quot; the word for cup is <i>nko</i>. There are some other examples, such as the word for clothing, which is <i>nki</i> for men and <i>ariga</i> for women.</p><p>It is not clear exactly how many words are different in the two languages. Also, there is no pattern, such as whether the words are commonly used or linked to traditional roles for men or women. There are a lot of words that men and women have in common, then there are others which are totally different depending on your sex. They don't sound alike, they don't have the same letters, they are completely different words. However, both men and women are able to understand each other as well as anywhere else in the world. This might be partly because boys grow up speaking the female language, as they spend most of their childhoods with their mothers and other women. However, by the age of 10, boys are expected to speak the &quot;male language&quot;.</p><p>Ubang people are extremely proud of their language difference but there are different theories about how it happened. &quot;God created Adam and Eve and they were Ubang people,&quot; says the chief. &quot;God's plan was to give each ethnic group two languages, but after creating the two languages for the Ubang, he realised that he simply didn’t have enough languages to hand out. So he stopped,&quot; he explains.</p><p>&quot;That's why Ubang has the benefit of two languages – we are different from other people in the world.&quot;</p><p><i style='font-size:small'>(bbc.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'>There is a village where the language people speak depends on their sex.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The chief's daughter cannot immediately give the word for cup.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Most of the words are the same in the male and the female language.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> There are more male than female words in Ubang.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The male words are more difficult to pronounce than the female words.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> In Ubang, a man and a woman have no more problems understanding each other than, for example, a man and a woman in the UK.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Boys learn the male language from their fathers.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> According to the chief, God gave two languages to every ethnic group in the world.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-20maj-reading-4",
        "type": "reading-text",
        "solutions": "[\"I\",\"D\",\"A\",\"G\",\"B\",\"K\",\"F\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"In this article about flight incidents, some parts of sentences have been left out.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"and rising incomes in India\",\"B\":\"after a woman used her sleeping husband’s thumb\",\"D\":\"but released him soon after\",\"E\":\"informing them about the dangers of flying\",\"F\":\"and the male pilot eventually left to find her\",\"G\":\"explaining important aspects of air travel\",\"H\":\"and the plane was flown to the nearest airport\",\"I\":\"while the plane prepared to take off\",\"K\":\"and as cabin crew were unable to handle the situation\"}",
        "textTitle": "IN-FLIGHT INCIDENTS IN INDIA – MORE SERIOUS THAN FUNNY",
        "example": "after trying to enter the cockpit",
        "text": "<p>A passenger has recently been taken off a domestic flight in India (0) to charge his phone. The man, who was drunk, tried to enter the cockpit (21) for Kolkata from the western city of Mumbai. He was eventually removed from the aircraft and handed over to police because of a security violation. Police later questioned the man (22).</p><p>The falling price of air tickets (23) have led to a boom in domestic flights. Carriers say that there are a lot of first-time flyers, which also presents new challenges. One airline, Air Asia India, said it was producing a how-to video for new customers</p><p>(24), from the need to show up on time to instructions on how to use an onboard toilet.</p><p>In another incident earlier this year, a Qatar Airways flight made an emergency landing in the southern city of Chennai, (25) to unlock his phone, where she discovered evidence he was cheating on her. She reportedly began attacking her husband</p><p>(26), the flight was forced to make an emergency stop.</p><p>The behaviour of the crew is not always perfect either. Jet Airways has suspended two pilots for five years after a male pilot slapped his female co-pilot during a flight to Mumbai. She reportedly stormed out of the cockpit (27), leaving the plane on auto-pilot.</p><p><i style='font-size:small'>(guardian.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20maj-uoe-1",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"kind\",\"kinds\",\"sort\",\"sorts\",\"type\",\"types\",\"form\",\"forms\"],[\"how\"],[\"not\",\"never\"],[\"anything\",\"much\",\"lots\",\"money\",\"loads\"],[\"a\"],[\"off\",\"out\"],[\"drive\",\"can\"],[\"taking\",\"using\",\"choosing\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about some easy ways to exercise more without extra time.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "DON’T OVERTHINK YOUR EXERCISE",
        "example": "be",
        "text": "<p>With the explosion of boutique gyms, spin classes and ultramarathons, we may believe that exercise should (0) both expensive and extreme. But researchers are finding that it really doesn’t seem to matter what (1) of physical activity you do to receive great health rewards.</p><p></p><p>Americans often complain that they don’t have enough time to work out. A recent survey asked a group of them (2) they would spend an extra four hours each week if they suddenly had the time. The number one answer? Exercise. But we often overthink exercise — and we may (3) actually need to set aside extra time to work out. Exercise doesn't require a gym membership. Exercise is something you can do throughout the day, every day. It also doesn’t need to be exhausting or to cost (4) to see health benefits. Simply walking more counts (5) lot.</p><p></p><p>Here are some tips how you can fill your day with more activity:</p><p><ul><li>if you use public transport, get (6) a stop early on your way to work;</li></p><p><li>if you (7), park far away from your destination;</li></p><p><li>climb the stairs to your office or flat instead of (8) the elevator;</li></p><p><li>walk to the grocery store instead of driving.</li></ul> </p><p><i style='font-size:small'>(www.vox.com/science-and-health)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20maj-uoe-2",
        "type": "uoe-word-transformation",
        "solutions": "[[\"hit\"],[\"reports\"],[\"confused\"],[\"earlier\"],[\"trying\"],[\"typically\"],[\"careless\",\"uncareful\"],[\"behaviour\",\"behavior\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about some problems in a town in Minnesota.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "CHAOS IN MINNESOTA",
        "example": "unable",
        "text": "<p>A group of young residents in Gilbert, Minnesota, who are (0) <b>(able)</b> to handle their alcohol have been drifting around the town, looking disoriented and narrowly avoiding getting</p><p>(9) <b>(hit)</b> by cars. However, these aren't drunk teenagers. Instead, it's the local bird population.</p><p></p><p>&quot;The Police Department has received several (10) <b>(report)</b> of birds that seem to be 'under the influence of alcohol' flying into windows and cars and looking</p><p>(11) <b>(confuse)</b>,&quot; said Police Chief Ty Techar. &quot;An early frost meant that berries had fermented (12) <b>(early)</b> than usual, and birds were eating them and getting drunk.&quot;</p><p></p><p>Such incidents around town are more common than in past years, because many birds have not yet migrated south. As they prepare to fly south for winter, they may eat too many berries to store up fat for the journey. They go from bush to bush (13) <b>(try)</b> to find more berries, and their balance is gradually getting worse. They are (14) <b>(typical)</b> seen flying lower than usual through traffic. They're just (15) <b>(care)</b> and they're not watching out for cars and other objects around them. Their silly (16) <b>(behave)</b> is a sign that they're drunk. Usually they just need a bit of time to recover. </p><p></p><p><i style='font-size:small'>(www.independent.co.uk/news)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-20maj-uoe-3",
        "type": "uoe-multiple-choice",
        "solutions": "[\"C\",\"B\",\"B\",\"D\",\"A\",\"C\",\"D\",\"D\",\"B\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about whether men or women are better at multitasking.\",\"Some words are missing from the text.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\"]",
        "wordList": "{\"0\":{\"the less\":\"A\",\"the least\":\"B\",\"less\":\"C\",\"least\":\"D\"},\"1\":{\"taken away\":\"A\",\"given up\":\"B\",\"carried out\":\"C\",\"put down\":\"D\"},\"2\":{\"which was\":\"A\",\"which\":\"B\",\"what\":\"C\",\"what was\":\"D\"},\"3\":{\"in\":\"A\",\"at a\":\"B\",\"on\":\"C\",\"by the\":\"D\"},\"4\":{\"each\":\"A\",\"all of\":\"B\",\"every\":\"C\",\"both\":\"D\"},\"5\":{\"tried\":\"A\",\"could try\":\"B\",\"will try\":\"C\",\"were trying\":\"D\"},\"6\":{\"have they\":\"A\",\"would they\":\"B\",\"they would\":\"C\",\"they have\":\"D\"},\"7\":{\"if\":\"A\",\"although\":\"B\",\"when\":\"C\",\"so\":\"D\"},\"8\":{\"for\":\"A\",\"by\":\"B\",\"with\":\"C\",\"–\":\"D\"},\"9\":{\"quick\":\"A\",\"able\":\"B\",\"suitable\":\"C\",\"often\":\"D\"}}",
        "textTitle": "WHO IS BETTER AT MULTITASKING?",
        "example": "less",
        "text": "<p>Men were slower and (0) organised than women when switching quickly between tasks in tests (17) by UK psychologists.</p><p></p><p>First, they compared 120 women and 120 men in a computer test (18) involved</p><p>switching between tasks like counting and recognising shapes. Men and women were equal when they did one task (19) time. But when the tasks were mixed up and the switching became faster, (20) women and men slowed down and made more mistakes. However, men were significantly slower.</p><p></p><p>To make the experiment more relevant to everyday life, the researchers (21) a second test. The participants were given eight minutes to complete a series of tasks – locating restaurants on a map, answering a phone call, and deciding how (22) search for a lost key in a field.</p><p></p><p>Completing all these tasks in eight minutes was impossible, (23) men and women had to prioritise, organise their time, and keep calm. Women spent more time (24) thinking at the beginning, whereas men jumped in too quickly. It suggests that – in a stressful and complex situation – women are more (25) to stop and think about what's going on in front of them.</p><p><i style='font-size:small'>(www.bbc.com/news)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19okt-reading-1",
        "type": "reading-text",
        "solutions": "[\"B\",\"G\",\"D\",\"H\",\"A\",\"I\",\"F\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In this article about parents going to school some parts of sentences have been left out.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"so we have to go very slowly\",\"B\":\"in order to understand\",\"D\":\"to spend eight hours\",\"E\":\"just in time to take the exam\",\"F\":\"who attended a class with his wife\",\"G\":\"so that they can be helpful\",\"H\":\"who decide to take part in the course\",\"I\":\"who left the subject behind\",\"K\":\"why they are challenged\"}",
        "textTitle": "SINGAPORE: PARENTS TAKE PRIMARY SCHOOL MATHS CLASSES",
        "example": "so they can understand",
        "text": "<p>Parents in Singapore dust off their calculators: they are going back to school (0) </p><p>their children's homework.</p><p></p><p>They are taking primary school maths classes (1) what their children go through. Adults are signing up for courses (2) when their children have questions, the My Paper website reports. Parents at a &quot;mastery workshop&quot; pay $700 (£(463) (3) learning how to solve maths problems, the website says. It's part of a growing trend in Singapore.</p><p>Parents (4) are divided into groups depending on their existing knowledge and ability. &quot;Some parents come to the workshop with zero maths knowledge,</p><p>(5),&quot; says Nur Hidayah Ismail, the principal of the Genius Young Minds centre. Some parents say it has helped them to understand their children's struggles. But for others (6) many years ago, things are more tricky. Mohd Yusof Maruwi, (7), found most of the questions surprisingly difficult. &quot;Luckily, she could understand what was going on,&quot; he says.</p><p></p><p></p><p>(bbc.com)</p>",
        "text2": ""
    },
    {
        "taskId": "standard-19okt-reading-2",
        "type": "reading-matching",
        "solutions": "[\"E\",\"G\",\"H\",\"F\",\"D\",\"A\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this article about a young man and his girlfriend and then read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there is <u>one extra half-sentence</u> you do not need.\"]",
        "wordList": "{\"A\":\"had carefully planned the event.\",\"B\":\"was given to her friends.\",\"D\":\"have been informed about the event.\",\"E\":\"had already been used by the young man.\",\"F\":\"might make the whole thing much longer.\",\"G\":\"was posted on a community website.\",\"H\":\"were written on a map.\"}",
        "textTitle": "MARRIAGE PROPOSAL MAPPED OUT BY PORTSMOUTH JOGGER'S APP",
        "example": "was used to create a message.",
        "text": "<p>A Portsmouth runner has proposed to his girlfriend by spelling out &quot;Will You Marry Me&quot; using a GPS tracking application. The couple met through a mutual friend on Facebook when they commented on a post and then started chatting.</p><p>Ben Chudley, 28, used a running app to track his progress around the city's streets before posting the route on Facebook. When he posted it on Tuesday evening, his girlfriend Olivia Abdul saw it and accepted his proposal. Mr Chudley, who had also drawn dinosaurs and cartoon characters in the same way, said the idea was &quot;very me&quot;.</p><p>He explained he had carefully designed his route using online mapping and had run the 5.71mile (9km) route. Mr Chudley told his girlfriend he was going out for a run before posting the map on Facebook and returning, with flowers and a ring, to hear her response. He admitted that posting it publicly &quot;could have been very embarrassing if she had said no.&quot;</p><p>Mr Chudley had started a Facebook group of similar 'drawings'. In the past he had attempted a seahorse and a dinosaur but said Portsmouth's regular street layout made it easier to form letters. He added that making a wrong turn half way through a run can be &quot;heart breaking&quot; as it means having to start the tracking again.</p><p>Surprised Olivia, who was given a gold and diamond engagement ring, said: &quot;I was so happy.”</p><p>The bride-to-be said the couple had been flooded with well-wishes from friends and family.</p><p>(bbc.com)</p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>Modern technology </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The app </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The proposal </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The letters </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> A mistake </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Friends </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Mr Chudley</div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-19okt-reading-3",
        "type": "reading-dialogue",
        "solutions": "[\"E\",\"A\",\"H\",\"F\",\"B\",\"G\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"In the following interview with Chris Guillebeau, the person who has travelled most widely in the world, the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there is <u>one extra question</u> you do not need.\"]",
        "wordList": "{\"A\":\"Why is travel important? How has it changed you?\",\"B\":\"What’s the best travel advice you can share with us?\",\"D\":\"Have you ever left your passport at home?\",\"E\":\"Is there a place that draws you back again and again? Why?\",\"F\":\"What do you never leave at home?\",\"G\":\"What are you working on right now?\",\"H\":\"What’s the strangest thing you’ve seen in your travels?\"}",
        "textTitle": "",
        "example": "Where do you call home?",
        "text": "<p>Chris Guillebeau achieved something most people only dream of: visiting every country in the world. Impressive? Here is an interview:</p><p></p>(0)<p>CG: I travel at least 100 days a year, but when I’m not on the road I live in Portland, Oregon.</p><p></p>(14)<p>CG: There are many, but for me I think the act of travel itself has a thrilling effect. I just love being on the road.</p><p></p>(15)<p>CG: Travel forces you to think differently. I live a fairly routine life, and I like the element of adventure that travel brings. When I’m on the road I feel like a different person.</p><p></p>(16)<p>CG: A dead cow in the back of a taxi in Sierra Leone would probably be high on the list.</p><p></p>(17)<p>CG: I’m pretty basic. Everything goes in my cabin suitcase and my laptop bag. In addition to taking my computer everywhere I go, I also use a paper notebook to make notes along the way.</p><p></p>(18)<p>CG: Just go out and do it! Travel gives me confidence. The more I travel, the more I relax and stop stressing out.</p><p></p>(19)<p>CG: I’m planning more trips, of course! There’s always more to be done and more places to visit—which is exactly the way I like it.</p><p></p><p>(nationalgeographic.com)</p>",
        "text2": ""
    },
    {
        "taskId": "standard-19okt-reading-4",
        "type": "reading-true-or-false",
        "solutions": "[\"B\",\"A\",\"C\",\"B\",\"A\",\"C\",\"A\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about a person who is afraid of nothing and then read the statements following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "THE WOMAN WHO IS UNABLE TO FEEL FEAR",
        "example": "true",
        "text": "<p>Mary, a woman from the United States, cannot feel the emotion of fear, because of a very rare genetic condition. She has never been interviewed before, because her doctors say that people could easily take advantage of her if her identity was made public.</p><p>She says that she remembers being scared just once in her life. She was still a young girl and her father was fishing and caught a catfish. She was frightened because she didn’t want it to bite her. In fact, that was the only time she can remember experiencing fear.</p><p>Once, when her sons were small and she was out for a walk, a man called her over. He grabbed her by the shirt, and he held a knife to her throat and told her he was going to cut her. She said, “Go ahead and do it”. The man let her go, and she went home, but she didn’t call the police, as she didn’t see the danger.</p><p>She is also unable to recognise a fearful expression on the face of another person. Still, she has normal intelligence and recognises other emotions such as joy, or anger in the same way as others.</p><p>If she sees a poisonous snake that would make most people really scared, Mary will touch it without any problem. She isn’t afraid in such situations and has no bad memories afterwards.</p><p>‘If you have no fear, many more terrible things will happen to you,’ one of her doctors explained to journalists. ‘However, if you have a lot of fear, fewer bad things will probably happen.’</p><p>So is it better to be fearful or fearless?</p><p><i style='font-size:small'>(dailymail.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'>Mary has been different from other people ever since she was born.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Her story has already appeared in newspapers in the past.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> She hasn’t felt fear since she was a child.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Her father stopped fishing after the catfish incident.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The police had to save her when a man attacked her in a park.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Mary can understand that you are happy if you smile at her.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> It is difficult for her to remember faces.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> According to her doctor people like Mary experience more bad things than most people.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-19okt-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"beginning\"],[\"broken\",\"breaking\"],[\"unrealistic\"],[\"yourself\"],[\"necessarily\"],[\"motivation\",\"motive\"],[\"expected\"],[\"realise\",\"realize\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about what people promise to do in the New Year.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "THE HISTORY OF NEW YEAR’S RESOLUTIONS",
        "example": "borrowed",
        "text": "<p>New Year’s resolutions have a long history. The Babylonians promised to return (0) <b>(borrow)</b> objects and repay their debts at the (1) <b>(begin)</b> of each year, while the Romans started January by making a vow to the god Janus (from whom the month takes its name). That means we’ve had centuries of (2) <b>(break)</b> promises.</p><p></p><p>“I think the main reason why new year’s resolutions fail is that people are rather (3) <b>(realistic)</b>,” says Benjamin Gardner, an expert in behaviour change at King’s College London. “If you’re not doing any exercise and set (4) <b>(you)</b> the goal of going to the gym five times a week for half an hour, you’re probably not going to achieve it. The other reason is that people are not (5) <b>(necessary)</b> ready to change.”</p><p></p><p>Psychologists at the College recently proposed that, for something positive to happen, people must have the capability, opportunity and (6) <b>(motivate)</b> to make it happen. “Often people aren’t making resolutions for the right reasons,” says Gardner: “They think that because it’s New Year, they’re (7) <b>(expect)</b> to say they’ll change their behaviour. But once they (8) <b>(real)</b> the difficulty of what they’re doing, they give up because they aren’t motivated enough in the first place.”</p><p><i style='font-size:small'>(http://www.theguardian.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19okt-uoe-2",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"as\",\"like\"],[\"than\"],[\"it\"],[\"only\"],[\"the\",\"its\"],[\"of\"],[\"out\"],[\"in\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about the world’s largest model railroad.\",\"Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "THE WORLD’S LARGEST MODEL RAILROAD",
        "example": "It",
        "text": "<p>The largest model railroad in the world, Northlandz, took 16 years to build.</p><p>(0) has 100 trains, 400 bridges, and 3,000 miniature buildings.</p><p>It began (9) a hobby, but the world’s biggest model railroad is now much more than that. It features more (10) eight miles of track and 100 trains, as well as almost 400 bridges. Northlandz, in Flemington, New Jersey, is miniature but (11) is anything but small-scale. The spectacle contains 3,000 buildings in cities and villages, 50,000 trees and 40-foot bridges spanning huge canyons.</p><p>The owner and creator is Bruce Williams Zaccagnino, who not (12) built the 52,000 sq ft building in which it is housed but also designed and handcrafted almost all of</p><p>(13) remarkably lifelike scenery.</p><p>‘There’s nothing like it,’ he said. ‘Visitors come out saying it’s one (14) the Wonders of the World.’ Bruce loved model trains as a kid but it wasn't until he was married that he started to build models in his basement. His hobby got so (15) of control that he then added five extra basements to his home (16) order to house his collection until he finally raised the money to create Northlandz.</p><p><i style='font-size:small'>(http://www.dailymail.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19okt-uoe-3",
        "type": "uoe-multiple-choice",
        "solutions": "[\"C\",\"A\",\"B\",\"D\",\"B\",\"A\",\"A\",\"B\",\"C\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about British table manners: what you should and should not do when you eat in Great Britain.\",\"Some words are missing from the text.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\"]",
        "wordList": "{\"0\":{\"after\":\"A\",\"later\":\"B\",\"before\":\"C\",\"earlier\":\"D\"},\"1\":{\"doesn't tell\":\"A\",\"tells\":\"B\",\"says\":\"C\",\"doesn't say\":\"D\"},\"2\":{\"while\":\"A\",\"during\":\"B\",\"because\":\"C\",\"since\":\"D\"},\"3\":{\"be\":\"A\",\"to be\":\"B\",\"been\":\"C\",\"to\":\"D\"},\"4\":{\"could\":\"A\",\"need\":\"B\",\"ought\":\"C\",\"should\":\"D\"},\"5\":{\"the most of\":\"A\",\"most\":\"B\",\"most of\":\"C\",\"the most\":\"D\"},\"6\":{\"open\":\"A\",\"opening\":\"B\",\"opened\":\"C\",\"to open\":\"D\"},\"7\":{\"to let\":\"A\",\"let's\":\"B\",\"letting\":\"C\",\"you let\":\"D\"},\"8\":{\"plenty\":\"A\",\"too much\":\"B\",\"lot of\":\"C\",\"too many\":\"D\"},\"9\":{\"them\":\"A\",\"the\":\"B\",\"it\":\"C\",\"of\":\"D\"}}",
        "textTitle": "EATING ETIQUETTE",
        "example": "before",
        "text": "<p>If you cannot eat a certain type of food or have some special needs, tell your host several days (0) the dinner party. If you are a guest, it is impolite to start eating before everyone has been served unless your host (17) you don't need to wait.</p><p></p><p>It is impolite to have your elbows on the table (18) you are eating. Don't reach over someone's plate for something, ask for the item (19) passed. Never take food from your neighbour's plate.</p><p></p><p>You may eat chicken and pizza with your fingers if you are at a barbecue, or in a very informal setting. Soup (20) be taken from the side of the spoon and not from the 'end' as in</p><p>(21) European countries. Always swallow all the food in your mouth before taking more or taking a drink. Never chew with your mouth (22).</p><p></p><p>Place your knife and fork together on your plate, with the prongs of the fork facing upwards,</p><p>(23) others know that you have finished eating. If you've taken (24) food and you cannot eat (25) all, say: &quot;I'm sorry, but it seems that 'my eyes are bigger than my stomach'.&quot;</p><p><i style='font-size:small'>(www.woodlands-junior.kent.sch.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19maj-reading-1",
        "type": "reading-dialogue",
        "solutions": "[\"E\",\"L\",\"B\",\"I\",\"F\",\"K\",\"A\",\"H\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In this text about earthquakes, the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"Where can I find a record of earthquakes and data about them?\",\"B\":\"Does the earth open up during an earthquake?\",\"D\":\"How often do earthquakes happen?\",\"E\":\"What causes earthquakes?\",\"F\":\"Can earthquakes be predicted?\",\"G\":\"How do we know that we will have another one in the future?\",\"H\":\"Is it true that the number of earthquakes is growing?\",\"I\":\"Where do earthquakes take place?\",\"K\":\"Can people cause earthquakes?\",\"L\":\"How do earthquakes cause damage?\"}",
        "textTitle": "FREQUENTLY ASKED QUESTIONS ABOUT EARTHQUAKES",
        "example": "What exactly is an \"earthquake\"?",
        "text": "(0)<p>Rocks break and move in the earth. Energy is released, and that’s what makes the ground shake.</p><p></p>(1)<p>The slow deformation of &quot;tectonic plates&quot;. The rocks can break suddenly, releasing the stored energy as an earthquake.</p><p></p>(2)<p>The ground shaking may destroy buildings and hurt people.</p><p></p>(3)<p>No. People wrongly believe that suddenly a hole appears in the ground. This is only Hollywood's version of earthquakes.</p><p></p>(4)<p>Actually, all over the world; however, the so-called &quot;Ring of Fire&quot;, which is around the Pacific Ocean, is probably one of the most active areas in the world.</p><p></p>(5)<p>Not really, and we certainly can’t tell their exact date, time and location in advance.</p><p></p>(6)<p>Yes. As a result of some human activities such as mining or underground nuclear explosions, there can be small ones.</p><p></p>(7)<p>Some international websites have lists of earthquakes of magnitude 5.0 and greater, and most countries have their own forums with information on local earthquakes.</p><p></p>(8)<p>No, they happen at more or less the same rate every year.</p><p><i style='font-size:small'>(http://www.earthquakescanada.ca)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19maj-reading-2",
        "type": "reading-text",
        "solutions": "[\"D\",\"G\",\"A\",\"B\",\"E\",\"L\",\"H\",\"K\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this article about how a bank was built.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there is <u>one extra sentence</u> you do not need.\"]",
        "wordList": "{\"A\":\"as it is problematic to move a building\",\"B\":\"and dedicate it to the memory of his father\",\"D\":\"and a delivery label attached to it\",\"E\":\"and even further by railway\",\"F\":\"as a delivery method to get packages sent through the mail\",\"G\":\"but a real one\",\"H\":\"that the post office changed their regulations\",\"I\":\"but they had to do it\",\"K\":\"and it was immediately nicknamed\"}",
        "textTitle": "THE BANK THAT WAS SENT THROUGH THE POST OFFICE",
        "example": "and some dead ones, too.",
        "text": "<p>The U.S. Post Office allows its customers to mail many things besides letters. A customer can send plants, insects, some types of live animals (0). A direct marketing research company once mailed a football, a hammer, and even a water ski, with just a stamp (9), just to see what would happen. But the strangest thing sent through the mail was a bank. And not a child's piggy bank, (10).</p><p>Of course, the whole bank couldn't be sent through the mail system, (11). But the next best thing was mailed – all of the bricks used to construct the bank, all 80,000 of them.</p><p>Mr. W. H. Coltharp, a young businessman in the town of Vernal, Utah, wanted to build a bank (12). The bricks which he selected for the building were made by a company located about 120 miles away from the town by straight line, (13). Coltharp's problem was that the cost to transport 80,000 bricks from Salt Lake City to Vernal was too high, so he decided to mail the bricks to the small town through the cheap parcel post service.</p><p>He had the bricks carefully packaged in boxes, each of them weighing less than 50 pounds, the upper limit of what the post office permitted. News reports show (14), equivalent to one ton.</p><p>Finally, all the bricks were delivered, but the postmasters got so angry (15). From then on people could only send or receive a total of 200 pounds of goods in a single day. The Bank of Vernal was built (16) &quot;The Parcel Post Bank&quot; by some people in the town. The building still exists and is still used as a bank.</p><p></p><p><i style='font-size:small'>(http://www.stampsofdistinction.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19maj-reading-3",
        "type": "reading-matching",
        "solutions": "[\"B\",\"F\",\"A\",\"G\",\"I\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read the following article about a difficult test question and then read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there are <u>three extra half-sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"to test how well learners can think on their own.\",\"B\":\"to react on social media.\",\"D\":\"to be over 28.\",\"E\":\"to test note-taking abilities.\",\"F\":\"to have questions of this type in tests.\",\"G\":\"to simply give back what the teacher has taught them.\",\"H\":\"to ask such an impossible question.\",\"I\":\"to be at least 23 years old.\"}",
        "textTitle": "IMPOSSIBLE' EXAM QUESTION LEAVES CHINESE STUDENTS PUZZLED",
        "example": "to answer on a test paper.",
        "text": "<p>Primary school students at a school in China had this question on a test: &quot;If a ship has 26 sheep and 10 goats on board, how old is the ship's captain?&quot;</p><p>The question caused a heated debate on Chinese social media. &quot;This question makes no logical sense at all. Does the teacher even know the answer?&quot; Some, however, defended the school, saying, &quot;This question forces children to explain their thinking and gives them space to be creative. We should have more questions like this.&quot;</p><p>The local Education Department says the test was intended to &quot;examine the ability to think independently.&quot; The traditional Chinese method of education heavily emphasises note- taking and repetition, which critics say doesn’t encourage creative thinking.</p><p>And, of course, there's always that one person who has the right answer. &quot;The total weight of 26 sheep and 10 goats is 7,700kg, based on the average weight of each animal. In China, if you're driving a ship that has more than 5,000kg of cargo, you need to have had a boat license for five years. The minimum age for getting a boat license is 23, so he's at least 28.&quot;</p><p><i style='font-size:small'>(www.bbc.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>Some primary school students in China had a difficult question </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> This test question got a lot of people </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> In their comments, some people said it would be useful </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The aim of the question was </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Most tests in China ask learners </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> If you want to drive a boat in China, you have </div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-19maj-reading-4",
        "type": "reading-true-or-false",
        "solutions": "[\"B\",\"A\",\"C\",\"B\",\"C\",\"C\",\"A\",\"A\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about Blue Monday and then read the statements (22-29) following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "BLUE MONDAY",
        "example": "true",
        "text": "<p>Feeling miserable this morning? That is because January 15 is supposedly the most depressing day this year. A combination of three reasons makes the third Monday of the year the most miserable. Understanding that Christmas really is over, the realisation of all the holiday expenses and the fact that most of us are back at work all play a part. First invented in Britain, <i>Blue Monday</i> is especially sad in the northern half of the world, where it’s also deep, dark midwinter.</p><p>It was in 2005 that Cliff Arnall, a university lecturer from Wales, dreamt up his gloomy calculation using the above three main factors to find the date of the most depressing day in the year. He also took into account things like the weather, the period since we’ve broken our New Year’s resolutions and our general motivational level.</p><p>However, there is hope, say psychologists, as Blue Monday was really all a marketing trick. January in the UK is peak holiday booking time and the original research was paid for by a travel agent who wanted to persuade people to cheer up by heading to the beach. Preferably through them.</p><p>While there is no scientific evidence of Blue Monday on the third Monday of January – or any other Monday in a year – research shows us that our mood is significantly better on Fridays and over the weekend in general. This is generally because we get more sleep and “me time” to spoil ourselves.</p><p>Dr Burke, a psychologist, says that “since Blue Monday is a trick that may affect our thinking and emotions so much, we should turn it into Happy Monday. Instead of searching for all that is going badly on the day, think of all the good things that happen around you – that woman who held the bus door to prevent it from closing, the old lady who smiled at you for no reason or the little boy who gave you a big hug.”</p><p><i style='font-size:small'>(www.news.com.au)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'>The most depressing day of the year is called Blue Monday.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> People feel sad on this day because they are worried about the cost of their summer holiday.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The phrase Blue Monday originally comes from Britain.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> More and more people are refusing to work on Blue Monday.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Mr Arnall’s calculation has nothing to do with the weather.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> A holiday company managed to make a lot of money on Blue Monday.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Among Britons, seaside resorts are very popular in January.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> There is scientific evidence that Mondays are sadder than Fridays.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> According to Dr Burke, it depends on your attitude whether this day is sad.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-19maj-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"shopping\",\"shoppers’\",\"shopper’s\"],[\"meaning\"],[\"less\"],[\"talented\",\"untalented\",\"talentless\"],[\"fell\"],[\"extremely\"],[\"owners\"],[\"accepted\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about Black Friday, the first day of the Christmas shopping season.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "BLACK FRIDAY",
        "example": "earlier",
        "text": "<p>Why is the day after Thanksgiving called ‘Black Friday’? Most people know Black Friday as the day when stores open much (0) <b>(early)</b> and offer various sales. Many people believe we call it ‘Black Friday’ because many stores become profitable on the huge (1) <b>(shop)</b> day and go ‘into the black’. ‘Black’ refers to stores moving from the ‘red’ to the ‘black’, as in the old times records were kept by hand, and the (2) <b>(mean)</b> of red ink was a loss, while black meant a profit.</p><p>But the true story of Black Friday is (3) <b>(little)</b> well-known. The expression ‘Black Friday’ was first used to describe 24 September, 1869, when two (4) <b>(talent)</b></p><p>investors, Jay Gould and Jim Fisk, manipulated the price of gold and caused a crash. The stock market (5) <b>(fall)</b> 20% and foreign trade stopped.</p><p>In the 1950s, Philadelphia police used the term ‘Black Friday’ to refer to the day between Thanksgiving and the Army-Navy college football game. Huge crowds of shoppers and tourists went to the city that Friday, and cops had to work (6) <b>(extreme)</b> long hours to control the crowds. Shop (7) <b>(own)</b> tried to change the name to ‘Big Friday’, but the</p><p>alternative name never got (8) <b>(accept)</b>.</p><p>By the late 1980s, &quot;Black Friday&quot; had become known with the more positive message of “from red to black”.</p><p><i style='font-size:small'>(http://www.businessinsider.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19maj-uoe-2",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"H\",\"N\",\"I\",\"B\",\"K\",\"F\",\"A\",\"E\",\"D\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read a joke about an accident.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there are <u>three extra words</u> you do not need.\"]",
        "wordList": "{\"A\":\"AGREEMENT\",\" E\":\"CALM\",\"I\":\"OTHER\",\"M\":\"THEIRS\",\"B\":\"ANOTHER\",\"F\":\"CELEBRATE\",\"K\":\"SEAT\",\"N\":\"THERE’S\",\"G\":\"EITHER\",\"L\":\"SIT\",\"D\":\"ANY\",\"H\":\"NEITHER\"}",
        "textTitle": "FRIENDS IN TROUBLE",
        "example": "BOTH",
        "text": "<p>A woman and a man get into a car accident. (0) of their cars are totally destroyed, but amazingly (9) of them is hurt. After they crawl out of the wreckage, the woman says, “Look at our cars – (10) nothing left! Thank God we are all right! This must be a sign that we should be friends and not try to put the blame on each (11).” The man replies, “Oh yes, I agree with you completely.”</p><p>The woman points to a bottle on the ground and says, “And here’s (12) miracle. Somehow this bottle of whisky from my back (13) didn’t break. Let’s drink this Scotch and (14) our good fortune.” Then she hands the bottle to the man. The man nods his head in (15), opens it, and drinks about a third of the bottle to (16) his nerves. He then hands it back to the woman. The woman takes the bottle and puts the cap back on.</p><p>The man asks, “Aren’t you having (17)?” The woman replies, “No. I think I’ll just wait for the police ... I’ll let them decide whose fault it was.”</p><p><i style='font-size:small'>(https://www.reddit.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-19maj-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"of\"],[\"the\"],[\"something\"],[\"who\",\"that\"],[\"be\",\"get\"],[\"to\"],[\"were\",\"got\"],[\"have\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about fairy tales. Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "FAIRY TALES – SCARY TALES",
        "example": "to",
        "text": "<p>Many generations are familiar with the characters from Cinderella or Beauty and the Beast thanks (0) Disney’s hit adaptations of the original fairy tales.</p><p></p><p>Pictures of big-eyed beautiful females and charming males are among the first details a lot (18) viewers mention when asked about the movies. But (19) truth is that the Disneyfied tales are often very different from the original story.</p><p></p><p>While we often associate fairy tales with children’s bedtime stories, their original purpose was (20) else. The original tales suggested the idea that people (21) do morally wrong things will (22) punished. Some fairy tales started out as oral stories, passed down from generation to generation, as a warning to little children (and adults) (23) be good. The most famous versions of these tales (24) written down by the Grimm brothers and Hans Christian Andersen.</p><p></p><p>While some level of morality still exists in the Disney tales and stories, most of their original, darker details and endings (25) been removed. Did you know that in the Grimm brothers’ version of Cinderella there is enough blood for a modern thriller?</p><p></p><p><i style='font-size:small'>(https://reelrundown.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18okt-reading-1",
        "type": "reading-true-or-false",
        "solutions": "[\"A\",\"B\",\"C\",\"A\",\"B\",\"A\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"Read this article about a man who rescued a gosling and then read the sentences following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "MAN AND GOOSE MAKE UNUSUAL FRIENDSHIP",
        "example": "false",
        "text": "<p>Two years ago, Mike Jivanjee spotted a tiny little gosling in a lake. The bird was alone, almost drowning, and at risk of being hit by a boat at any moment. So Mike did the right thing, wrapped up the gosling in a towel, and found her family about 100 yards away. But sadly the other geese made it clear that the tiny gosling wasn’t welcome.</p><p>Mike decided he would take the gosling home and care for her until she was fully grown, at which point he would release her into the wild. But the goose, who Mike named Kylie, had other plans. Every time Mike tried to let Kylie fly away, she just kept coming back. She wouldn’t leave him alone.</p><p>After constant attempts to set Kylie free, Mike realised that he had no other option but to accept his new friend. Kylie now follows him everywhere – to the shops, when he’s out on his boat, around the house.</p><p>‘Kylie’s personality is a lot like a person’s,’ says Mike. ‘She has her good days and bad days. She can do things she knows she is not supposed to. Like boarding other people’s boats, harassing neighbors or stealing things from them. She loves to steal small items like keys, wallets, flip flops and throw them in the lake.’</p><p>When they’re together (which is pretty much all the time), Mike and Kylie love to go to Starbucks and watch TV. Kylie loves all shows on the Discovery Channel. She’s also a huge fan of the Ellen Show and Animal Planet. Kylie also loves to go paddle and hang out inside neighbors’ houses when they go on vacation. She does not identify as a goose so she wants to be with people all the time.</p><p><i style='font-size:small'>(www.metro.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'> Mike found the baby bird in a river.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Mike tried to take the gosling back to its family.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Mike decided to take the bird to the zoo.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> On one occasion Kylie had to be taken to a vet.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The goose sometimes takes things from Mike’s neighbors.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Kylie cannot stand films about nature.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The bird spends a lot of time with Mike.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-18okt-reading-2",
        "type": "reading-dialogue",
        "solutions": "[\"H\",\"A\",\"G\",\"D\",\"F\",\"B\",\"I\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"In the following interview with Will Shortz, Crossword Editor for The New York Times the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"You founded the American Crossword Puzzle Tournament in 1978 and you’re still directing it. What keeps you involved?\",\"B\":\"If print media dies, will crosswords survive?\",\"D\":\"Are New York Times puzzles different since you became the paper’s crossword editor in 1993?\",\"E\":\"What were your goals when you became the editor there?\",\"F\":\"What are your feelings about words that appear frequently in puzzles, but not nearly as often in conversation?\",\"G\":\"We’ve noticed a lot of tournament champions win more than once. What qualities do they share?\",\"H\":\"You got a special college degree from Indiana University, isn’t that right?\",\"I\":\"If you had to guess how many people in the world can make their living on puzzle making and editing, what number would you say?\",\"K\":\"Do New York Times crosswords get harder every day of the week?\"}",
        "textTitle": "",
        "example": "What puzzles did you enjoy when you were growing up?",
        "text": "(0)<p></p><p>Almost any kind. Sam Loyd, the great American puzzle genius, was my childhood hero. I bought his puzzle collections from Dover Books.</p><p></p>(7)<p>Yes, they have a special course, which was new when I was there. If you’re accepted, you can have a programme of your choice.</p><p></p>(8)<p>It's the participants. Crossword people tend to be smart, interesting and often funny, too. They're my kind of people.</p><p></p>(9)<p>You have to be a good speller, of course, and have a wide vocabulary. It helps to know a little about everything, from classical to modern.</p><p></p>(10)<p>Many of the crosswords I ran in the 1990s wouldn't get accepted today. Standards have risen both in themes and fill.</p><p></p>(11)<p>The worst kind involves ones like AROA, a Venezuelan copper center, IMU, a Hawaiian baking pit, and CERE and PELA, kinds of Chinese wax. I try never to use them.</p><p></p>(12)<p>Well, I think they will do fine in the electronic age. They're the best and most flexible form of puzzle ever devised.</p><p></p>(13)<p>Fewer than a hundred. And as one of these, I'm a very lucky guy.</p><p><i style='font-size:small'>(www.politico.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18okt-reading-3",
        "type": "reading-paragraphs",
        "solutions": "[\"H\",\"A\",\"D\",\"B\",\"F\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"In the following text about family holiday programmes, the headings with the place names have been removed.\",\"Some paragraphs are missing.\",\"Your task is to put the jumbled paragraphs back in order.\",\"Place the paragraphs in the boxes as in the example.\"]",
        "wordList": "{\"A\":\"Celebrating Christmas past, Geffrye Museum, London\",\"B\":\"Take a walk along the Giant’s Causeway, Antrim, Northern Ireland\",\"D\":\"Yorkshire sculpture park, Wakefield\",\"E\":\"Visit England’s tallest Christmas tree, London\",\"F\":\"Ice skating, Winchester Cathedral\",\"G\":\"Visit the Twinings tea shop and museum, London\",\"H\":\"Visit history’s greatest ocean liner, the Titanic, Belfast\"}",
        "textTitle": "IT'S TWIXMAS TIME: PLACES TO VISIT IN THE UK BETWEEN CHRISTMAS AND NEW YEAR",
        "example": "Lighting up Blenheim Palace, Oxfordshire",
        "text": "(0)<p>For the first time ever, the beautiful gardens of this majestic building will be illuminated by torches and candles to create a magical after-dark trail. There will be seasonal themes in each section, including a fire garden and a small playground for children.</p>(14)<p>The world’s largest experience of its kind is open all year round. The family attraction stands at the historic yard where the ship was built and has nine interactive galleries, as well as other exhibitions allowing a glimpse into the glamour of the first-class cabins, as well as the story of that tragic voyage.</p>(15)<p>This charming place becomes even more so over the festive season, when its range of old living rooms receive seasonal decoration, giving an example of holiday activities in English households through the ages.</p>(16)<p>This place is another family favourite, especially for those who love taking a walk while admiring this great outdoor exhibition by some of the leading artists of the 20th century. In winter it can be particularly picturesque: as the artworks stand out atop a white carpet of snow.</p>(17)<p>This natural wonder is an iconic part of the region’s heritage. The programme lasts about 2 hours depending on weather conditions and how fast you can progress. The visitors’ centre is open daily and, of course, the great basalt columns and coastal path are open all year around.</p>(18)<p>Now with a see-through roof, this place is an all-weather affair, without anything to ruin the beautiful views of the building while you glide along. There’s also a nearby café for after-sport relaxation which serves mulled wine and mince pies.</p><p><i style='font-size:small'>(independent.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18okt-reading-4",
        "type": "reading-text",
        "solutions": "[\"G\",\"A\",\"L\",\"D\",\"H\",\"B\",\"F\",\"E\",\"K\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this text about buttons that may trick you.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there is <u>one extra sentence</u> you do not need.\"]",
        "wordList": "{\"A\":\"which says “open”\",\"B\":\"even when we’re not\",\"D\":\"gives no control over a system\",\"E\":\"to change their signals at a specific rate\",\"F\":\"that zebra crossings had a great many placebo buttons\",\"G\":\"waiting for the doors to open\",\"H\":\"which are actually designed to mislead us\",\"I\":\"where you may have to wait over a minute\",\"K\":\"that their actions were having an effect\",\"L\":\"and their journeys continue\"}",
        "textTitle": "PRESS ME – THE BUTTONS THAT LIE TO YOU",
        "example": "along the Central Line in London",
        "text": "<p>The underground arrives at a busy station (0). It is early evening on a Thursday. There is a crowd of commuters inside and outside the train, (19). The man who is nearest to them is very impatient. He pushes the green button (20). A second later, the doors softly open. The crowds get on and off the train, (21). Possibly the traveller didn’t know this, but his finger had no effect on the mechanism.</p><p>Some would call this a ‘placebo button’ – it (22), but it is at least psychologically satisfying to push for the user. In fact, there are many examples of buttons</p><p>which do nothing and indeed other technologies (23), but here’s the really surprising thing. Many people say that we benefit from the illusion that we are in control of something – (24).</p><p>In 2013, BBC journalist Tom de Castella discovered (25). A crossing in central London had programmed intervals for red and green lights, for example. Pushing the button would only change the length of these intervals between midnight and 7am. In several other cities during busy periods, the crossings were programmed (26). The buttons did nothing, but a “wait” light would still show when they were pressed and, yes, people still pressed them believing (27)!</p><p></p><p><i style='font-size:small'>(bbc.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18okt-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[\"astronomer\",\"impossible\",\"protection\",\"least\",\"descriptions\",\"magic\",\"registered\",\"attacking\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read about a legend connected to the Tower of London. Some words are missing from the text.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "THE SIX RAVENS",
        "example": "fascinating",
        "text": "<p>If anything characterizes the British, it is how they respect and preserve their traditions and legends. One of these (0) <b>(fascinate)</b> legends is the story of the six ravens at the Tower of London.</p><p>The legend, and with it the tradition, was born during the reign of Charles II (1630-(1685). The king’s (1) <b>(astronomy)</b> wanted to remove all the ravens from the Tower. These birds spent all day flying around, making it (2) <b>(possible)</b> for him to observe the sky with his telescope. But King Charles II thought it would be bad luck to scare or kill the ravens. To ensure the (3) <b>(protect)</b> of these birds Charles II ruled that there should always be at (4) <b>(little)</b> six ravens inhabiting the Tower.</p><p>One of the first (5) <b>(describe)</b> of the Tower of London’s ravens appeared in a novel by a Japanese writer, The Tower of London. He wrote that those executed in the Tower were turned into ravens. It is a fabulous dark story that adds to the (6) <b>(magic)</b> of the place. Today, the ravens are (7) <b>(register)</b> as ‘soldiers’ of the Kingdom, and, thus, can be expelled from the Tower if they misbehave. This happened to Raven George, who was fired in</p><p>1986 for (8) <b>(attack)</b> TV antennas; he was taken to the Zoological Park of Wales.</p><p><i style='font-size:small'>(https://theculturetrip.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18okt-uoe-2",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"came\"],[\"spoke\",\"knew\"],[\"on\"],[\"if\",\"whether\"],[\"were\"],[\"what\",\"whatever\",\"everything\"],[\"but\",\"and\"],[\"it\"],[\"stopped\",\"finished\",\"quit\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read a joke about the smart Navajo people. Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "NASA AND THE NAVAJO",
        "example": "a",
        "text": "<p>When NASA was working on the Apollo Project, it took the astronauts to (0) Navajo reservation in Arizona for training. One day, a Navajo elder and his son (9) across the space crew, who were walking among the rocks.</p><p>The elder, who (10) only Navajo, asked a question. His son translated for the NASA people: &quot;What are these guys in the big suits doing?&quot; One of the astronauts said they were preparing to go (11) a trip to the moon. The Navajo elder got all excited and asked (12) it would be possible to send a message to the moon.</p><p>Recognizing a promotional opportunity, a NASA official said, &quot;Certainly!&quot; and took out a tape recorder. The Navajo elder's comments into the microphone (13) brief. The NASA official asked the son to translate (14) his father had said. The son laughed heartily (15) he refused to translate.</p><p>So the NASA people took the tape to a nearby Navajo village and played (16) for other members of the tribe. They laughed long, too, but also refused to translate the message.</p><p>Eventually, an official government translator was called. After he finally (17) laughing, he translated the message: &quot;Watch out for these guys! They've come to steal your land.&quot;</p><p></p><p><i style='font-size:small'>(https://www.reddit.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18okt-uoe-3",
        "type": "uoe-multiple-choice",
        "solutions": "[\"B\",\"D\",\"C\",\"A\",\"D\",\"C\",\"D\",\"B\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about a Chinese-born American artist. Some words are missing from the text.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\"]",
        "wordList": "{\"0\":{\"who’s\":\"A\",\"of whose\":\"B\",\"whose\":\"C\",\"of whom\":\"D\"},\"1\":{\"got based on\":\"A\",\"became the basis of\":\"B\",\"founded at\":\"C\",\"became placed in\":\"D\"},\"2\":{\"must not\":\"A\",\"will not\":\"B\",\"should not\":\"C\",\"cannot\":\"D\"},\"3\":{\"like\":\"A\",\"then\":\"B\",\"as\":\"C\",\"born\":\"D\"},\"4\":{\"drawing\":\"A\",\"when drew\":\"B\",\"drawn\":\"C\",\"drew\":\"D\"},\"5\":{\"can\":\"A\",\"had to\":\"B\",\"ought\":\"C\",\"was able to\":\"D\"},\"6\":{\"introduces\":\"A\",\"identifies\":\"B\",\"influences\":\"C\",\"includes\":\"D\"},\"7\":{\"plenty\":\"A\",\"lot of\":\"B\",\"dozens\":\"C\",\"hundreds of\":\"D\"},\"8\":{\"would lose\":\"A\",\"have lost\":\"B\",\"had lost\":\"C\",\"could lose\":\"D\"}}",
        "textTitle": "BAMBI ARTIST DIES AGED 106",
        "example": "whose",
        "text": "<p>Tyrus Wong, the artist (0) works inspired the Disney film Bambi, has died aged 106.</p><p></p><p>A Chinese immigrant, Mr Wong’s vibrant paintings captured Walt Disney’s eye and (18) the film’s unique style. In a statement, the Walt Disney Museum said “his impact on the artistic composition of the animated feature Bambi (19) be praised enough.”</p><p></p><p>Mr Wong immigrated to the United States from China (20) a child. After studying as an artist, he began working with Disney in 1938, (21) hundreds of pictures between poses to create the illusion of motion.</p><p></p><p>“Walt Disney saw that Tyrus (22) produce admirable artwork that did not necessarily look like the forest - but rather, felt like the forest. Walt’s vision for Bambi and use of Tyrus’ work still (23) films today,” the statement said.</p><p></p><p>After retiring, he created (24) beautiful bamboo kites, and became the subject of a documentary about his life. The documentary’s director said “With his passing, we (25) a brilliant artist, Chinese American pioneer, and hero.”</p><p></p><p><i style='font-size:small'>(www.bbc.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18maj-reading-1",
        "type": "reading-dialogue",
        "solutions": "[\"F\",\"L\",\"E\",\"H\",\"B\",\"G\",\"A\",\"K\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In the following interview with a sign language interpreter the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"How difficult is it for a sign-language interpreter to keep up with a speaker who is talking very fast?\",\"B\":\"How much money do you make as a sign language interpreter?\",\"D\":\"What do you consider to be your greatest success?\",\"E\":\"What do you like most about being an interpreter?\",\"F\":\"How would you describe what you do?\",\"G\":\"What education and skills does one need to be a sign language interpreter?\",\"H\":\"What do you dislike about the work?\",\"I\":\"How long have you been in your present job?\",\"K\":\"What advice would you offer someone considering this career?\",\"L\":\"How did you get started in your job?\"}",
        "textTitle": "",
        "example": "What do you do for a living?",
        "text": "(0)<p>I am an official sign language interpreter interpreting in state and local courts.</p><p></p>(1)<p>I am an officer of the court and I perform interpreting services for persons who are deaf or hard of hearing.</p><p></p>(2)<p>Years ago, I worked in the legal field and I met the wonderful lady who actually held this position at the time and decided to do the same thing.</p><p></p>(3)<p>Interpreters sometimes meet movie stars, famous performers, popular athletes and important politicians. Interpreters also have the opportunity to learn so much while working.</p><p></p>(4)<p>Well, sometimes I have to work at the weekends, on holidays or even at night.</p><p></p>(5)<p>All states pay differently and the pay level usually depends on the complexity of the job.</p><p></p>(6)<p>You must have a bachelor’s degree. You need to have a lot of knowledge about a lot of things, so getting more education increases your ability to interpret well.</p><p></p>(7)<p>It really is not a problem for me. It is actually more challenging to interpret for a slow talker than a fast one.</p><p></p>(8)<p>Be patient because it takes a lot of time to develop language skills to become fluent enough to become a professional interpreter.</p><p></p><p></p><p><i style='font-size:small'>(www.jobshadow.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18maj-reading-2",
        "type": "reading-text",
        "solutions": "[\"D\",\"B\",\"K\",\"G\",\"A\",\"L\",\"F\",\"H\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"In this article about public speaking, some parts of sentences have been left out.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"in order to have enough opportunity to practise\",\"B\":\"I want the audience to leave with\",\"D\":\"and talk about the achievements of their teams\",\"E\":\"whether you enjoy the experience\",\"F\":\"in order to help to illustrate the points you’re making\",\"G\":\"what is it that you want them to remember, think or do\",\"H\":\"you want it to be over\",\"I\":\"but doing so is brilliant for our careers\",\"K\":\"and an ending that gives the audience a takeaway\",\"L\":\"what you have planned to say\"}",
        "textTitle": "HOW TO IMPROVE YOUR PUBLIC SPEAKING",
        "example": "but preparation and breathing techniques can help you feel relaxed",
        "text": "<p>Many people panic at the thought of talking to a large audience, (0).</p><p>Public speaking can make even the most confident person scared. But today, you don’t even have to be a manager to give presentations – staff at every level are expected to stand up (9). Below you can read some advice from experts.</p><p>“I always begin my planning with the end in mind,” says Karen Glossop, psychologist. “What are the one or two main points (10)? Plan the talk around your main points and build the structure accordingly.”</p><p>Another expert, who coaches people in communication and presentation skills, suggests that you should make your speech memorable. “Create an opening that grabs attention (11). We naturally remember the first and last bits better than the middle.”</p><p>When clients tell him that they don’t have time to prepare, he advises them to spend just 10 minutes thinking about what it is they want to say: “What is the one thing you want people to take away? When your audience leaves the room, (12)? That way you will structure your message well.”</p><p>The most important thing is to remember your main ideas and not the exact words, says the president of the Academy of Public Speakers. “Prepare in advance (13). While doing so, focus on the message rather than trying to remember every single word in order,” he says. “As no one will know exactly (14), leaving out a word will not cause a problem.”</p><p>“When you practise, include any slides, flip charts, aids or props (15),” he adds. How you present your speech is equally, or maybe even more important than what you say. Speaking slowly and clearly is very important. Don’t rush through your talk, no matter how much (16). “Taking time to pause and breathe helps the speaker to feel less stressed, and helps support the voice”.</p><p>Psychologists say we should never turn down a chance to speak. We should find a safe place like a school theatre group, where we can get feedback from our friends to overcome fears.</p><p><i style='font-size:small'>(www.theguardian.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18maj-reading-3",
        "type": "reading-true-or-false",
        "solutions": "[\"A\",\"A\",\"B\",\"C\",\"A\",\"B\",\"A\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this article about a meeting for Santas and then read the sentences following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "SANTAS FROM ALL OVER THE WORLD MEET",
        "text": "<p>With just five months until Christmas, Santas from around the world are gathering in Copenhagen for a mid-season break at World Santa Claus Congress, which is organised every summer.</p><p>The annual conference gives them a chance to network, meet the public and get into shape for the busy days in December. Santa Cherry from Canada, who is taking part for the fifth time, said there was much more to being a Santa than just the clothes.</p><p>“A successful Santa is not just about the costumes and the clothes. You have to be caring to be a really successful Santa and it’s not something you can make up,” she said.</p><p>The World Santa Claus Congress has taken place at the Bakken amusement park near Copenhagen since 1957 and always in the summer, which is Santa’s off season. During the congress they have the opportunity to discuss important questions concerning their job, such as the value of the presents, the length of Santa’s beard and the delivery of the presents. The most problematic question seems to be the exact date when Santa should bring the presents.</p><p>The most important part of the meeting is for the professional Santas to meet the public. Apart from parades there is also some sightseeing, Christmas cake baking and storytelling for the children. On the last day, Santas have to compete in a race.</p><p></p><p><i style='font-size:small'>(https://uk.reuters.com)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'>The global meeting for Santas is held in Copenhagen every two years.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The congress has three main aims.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> His or her clothes are also an important part of Santa’s success.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> According to Santa Cherry, you can still be a good Santa without being kind and loving.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The Bakken amusement park is very popular among Santas.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Santas have debates about questions such as how much they should spend on the presents.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Santas are in general agreement about when Santa should arrive with the presents.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Santas take part in a competition during the congress.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-18maj-reading-4",
        "type": "reading-free-gap-filling",
        "solutions": "[[\"boat’s engine\",\"yacht’s engine\",\"boat’s motor\",\"yacht’s motor\"],[\"fishing\",\"Taiwanese\",\"boat\",\"ship\",\"vessel\",\"fisherman\"],[\"without\",\"without using\"],[\"SOS calls\",\"SOS signal\",\"SOS signals\",\"SOS message\",\"SOS messages\",\"distress signals\"],[\"day\"],[\"a year\",\"one year\"]]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about two lucky sailors and then read the gapped sentences following the article.\",\"Your task is to complete the sentences with one or two words only based on the information in the text.\",\"The exact word(s) you need may or may not be in the article.\",\"An example has been given for you.\"]",
        "wordList": "{}",
        "textTitle": "US SAILORS RESCUED AFTER FIVE MONTHS IN PACIFIC",
        "example": "five months",
        "text": "<p>Two US yachtswomen and their two dogs have been rescued after spending nearly five months lost in the Pacific Ocean.</p><p></p><p>Jennifer Appel and Tasha Fuiaba say they were on their way in a small sailing boat from Hawaii to Tahiti when their engine, damaged by a storm, failed. Their boat then drifted in the open seas about 1,500km southeast of Japan, they said. They were rescued after a fishing boat alerted US authorities.</p><p>The pair said they set off in May and their engine broke down at the end of that month. They originally thought they would be able to reach land with the help of only wind and sails. Ms Appel said they sent SOS signals daily for nearly 100 days but received no response. &quot;It was very depressing and very hopeless, but it's the only thing you can do, so you do what you can,&quot; she said.</p><p>But on 24 October, a Taiwanese fishing boat saw their boat drifting in the ocean and contacted authorities on the US territory of Guam. The USS Ashland arrived early the following day to rescue the sailors and their two four-legged companions. They said they managed to survive this nightmare thanks to a water purifier and a year's worth of dry goods such as muesli and pasta.</p><p>&quot;The US Navy saved our lives,&quot; Ms Appel said. &quot;The pride and smiles we had when we saw them on the horizon were pure relief.&quot;</p><p></p><p><i style='font-size:small'>(www.reuters.com)</i></p>",
        "text2": "<ol start='0'><li>The two sailors and their dogs spent (0) lost in the ocean.</li><li></li><li></li><li>Their (24) stopped because of bad weather.</li><li></li><li></li><li>The yachtswomen got lucky when a(n) (25) noticed them.</li><li></li><li></li><li>At first, the sailors hoped they would be able to arrive at their destination (26) the engine.</li><li></li><li>The sailors’ only hope was to send out (27) every day.</li><li></li><li></li><li>The sailors were saved just one (28) after they were found on the 24th of October.</li><li></li><li>The sailors had enough food to last for (29) in the boat.</li></ol>"
    },
    {
        "taskId": "standard-18maj-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"celebrations\"],[\"Spanish\"],[\"western\",\"westward\",\"westerly\"],[\"departure\"],[\"death\"],[\"explorer\"],[\"unknown\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about the origins of Columbus Day, a public holiday in the United States. Some words are missing from the text.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "COLUMBUS DAY",
        "example": "national",
        "text": "<p>On Columbus Day, people in the U.S. remember and celebrate the day – October 12, 1492 – when Christopher Columbus landed in the Americas. It became a (0) <b>(nation)</b> holiday in 1937, however, (1) </p><p>(celebrate) were held in a number of cities and states on October 12 as early as the 18th century.</p><p>Columbus left Spain for Asia in August 1492. The (2) <b>(Spain)</b> monarchs, King Ferdinand and Queen Isabella supported his voyage. Columbus wanted to find a (3) <b>(west)</b> sea route to China, India and the famous gold and spice islands of Asia. Most educated Europeans in Columbus' day understood that the world was round, but they did not yet know that the Pacific Ocean existed. They thought that only the Atlantic Ocean lay between Europe and Asia. So two months after his (4) <b>(depart)</b>, instead of Asia, Columbus landed in the Bahamas.</p><p>Columbus crossed the Atlantic several more times before his (5) <b>(die)</b> in 1506. However, it wasn’t until his third journey that the great (6) <b>(explore)</b> finally realized he hadn't reached Asia but he had found a continent previously (7) <b>(know)</b> to most Europeans.</p><p>Columbus Day was originally celebrated every October 12, but was changed to the second Monday in October in 1971.</p><p><i style='font-size:small'>(http://www.history.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18maj-uoe-2",
        "type": "uoe-multiple-choice",
        "solutions": "[\"D\",\"B\",\"B\",\"A\",\"C\",\"A\",\"D\",\"C\",\"B\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about a strange sport called ‘wife carrying’. Some words are missing from the text.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\"]",
        "wordList": "{\"0\":{\"that\":\"A\",\"what\":\"B\",\"which\":\"C\",\"-\":\"D\"},\"1\":{\"carrying\":\"A\",\"who carries\":\"B\",\"is carrying\":\"C\",\"to carry\":\"D\"},\"2\":{\"by\":\"A\",\"in\":\"B\",\"with\":\"C\",\"from\":\"D\"},\"3\":{\"were stolen\":\"A\",\"stole\":\"B\",\"have stolen\":\"C\",\"was stealing\":\"D\"},\"4\":{\"then\":\"A\",\"after\":\"B\",\"than\":\"C\",\"when\":\"D\"},\"5\":{\"holds\":\"A\",\"makes\":\"B\",\"takes\":\"C\",\"gets\":\"D\"},\"6\":{\"required\":\"A\",\"respected\":\"B\",\"refused\":\"C\",\"reminded\":\"D\"},\"7\":{\"can\":\"A\",\"may\":\"B\",\"might\":\"C\",\"must\":\"D\"},\"8\":{\"what is worn\":\"A\",\"is worn\":\"B\",\"worn\":\"C\",\"wearing\":\"D\"},\"9\":{\"is dropped\":\"A\",\"drops\":\"B\",\"will drop\":\"C\",\"have dropped\":\"D\"}}",
        "textTitle": "WIFE CARRYING",
        "example": "which",
        "text": "<p>Wife carrying is a sport in (0) male competitors race while each carrying a female teammate. The aim is for the male (8) the female through a special track in the fastest time. The winning team takes home the wife's weight (9) beer.</p><p>Wife Carrying started in Finland, and its history is based on the 19th century legend of “Ronkainen the Robber”. Ronkainen and his thieves (10) food and women from villages in the area where they lived, (11) they carried the women on their backs as they ran away.</p><p>The first wife carrying event was held in Finland in 1992. It now (12) place there as the World Championship every year. Here are some of the rules:</p><p><ul><li>Teammates are not (13) to be legally married.</li></p><p><li>The minimum weight for the female competitor is 49 kilograms, and she (14) be at least 18.</li></p><p><li>The only equipment allowed is a belt (15) by the carrier. A helmet is necessary for the woman.</li></p><p><li>There is no restriction on how the female teammate is carried.</li></p><p><li>If a competitor (16) his teammate, their team will be punished with five seconds added to their time.</li></ul></p><p></p><p><i style='font-size:small'>(http://www.wife-carrying.org)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-18maj-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"not\",\"less\",\"never\"],[\"be\",\"become\"],[\"who\",\"that\",\"and\"],[\"took\"],[\"for\"],[\"each\",\"every\",\"before\",\"by\"],[\"by\",\"among\",\"amongst\"],[\"as\"],[\"than\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about sleeping cars designed by George Pullman, whose company manufactured and operated railroad cars. Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "PULLMAN SLEEPING CARS",
        "example": "were",
        "text": "<p>Sleeping cars (0) introduced in 1838 in the US to provide &quot;hotel&quot; sleeping accommodation on overnight passenger trains. However, they were (17) commonly used until the late 1850s. George Pullman began manufacturing and operating sleeping cars in 1859. Pullman believed that if he wanted his sleeping cars to (18) successful, he needed to provide a wide variety of services to travelers. He hired porters (19) provided polite and efficient service to passengers. The porters greeted the passengers, and helped them settle into their rooms. They (20) care of the passengers’ needs while they were on board. They were responsible (21) the air conditioning and heating systems, making the beds (22) evening, cleaning the rooms, shining shoes, mailing letters and telegrams, and bringing meals into rooms on request.</p><p>Soon, Pullman’s sleeping car became the public favourite, and sleeping cars were called Pullman cars. Pullman porters were referred to as &quot;George&quot; (the name of the company's founder) (23) travelers.</p><p>The company employed African-American ex-slaves (24) Pullman porters.</p><p>Since Pullman offered better pay and security (25) most other jobs open to African Americans at the time, it was a respected job in black communities.</p><p><i style='font-size:small'>(http://www.railswest.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17okt-reading-1",
        "type": "reading-dialogue",
        "solutions": "[\"F\",\"K\",\"A\",\"I\",\"B\",\"H\",\"G\",\"D\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In the following interview with a firefighter the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there are <u>two extra questions</u> you do not need.\"]",
        "wordList": "{\"A\":\"How did you get started?\",\"B\":\"What is the most challenging thing about what you do?\",\"D\":\"What are your dreams for the future?\",\"E\":\"What do you do in your free time?\",\"F\":\"What kind of tasks do you usually do?\",\"G\":\"What is a common misbelief people have about firefighters?\",\"H\":\"How much time off do you get?\",\"I\":\"What do you like about what you do?\",\"K\":\"How can you become a firefighter?\",\"L\":\"How do you get to work?\"}",
        "textTitle": "AN INTERVIEW WITH A FIREFIGHTER",
        "example": "What do you do for a living?",
        "text": "(0)<p>I’m a firefighter.</p>(1)<p>We do everything from fighting grass fires, house fires, rubbish fires to car fires. Everybody here is an emergency medical technician so we also go to medical calls, any time.</p>(2)<p>You need a high school education, a clean police record, and a lot of heart.</p>(3)<p>I worked for the emergency medical service for 10 years before I came here, and I worked on medical calls and I just decided I wanted to be a firefighter. Then I went, applied, and took the test.</p>(4)<p>Helping in the community and my fantastic colleagues. I also like the work schedule: we work 24 hours on, 48 off, so that’s ten 24 hour shifts a month. It gives me a lot of time to do things with my family, kids and wife.</p>(5)<p>Being able to keep control over your emotions. When things are very stressful you tend to get excited, you do things too fast. You’ve got to step back and take a look at everything before you act; and I think that’s one of the hardest things for people to learn.</p>(6)<p>Right now a guy with less than 10 years on the job gets about 3 weeks' vacation per year.</p>(7)<p>That we just sit up here, watch TV, eat, and only go when there’s a fire. In fact, we hardly ever sit down, even if there’s no fire.</p>(8)<p>One day I would like to become captain.</p><p><i style='font-size:small'>(www.jobshadow.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17okt-reading-2",
        "type": "reading-paragraphs",
        "solutions": "[\"G\",\"B\",\"D\",\"A\",\"E\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read the following story about a popular packaging material.\",\"Some paragraphs are missing.\",\"Your task is to put the jumbled paragraphs back in order.\",\"Place the paragraphs in the boxes as in the example.\"]",
        "wordList": "{\"A\":\"Bowers got the idea that Bubble Wrap could be used as a good packaging material to protect the computer while it was being transported.\",\"B\":\"Not giving up, they decided to sell their invention to prevent heat from escaping from greenhouses.\",\"D\":\"It wasn't until 1959 – when IBM started selling their new 1401 computer model - that Frederick Bowers, a marketer at their company Sealed Air, finally came up with the perfect use for it.\",\"E\":\"His demonstration was successful, and IBM started buying Bubble Wrap to protect their 1401 model and other fragile products they sold and transported.\",\"F\":\"The popping sound of the little bubbles - when they got punctured - made a lot of people happy.\",\"G\":\"But the wallpaper idea didn’t sell too well.\"}",
        "textTitle": "",
        "example": "To do so, they sealed two shower curtains together in such a way that air bubbles were captured, giving it a new appearance.",
        "text": "<p>Bubble Wrap's original purpose was nothing like what we use the product for today.</p><p>In 1957, engineer Al Fielding and Swiss inventor Marc Chavannes were trying to create a special wallpaper.</p><p></p>(0)<p></p>(9)<p></p>(10)<p></p><p>However, this use of the product didn’t become popular, either.</p><p></p>(11)<p></p>(12)<p></p><p>He presented the idea to IBM and demonstrated the product’s protective abilities.</p><p></p>(13)<p></p><p>Since then, Sealed Air has grown to sales of around $4 billion a year, with a net profit of around $255 million, and around $400 million worth of Bubble Wrap is sold annually.</p><p></p><p>(mentalfloss.com)</p>",
        "text2": ""
    },
    {
        "taskId": "standard-17okt-reading-3",
        "type": "reading-true-or-false",
        "solutions": "[\"B\",\"B\",\"C\",\"C\",\"A\",\"A\",\"C\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this article about some plans concerning the date of Easter and then read the statements following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "ARCHBISHOP JUSTIN WELBY HOPES FOR FIXED EASTER DATE",
        "text": "<p>Archbishop of Canterbury Justin Welby made the announcement after a meeting of leaders of the Anglican church. He is currently working with high-ranking members of other Christian churches to agree on a fixed date for Easter.</p><p>In the UK, an act of Parliament passed in 1928 allowed for Easter Sunday to be fixed on the first Sunday after the second Saturday in April. However, this has never been activated and Easter has remained variable, determined by the moon's cycle.</p><p>The issue is back on the agenda as Easter is the most important Christian festival. It celebrates the resurrection of Jesus Christ following his death by crucifixion on Good Friday. The archbishop said he was in talks with Pope Francis, Coptic leader Pope Tawadros, and the leader of the Orthodox church Patriarch Bartholomew. Mr Welby said he hoped the change would happen &quot;in between five and ten years’ time.&quot;</p><p>&quot;I would love to see it before I retired,&quot; he said, although he warned that the first time they tried to make such a change was in the 10th century. An Anglican source told the BBC there had been 15 attempts to agree a common date since then.</p><p>Easter is on the first Sunday after the first full moon following the spring equinox, which usually falls on the 21<sup>st</sup> of March, when day and night are equally long. This means that Easter can be celebrated on a Sunday between 22<sup>nd</sup> March and 25<sup>th</sup> April. However, the Orthodox church follows the Julian calendar, and so it has later Easter celebrations compared with those of Western Christianity.</p><p>It is yet to be seen whether this latest attempt to fix the date will be successful.</p><p></p><p><i style='font-size:small'>(bbc.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'>The Archbishop of Canterbury wishes to fix the date of Easter.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Mr Welby will soon contact other church leaders about his plan.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> In Britain there was a short period in the 20th century when Easter was fixed.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Most members of the British parliament are against this plan.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Pope Francis and the leader of the Orthodox church both agree with Mr Welby’s proposal.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The Archbishop hopes that in about a decade Easter will already be fixed.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> In the past people have already tried to fix the date of Easter more than fifteen times.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> If there is an agreement about fixing Easter, the Orthodox church will abandon the Julian calendar.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-17okt-reading-4",
        "type": "reading-text",
        "solutions": "[\"H\",\"D\",\"A\",\"F\",\"B\",\"L\",\"E\",\"G\",\"I\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this article about an interesting way you can make money.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there are <u>two extra sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"most of them part-timers\",\"B\":\"I asked an unemployed man\",\"D\":\"waited in lines for several products\",\"E\":\"charge $25 for the first hour\",\"F\":\"wanted me to stand in line\",\"G\":\"creating an app or having an office\",\"H\":\"turned it into a business\",\"I\":\"how well I'm doing\",\"K\":\"leaving my regular full-time job\",\"L\":\"they make close to $1,000 a week\",\"M\":\"some of his new colleagues\"}",
        "textTitle": "NEW YORK MAN MAKES CLOSE TO $1,000 A WEEK WAITING IN LINE",
        "example": "he didn’t think twice before responding to an ad",
        "text": "<p>When Robert Samuel found himself unemployed in 2012, (0) that offered cash to wait in line for someone to get a new iPhone. A year later, the New York-born man (21) — the city’s only professional line waiting team.</p><p>His team of line-sitters have (22) including iPhones, sports shoes, special sales, concert tickets — and even Santa Claus photos. &quot;I didn't even know Santa Claus lines could be that long,&quot; Samuel said.</p><p>After two years, Samuel now has more than a dozen employees, (23), who stand in line in cities across the country. &quot;I was hired by a family in Colorado that (24) to get into a TV quiz show,&quot; he said. &quot;Because I was in New York, (25) to stand in line and the family bought him some fancy T-shirts and hats to thank him. He was in line for 43 hours.&quot;</p><p>Robert and his colleagues have been very successful — (26). They are available non-stop and (27), while each extra half hour is $10.</p><p>As he is booked for every single day in September, many people think that Robert should take his business to the next level by (28) — but he says he’s not yet ready for that. &quot;I've been asked about getting an app but I love the personal touch that my company has. When people call my number just to tell me (29) – that makes me feel good.&quot;</p><p></p><p>(nydailynews.com)</p>",
        "text2": ""
    },
    {
        "taskId": "standard-17okt-uoe-1",
        "type": "uoe-word-transformation",
        "solutions": "[[\"boring\"],[\"losing\"],[\"better\"],[\"action\",\"activity\"],[\"players\"],[\"competitors\"],[\"hard\"],[\"careful\"],[\"their\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about an interesting board game. Some words are missing from the text.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "BEYOND MONOPOLY",
        "example": "dusty",
        "text": "<p>Christmas is here! This is the time when families across the nation take out their one (0) <b>(dust)</b> copy of Monopoly, play it for half an hour before realising Monopoly is terribly (1) <b>(bore)</b>, and then go on playing for another three hours before a drunk uncle starts shouting furiously after (2) <b>(lose)</b> his final property to a five-year-old.</p><p></p><p>Don’t play Monopoly. Just make sure that you have a much (3) <b>(good)</b> game on the shelf in time for your family’s Christmas and you’ll have a lot more fun and (4) <b>(act)</b>. Ticket to Ride is your game.</p><p></p><p>In the game the (5) <b>(play)</b> need to connect up cities in 19th-century America, building out a railroad network while trying to block (6) <b>(compete)</b> from doing the same. You’ll be trying really (7) <b>(hard)</b> to draw the cards needed to connect Seattle to New York, while also trying not to give away that those are the cities you’re trying to link. If you are not (8) <b>(care)</b>, an opponent (who you’re pretty certain is joining Detroit to Los Angeles) will change (9) <b>(they)</b> own route in order to block you, ruining your chance to finish the route for good. It sounds like fun, doesn’t it?</p><p></p><p><i style='font-size:small'>(http://www.theguardian.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17okt-uoe-2",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"as\"],[\"for\"],[\"not\",\"hardly\"],[\"out\"],[\"were/got/became/felt\"],[\"pay\",\"give\"],[\"what\"],[\"at\",\"by\",\"about\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an anecdote about the Scottish poet, Robert Burns. Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "POETIC WISDOM",
        "example": "them",
        "text": "<p>Robert Burns, the great Scottish poet, loved common people and wrote for (0). Though he had little formal education, he was well read and talented. He began to be recognized</p><p>(10) a poet when his first poems were published in 1786.</p><p></p><p>One day when Burns was walking near the docks, he heard a man crying (11) help. He ran towards the water and saw a young sailor jump off the dock. The sailor started to swim towards the man, who was already drowning. Although it was (12) easy, the sailor saved the man. It turned (13) that the man who survived the incident was a very rich merchant. He thanked the brave sailor and gave him a shilling.</p><p></p><p>A large crowd of people gathered around them. All the people considered the sailor to be a hero, so they (14) displeased when the rich man offered only a shilling. Many people were protesting, but the merchant did not (15) any attention to them. At that moment Burns approached the crowd and wondered (16) the matter was. He was told the whole story. Burns was not surprised (17) the behaviour of the rich merchant. He said: “Leave him alone. The gentleman is the best judge of what his life is worth.”</p><p></p><p><i style='font-size:small'>(http://www.england-history.org)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17okt-uoe-3",
        "type": "uoe-multiple-choice",
        "solutions": "[\"C\",\"B\",\"B\",\"A\",\"A\",\"C\",\"D\",\"A\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about a Star Wars contest. Some words are missing from the text.\",\"Choose the most appropriate answer from the options for each gap in the text.\",\"There is one example at the beginning.\"]",
        "wordList": "{\"0\":{\"just for\":\"A\",\"hoping that\":\"B\",\"in order to\":\"C\",\"looking forward to\":\"D\"},\"1\":{\"if\":\"A\",\"before\":\"B\",\"until\":\"C\",\"unless\":\"D\"},\"2\":{\"as\":\"A\",\"but\":\"B\",\"when\":\"C\",\"because\":\"D\"},\"3\":{\"40 years old\":\"A\",\"40-year-old\":\"B\",\"of 40 years\":\"C\",\"40-year\":\"D\"},\"4\":{\"defeating\":\"A\",\"winning\":\"B\",\"biting\":\"C\",\"defending\":\"D\"},\"5\":{\"along with\":\"A\",\"just like\":\"B\",\"alone with\":\"C\",\"altogether\":\"D\"},\"6\":{\"said\":\"A\",\"explained\":\"B\",\"told\":\"C\",\"spoke\":\"D\"},\"7\":{\"that\":\"A\",\"the cause\":\"B\",\"however\":\"C\",\"how\":\"D\"},\"8\":{\"having\":\"A\",\"he had\":\"B\",\"being in\":\"C\",\"suffered\":\"D\"}}",
        "textTitle": "STAR WARS MARATHON",
        "example": "in order to",
        "text": "<p>Do you think you’re the biggest Star Wars fan? Think again, as one cinema-goer studied US Navy Seal breathing techniques (0) win a Star Wars marathon, sitting through 46 hours of the sci-fi saga.</p><p>A cinema in Austin, Texas, challenged fans to sit through the previous trilogies, and then The Force Awakens on repeat (18) the last person still awake was identified. The rules were simple: food, drink and toilet breaks are permitted, (19) sleeping, illegal drugs and talking and texting will result in disqualification.</p><p>Jim Braden, a (20) Texan, was the eventual winner of the marathon, (21) six other fans to win the precious prizes: a cinema membership for seven years and a seat named in his honour, (22) a naming ceremony.</p><p>“I wanted to demonstrate my passion,” he (23) journalists. Braden, who grew up with Star Wars, also talked about (24) he studied US Navy Seal breathing techniques. “We put ourselves through hell mentally and physically,” Braden added. “One other guy complained of (25) chest pains and dropped out.”</p><p>Although he had watched the latest episode nine times, his review was enthusiastic: “I came out saying that I still enjoyed the movie. That’s how you know it’s good.”</p><p><i style='font-size:small'>(http://www.independent.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17maj-reading-1",
        "type": "reading-text",
        "solutions": "[\"F\",\"B\",\"K\",\"E\",\"A\",\"G\",\"I\",\"D\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"In this part from the afterword to the book How to Make a Spaceship, some parts of sentences have been left out.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there is <u>one extra sentence</u> you do not need.\"]",
        "wordList": "{\"A\":\"facing the scientific challenge of determining\",\"B\":\"gave me a feeling of true freedom\",\"D\":\"not at your feet\",\"E\":\"if I am lucky, I hope to be among the early passengers\",\"F\":\"down in a submarine\",\"G\":\"could no longer write equations\",\"H\":\"trying to catch them\",\"I\":\"they will help to change the world for good\",\"K\":\"did manoeuvres that took me into this state of weightlessness\"}",
        "textTitle": "HAWKING ON SPACE TRAVEL",
        "example": "why we need a new generation of explorers",
        "text": "<p>In this extract from How To Make A Spaceship, Stephen Hawking explains why he said yes when offered a seat on Virgin’s SpaceShipTwo and (0).</p><p></p><p>‘I have no fear of adventure. Years ago I barrelled down the steepest hills of San Francisco in my wheelchair. I travel widely and have been to Antarctica and Easter Island and (1).</p><p>In 2007, after my sixty-fifth birthday, I did something special: I experienced zero gravity. It temporarily took away my disability and (2). After forty years in a wheelchair, I had four wonderful minutes of weightlessness. I travelled in a modified Boeing 727 jet over the ocean off Florida which (3). It has always been my dream to travel into space, and the experience was amazing.</p><p>Now I have a chance to travel to the start of space aboard a Virgin Galactic SpaceShip. Richard Branson is opening spaceflight up for ordinary citizens, and (4). I immediately said yes to Richard when he offered me a seat on SpaceShipTwo. I have lived with ALS, amyotrophic lateral sclerosis, for fifty years. When I was diagnosed at age twenty- one, I was given two years to live. I was starting my PhD at Cambridge and (5) whether the universe had always existed and would always exist or had begun with a big explosion. As my body grew weaker, my mind grew stronger. I lost the use of my hands and (6), but I developed ways of travelling through the universe in my mind and visualising how it all worked.</p><p>I believe that we need a new generation of astronauts to explore our solar system. These first private astronauts will be pioneers, and (7). It is my belief, and it is the message of Julian Guthrie’s book, for which I have written the afterword, that there is no limit to human effort. Raise your sights. Be brave and kind. Remember to look up at the stars and (8). Space, here I come!’</p><p></p><p><i style='font-size:small'>(https://www.theguardian.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17maj-reading-2",
        "type": "reading-true-or-false",
        "solutions": "[\"A\",\"A\",\"B\",\"A\",\"C\",\"A\",\"C\",\"B\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"Read this article about how a fisherman’s glasses were found and then read the sentences following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "OPTICIAN FINDS FISHERMAN'S GLASSES IN THE SEA",
        "example": "false",
        "text": "<p>Mike Richardson, aged 69, was working on a friend's boat in Swansea Marina when his £250 prescription glasses fell into the water. He wanted to order a new pair, but when a local optician, Nick King, heard about the accident he decided to help.</p><p>Diving as a qualified British Sub-Aqua Club national instructor, Nick used 31 years of experience to find Mike's lost glasses 20 feet down at the bottom of the Marina. He turned up holding the glasses after a five-minute search.</p><p>Mike said: ‘When my glasses fell into the water I thought I'd have to buy a new pair, but luckily my friend knew Nick and called him for advice. He arrived within two hours of the call and started searching the Marina in the area around the boat. We thought he'd never find them because it's very dark water down there. After five minutes there were a lot of people at the scene who came to watch and we were all amazed when Nick came up from the freezing water with my glasses! No one could believe it when we found out that Nick was actually an optician from the local <i>Specsavers</i>!’</p><p>The glasses were fine to use after a quick wash. Mike added: ‘I'm extremely grateful to Nick for returning my glasses to me!’</p><p>Nick said: ‘Looking for lost glasses isn't normally part of the <i>Specsavers</i> service, but when I heard about Mike's problem I couldn't resist helping him out. I have dived all over the world, but my dive in Swansea's Marina was unique, as I was able to use my diving skills to help a <i>Specsavers</i> patient in such an exceptional way!’</p><p><i style='font-size:small'>(www.thewave.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'>Mike Richardson was working on his daughter’s boat when his glasses fell into the sea.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Mike Richardson thought he would have to get new glasses.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Nick King had several years’ experience as a diver.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> He found the glasses two hours after jumping into the water.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Nick King had been contacted by Mike’s friend.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Nick King bought his diving equipment shortly before the incident.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The glasses did not need to be repaired.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Nick King had already found lots of lost items.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The company Specsavers regularly offers to help find lost glasses.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-17maj-reading-3",
        "type": "reading-free-gap-filling",
        "solutions": "[[\"remember\",\"memorise\",\"memorize\"],[\"thirty\",\"30\"],[\"slowly\"],[\"sleep\"],[\"drink\"],[\"light\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this article about the benefits of taking a nap.\",\"In the sentences that follow the text, there are some gaps.\",\"Your task is to fill each gap with one word so that the sentences correspond to what the text says.\",\"An example has been given for you.\"]",
        "wordList": "{\"0\":\"According to the article you cannot overlook the importance of taking a(n\",\"17\":\"Just a brief nap will help you things better.\",\"18\":\"It’s a good idea to have a(n\",\"19\":\"If you drink your coffee very , you won’t be able to have a nap.\",\"20\":\"During a nap, it’s not that important to actually .\",\"21\":\"After a nap it’s a good idea to give yourself a little time to wake up and to something.\",\"22\":\"After a short nap will help you feel energetic again.\"}",
        "textTitle": "THE SECRET OF POWER NAPPING",
        "example": "nap",
        "text": "<p>The power of the nap cannot be ignored. A recent study at Düsseldorf University has shown that even very short naps improve your memory. Looking at their effects on pilots on long flights, the researchers reported: “Naps can greatly improve both your energy level and general mood.”</p><p>Naps are of critical importance to pilots, but they can have the same benefits for anyone. Taking a nap for about half an hour is the most practical. If you want to try it yourself, have a coffee beforehand, so that it takes effect towards the end of your nap. Don’t sip your coffee too slowly, as you might find it’s already taking effect as you begin your nap.</p><p>The truth is that we can nap anywhere. The best way is to find a spot where you can make yourself comfortable at some point during the afternoon period – an unused office, the sofa in the staff room or even in the park. Then close your eyes and just let go. Some people say that they simply “can’t nap” and they won’t be able to fall asleep. But here is the thing: it doesn’t matter. What’s important is that you use this period to close your eyes and disconnect from the world for a short while.</p><p>After a nap, take five minutes to become aware of your surroundings and have a cup of tea or a glass of water. One more thing - light will reduce any tiredness quickly, so you will be full of energy and enjoy all the benefits of your nap.</p><p><i style='font-size:small'>(bbc.co.uk)</i></p>",
        "text2": "<ol start='0'><li></li></ol>"
    },
    {
        "taskId": "standard-17maj-reading-4",
        "type": "reading-matching",
        "solutions": "[\"I\",\"F\",\"A\",\"D\",\"G\",\"B\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read the following story about a clever invention and then read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there are <u>three extra half-sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"their lock cannot protect their bike.\",\"B\":\"they will almost certainly start vomiting.\",\"D\":\"can resist a thief for more than a minute.\",\"E\":\"they cannot touch the bike.\",\"F\":\"a friend’s electric bike was stolen.\",\"G\":\"it will release its smelly gas.\",\"H\":\"his friends ask him for help.\",\"I\":\"they try to cut off <i>SkunkLock</i>.\",\"K\":\"you can steal the bike.\"}",
        "textTitle": "BIKE LOCK DEVELOPED THAT MAKES THIEVES IMMEDIATELY VOMIT",
        "example": "will get a very smelly surprise.",
        "text": "<p>A thief approaches a bicycle, with an electric saw in his hand. He starts to drill, and is shot in the face with a foul spray that makes him vomit uncontrollably. This is the dream of the inventor of SkunkLock.</p><p>“Basically I was fed up with thefts,” says inventor Daniel Idzkowski. “The real last straw was when a friend parked his very expensive electric bike outside a café, and then went to have lunch and chat. When he left, his bike was gone.” He was outraged.</p><p>“I realized that the biggest problem is that most people don’t know that the lock that they bought for $20 is absolutely worthless. It costs at least $100 to get at least somewhere close to where you can at least limit the chances of a thief wanting to steal your bike. With the right tools a thief could cut through most locks in less than a minute. Thieves talk in seconds: a 15-second bike, a 20-second bike, and it goes up to 60-second bikes.”</p><p>Idzkowski created a U-shaped lock of carbon and steel with a hollow chamber to hold a pressurized gas. When someone cuts about 30% of the way into the lock the gas erupts in the direction of the cut. “It’s pretty much immediately vomit inducing,” Idzkowski said.</p><p>The inventors have tested it on themselves and volunteers at distances of 50cm and 2 metres. “At 50cm it was pretty bad. It was absolutely vomit inducing in 99% of people. At 2 metres it’s still definitely detectable and very unpleasant.”</p><p></p><p><i style='font-size:small'>(guardian.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>The thief with an electric saw </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> It will make the thief vomit if </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The inventor finally decided to create <i>SkunkLock</i> when </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Most people have no idea that </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> There is no bike lock that </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> If you cut less than half way through <i>SkunkLock</i>,</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> When the gas hits someone from half a metre away, </div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-17maj-uoe-1",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"K\",\"H\",\"I\",\"D\",\"E\",\"A\",\"L\",\"G\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about the Channel Tunnel, which was recognised as one of the \\\"Seven Wonders of the Modern World\\\" by the American Society of Civil Engineers. Some words are missing from the text.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there are <u>three extra words</u> you do not need.\"]",
        "wordList": "{}",
        "textTitle": "THE CHANNEL TUNNEL",
        "text": "<p>The Channel Tunnel is 31.4 miles long, (0) it the 11th longest tunnel in (1). It has the longest undersea portion of any tunnel in the world (23.5 miles). There are actually three tunnels down there - two for trains and a smaller service tunnel (2) can be used in emergencies.</p><p>Construction (3) six years (1988-(1994). Englishman Graham Fagg and Frenchman Phillippe Cozette (4) out the ceremonial breakthrough on December 1, 1990. They didn't quite meet in the middle – the English side tunnelled the greater distance. Eleven special machines were used to (5) the tunnel. Each of them was as long as two football pitches. One from the British side remains (6) under the Channel. Another was sold on eBay for £39,999 in 2004.</p><p>In 2014 a record 21 million passengers were transported between Britain and France (7) the tunnel – up from 7.3 million in 1995, its first full year in operation. A pet travel scheme introduced in 2000 has (8) more than one million dogs and cats travelling through the tunnel.</p><p><i style='font-size:small'>(www.telegraph.co.uk/travel/destinations)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17maj-uoe-2",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"well\"],[\"ago\"],[\"are\"],[\"be\"],[\"as\",\"because\",\"since\",\"for\"],[\"with\",\"to\"],[\"of\",\"by\"],[\"to\"],[\"what\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about an ancient Irish festival called Bealtaine, the Celtic Fire Festival. Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "BEALTAINE",
        "example": "the",
        "text": "<p>It is believed that (0) ancient Irish had four major festivals, as (9) as a number of smaller festivals. When Christianity came to Ireland around 1500 years (10), the priests and monks Christianised some of the Pagan festivals and because of that, some of the ancient Irish festivals (11) still celebrated in Ireland today.</p><p></p><p>Bealtaine signals the start of summer. Anyone who speaks Irish will (12) familiar with this word, (13) Bealtaine is also the Irish word for the month of May, along with the festival on the first day of that month. The word beal may have meant ‘bright light’ and the second part means ‘fire’. This festival is strongly connected (14) fire in Irish tradition. Until a hundred years ago, people in some country areas of Ireland still followed the custom (15) building two great fires in a field on this day and driving their cattle between the fires to protect them from disease. According to a text from the 10th century, the Druids used (16) do the same during the Pagan era hundreds of years before that. When an Irish speaker is confused or unsure (17) to do, they often use the phrase “I am between two Bealtaine fires about it”.</p><p><i style='font-size:small'>(www.bbc.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-17maj-uoe-3",
        "type": "uoe-word-transformation",
        "solutions": "[[\"attacks\"],[\"known\"],[\"location\"],[\"government\",\"governor\",\"governors\"],[\"official\"],[\"signing\",\"signer\",\"signers\"],[\"traders\",\"tradesmen\",\"tradespeople\"],[\"informally\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about the origins of the name of Wall Street. Some words are missing from the text.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "WHY IS IT CALLED 'WALL STREET'?",
        "example": "financial",
        "text": "<p>Wall Street, an actual street by that name, is located in Lower Manhattan in New York City. The street is the epicenter of the city's (0) <b>(finance)</b> district.</p><p>The name of the street originates from an actual wall that was built in the 17th century by the Dutch, who were living in what was then called New Amsterdam. The 4-meter wall was built to protect the Dutch against (18) <b>(attack)</b> from pirates and various Native American tribes, and to keep other potential dangers out of the town.</p><p>The area near the wall became (19) <b>(know)</b> as Wall Street. Because of its (20) <b>(locate)</b>, the road developed into one of the busiest trading areas in the entire city. Later, in 1699, the wall was demolished by the British colonial (21) <b>(govern)</b>, but the name of the street stuck.</p><p>The financial industry got its (22) <b>(office)</b> start on Wall Street on May 17, 1792. On that day, New York's first stock exchange was established by the (23) <b>(sign)</b> of the Buttonwood Agreement. The agreement, so-called because it was signed under a buttonwood tree which early (24) <b>(trade)</b> and speculators had previously gathered around to trade (25) <b>(informal)</b>, gave birth to what is now the modern-day New York Stock Exchange.</p><p><i style='font-size:small'>(www.livescience.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16okt-reading-1",
        "type": "reading-true-or-false",
        "solutions": "[\"A\",\"C\",\"A\",\"B\",\"A\",\"B\",\"A\",\"A\",\"B\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"Read these emails about an accident involving some ketchup and then read the statements following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "KETCHUP ON MY TROUSERS!",
        "example": "true",
        "text": "<p>An email exchange between a senior lawyer and a secretary at a London law firm over a £4 dry cleaning bill has made the news in the international media. Here is the original email from Richard Phillips, the lawyer and the bitterly ironic answer from Jenny Amner, one of the secretaries at the firm.</p><p><div style='display:flex;flex-wrap: wrap;gap: 0.5em;'><div style='flex: 1 1 33vw;padding: 0.5em;border: 1pt black solid;'>From: Phillips, Richard Sent: 25 May 2005 15:27</p><p>To: Amner, Jenny Subject: Ketchup trousers</p><p></p><p>Hi Jenny</p><p></p><p>I went to a dry cleaner’s shop at lunch and they said it would cost £4 to remove the ketchup stains. If you could let me have the cash today, that would be much appreciated.</p><p></p><p>Thanks </p><p>Richard</p><p>Richard Phillips Senior Associate</p><p>Commercial Department Baker & McKenzie</p><p>100 New Bridge Street London EC4V 6JA</div><div style='flex: 1 1 33vw;padding: 0.5em;border: 1pt black solid;'>From: Amner, Jenny </p><p>Sent: 03 June 2005 10:25 </p><p>To: Phillips, Richard</p><p>Cc: *LONDON - ALL USERS 3RD FLOOR</p><p>Subject: RE: Ketchup trousers</p><p></p><p>With reference to your email, I must apologise for not getting back to you straight away but due to my mother's sudden illness, death and funeral I have had more important problems than your £4.</p><p></p><p>I apologise again for accidentally getting a few splashes of ketchup on your trousers. Clearly your financial need as a senior associate is greater than mine as a simple secretary. After I spoke to various partners, lawyers and trainees, and showed them your email, they kindly offered to start a collection to raise the £4. I, however, didn’t accept their kind offer – but if you feel an urgent need for the £4, it will be on my desk this afternoon.</p><p></p><p>Jenny</div></div></p><p><i style='font-size:small'>(www.cnn.com)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'> The incident has been reported in several countries.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The dry cleaners would clean Richard’s trousers for £4.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The dry cleaner’s shop was right next to Richard’s office.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Richard wanted Jenny to pay the £4 on the day he wrote the email.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Jenny replied to Richard’s request as soon as it was sent.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> In her current situation Richard’s trousers didn’t seem very significant to Jenny.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Jenny’s mother died in an accident.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Jenny said she was sorry about spilling ketchup on Richard’s trousers.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Jenny’s colleagues felt that she shouldn’t pay the £4 herself.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Jenny decided to leave the money in Richard’s office.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-16okt-reading-2",
        "type": "reading-dialogue",
        "solutions": "[\"I\",\"G\",\"E\",\"B\",\"F\",\"A\",\"H\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"In the following interview with Sylvia Earle, one of the world's best known marine scientists, some questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there is <u>one extra question</u> you do not need.\"]",
        "wordList": "{\"A\":\"What is the best piece of advice anyone has ever given you?\",\"B\":\"What is the best place you have ever traveled to?\",\"D\":\"How much free time do you have?\",\"E\":\"Have you got into a lot of trouble?\",\"F\":\"Why is the ocean so important to life on Earth?\",\"G\":\"What do you daydream about?\",\"H\":\"What can’t you travel without?\",\"I\":\"What are some important qualities to have in your profession?\"}",
        "textTitle": "",
        "example": "Where did you grow up?",
        "text": "(0)<p></p><p>My personal beginning was in south Jersey on a little farm. My parents moved to Florida when I was 12 and my backyard was the Gulf of Mexico.</p><p></p>(10)<p></p><p>The best scientists and explorers have the attributes of kids! They have a sense of wonder. They have curiosity. Who, what, where, why, when, and how?! I never stop asking questions just like a five year old.</p><p></p>(11)<p></p><p>Going under water... Saving the ocean... Being a fish… I would love to slip into the skin of a fish and know what it’s like to be one. They have senses that I can only dream about.</p><p></p>(12)<p></p><p>Of course! And my family has always stood by me.</p><p></p>(13)<p></p><p>It’s always the next place. And I love to go back to the places I have known over the years.</p><p></p>(14)<p></p><p>The ocean is the cornerstone of our life support system and the cornerstone of the ocean’s life support system is life in the ocean.</p><p></p>(15)<p></p><p>Don’t take “no” for an answer and find out what you want to do and then find a way to make it happen. You can spend many lifetimes fulfilling the dreams of others. But if you have a dream of your own, don’t wait. Just find a way to make that dream come true.</p><p></p>(16)<p></p><p>I rarely go anywhere without a camera. I am not a photographer, but taking photographs helps me to remember and to document. Oh, and a bathing suit.</p><p></p><p>(nationalgeographic.com)</p>",
        "text2": ""
    },
    {
        "taskId": "standard-16okt-reading-3",
        "type": "reading-text",
        "solutions": "[\"D\",\"I\",\"B\",\"F\",\"M\",\"L\",\"G\",\"A\",\"H\",\"E\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read this text about an incident at a zoo.\",\"Some (parts of) sentences have been left out from the text.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there is <u>one extra sentence</u> you do not need.\"]",
        "wordList": "{\"A\":\"would be published soon\",\"B\":\"had left\",\"D\":\"began at dawn\",\"E\":\"could have been a danger\",\"F\":\"warned the public\",\"G\":\"were terribly upset\",\"H\":\"might not work\",\"I\":\"returned to the zoo\",\"K\":\"damaged the fence\",\"L\":\"was discovered\",\"M\":\"would not attack\"}",
        "textTitle": "WOLVES ESCAPE FROM ESSEX ZOO",
        "example": "were shot",
        "text": "<p>Three wolves have been shot dead after the captive animals broke a fence and escaped from Colchester Zoo in Essex. The wolves (0) by zookeepers during an eight-hour hunt involving armed police officers and a helicopter.</p><p>The search for the animals (17) on Tuesday when zookeepers found that five of the six wolves at the zoo had escaped through a damaged zoo fence. One of the wolves (18) and another was captured after it had been shot with an anaesthetic dart. The other three wolves (19) the area of the zoo. Essex police sent a helicopter and armed officers to the scene. Police (20) to stay away from the area even though zoo officials said that the wolves (21) anybody unless cornered.</p><p>The hunt ended shortly after 4pm when the final missing wolf (22) hiding in bushes. The animal was shot dead. A Colchester Zoo spokeswoman said the zookeepers (23) by the death of the wolves and that a full report on the matter (24).</p><p>The spokeswoman explained that the decision to shoot the animals was taken because an anaesthetic dart took 15 minutes before it had any effect and that &quot;it (25) at all in a stressed animal&quot;. The zoo added in a statement: &quot;They are wild animals, and in an unexpected situation they (26) to people. We have obviously had a very difficult day and would be grateful for your consideration. We have nothing further to add at this time.&quot;</p><p><i style='font-size:small'>(www.theguardian.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16okt-reading-4",
        "type": "reading-paragraphs",
        "solutions": "[\"F\",\"B\",\"G\",\"A\",\"D\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"Read this history of Kellogg’s Cornflakes, the popular breakfast cereal.\",\"Some paragraphs are missing.\",\"Your task is to put the jumbled paragraphs back in order.\",\"Place the paragraphs in the boxes as in the example.\"]",
        "wordList": "{\"A\":\"To his delight, the baked flakes turned out to be really tasty.\",\"B\":\"One day he accidentally left a pot of boiled wheat to stand and the wheat became soft.\",\"D\":\"Later, he tried several techniques to refine the product.\",\"E\":\"Surprisingly, the product did not come out in long sheets.\",\"F\":\"He was trying to make an easily digestible bread substitute by boiling wheat.\",\"G\":\"He baked the flakes and tasted them.\"}",
        "textTitle": "",
        "example": "In 1894, William Keith Kellogg's brother Dr John Harvey Kellogg tried to improve the diet of hospital patients.",
        "text": "<p>William Keith Kellogg was the founder of the W.K. Kellogg Foundation, founded in 1906.</p><p></p>(0)(27)(28)<p></p><p></p><p>When he rolled the softened wheat and let it dry, each grain of wheat became a large thin flake.</p><p></p>(29)(30)<p>And so, Kellogg invented corn flakes.</p>(31)<p></p><p>William Keith Kellogg eventually opened his own cereal business, and its most famous product is still sold today.</p><p></p><p><i style='font-size:small'>(inventors.about.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16okt-uoe-1",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"K\",\"L\",\"G\",\"D\",\"M\",\"E\",\"I\",\"A\",\"H\",\"B\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read a text about a fair held every October where servants and farm workers used to go to find work for the next year. Some words are missing from the text.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there is <u>one extra word</u> you do not need.\"]",
        "wordList": "{\"A\":\"AROUND\",\"D\":\"FROM\",\"G\":\"SOME\",\"K\":\"USED\",\"B\":\"BECAME\",\"E\":\"GAVE\",\"H\":\"TO\",\"L\":\"WHAT\",\"F\":\"MANY\",\"I\":\"TOOK\",\"M\":\"WHEN\"}",
        "textTitle": "HIRING FAIRS",
        "example": "TIME",
        "text": "<p>October used to be the (0) for 'Mop' or Hiring Fairs. Servants and farm labourers (1) to work from October to October and then go to the centre of the town to hire themselves out again for the next year. They dressed in their best clothes, and to let people know (2) work they wanted, they used to wear or carry (3) sign of their work. Maids carried a small mop (that's where we get the name Mop Fairs (4) ), a shepherd had wool, a gardener had flowers etc. The new masters and mistresses walked around the fair and talked to the people. (5) they had come to an agreement, they (6) the servant a small coin. The servant (7) off the sign of his job and replaced it with a bunch of brightly coloured ribbons to let everyone know that he had been hired.</p><p>The custom remains today in some towns and villages (8) the country. In Stratford, which is home (9) one of the country's biggest fairs, the Mop (10) a funfair after World War I. It is usually held around 12 October. <i style='font-size:small'>(www.woodlands-junior.kent.sch.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16okt-uoe-2",
        "type": "uoe-word-transformation",
        "solutions": "[[\"aged\"],[\"French\"],[\"occasionally\"],[\"Spanish\",\"Spaniards\"],[\"fighting\"],[\"successful\"],[\"famous\"],[\"invasion\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about Admiral Horatio Lord Nelson, who was a British naval commander and national hero. Some words are missing from the text.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "ADMIRAL NELSON",
        "example": "sixth",
        "text": "<p>Born on 29 September 1758, Nelson was the (0) <b>(six)</b> of the 11 children of a priest. He joined the navy (11) <b>(age)</b> 12, on a ship commanded by an uncle. He became a captain at 20, and served in the West Indies, the Baltic and Canada.</p><p>When Britain entered the (12) <b>(France)</b> Revolutionary Wars in 1793, Nelson became a commander. He helped capture Corsica and fought at Calvi, where he lost the sight in his right eye. He later lost his right arm too.</p><p>As a commander he was known for his courage and he (13) <b>(occasional)</b> ignored his seniors' orders. This brought him victories against the (14) <b>(Spain)</b> in 1797, and at the Battle of Copenhagen four years later, where he ignored orders to stop (15) <b>(fight)</b> by putting his telescope to his blind eye and claiming he couldn't see the signal to withdraw.</p><p></p><p>Between 1794 and 1805, under Nelson's (16) <b>(success)</b> leadership, the Royal Navy won several battles against Napoleon. His most (17) <b>(fame)</b> engagement, at Cape Trafalgar, saved Britain from the threat of (18) <b>(invade)</b> by Napoleon, but it was his last. He was killed by a sniper on 21 October 1805.</p><p><i style='font-size:small'>(www.bbc.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16okt-uoe-3",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"by\"],[\"the\"],[\"order\"],[\"than\"],[\"not\",\"never\"],[\"and\",\"plus\"],[\"have\"],[\"were\"],[\"them\"],[\"is\"],[\"been\"]]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an article about a duchess who is planning to give away her fortune because she wants to marry a public servant. Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "IN THE NAME OF LOVE",
        "example": "one",
        "text": "<p>The Duchess of Alba, who is (0) of the richest women in Spain, owns a dozen castles whose walls are hung with works (19) Goya, Velazquez and Titian, and is a distant relative of Winston Churchill and Diana, Princess of Wales. Now, however, (20) 18th Duchess of Alba is giving away her enormous personal fortune in (21) to be free to marry a public servant.</p><p></p><p>According to Guinness World Records, Maria del Rosario has more titles (22) any noble on Earth: she is a duchess seven times, a countess 22 and a marquesa 24 times. As head of the 539-year-old House of Alba, her privileges include (23) having to kneel before the Pope (24) the right to ride on horseback into Seville cathedral.</p><p>But the children of the duchess, 85, (25) until now blocked her plans to marry Alfonso Diez, 24 years her junior. Her six children, who – as she likes to point out – are all divorced, (26) all born from her first marriage. She plans to overcome her children's opposition by giving (27) their inheritance in advance.</p><p></p><p>The duchess's personal wealth (28) estimated at around $2 billion, and she has (29) able to give her children a palace each, as well as a chunk of the thousands of hectares of Spain that she owns.</p><p><i style='font-size:small'>(Guardian News & Media)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16maj-reading-1",
        "type": "reading-true-or-false",
        "solutions": "[\"B\",\"B\",\"C\",\"A\",\"C\",\"A\",\"A\"]",
        "taskTitle": "Task 1",
        "instructions": "[\"Read this letter and then read the sentences following it.\",\"Click on <i>true</i> if it is true according to the article, mark it <i>false</i> if it is false, and mark it <i>doesn't say</i> if there isn’t enough information in the text to decide if it is true or not.\"]",
        "wordList": "{}",
        "textTitle": "",
        "example": "true",
        "text": "<p>Dear Editor,</p><p><br></p><p>I am writing to express my appreciation to some kind individual who was shopping at Lidl in Dewsbury last Wednesday.</p><p>I am a 69-year-old retired gentleman. I was taking my elderly uncle shopping at Lidl, as I do every week. After taking my uncle home and getting home myself, I realised that I had misplaced the bag that I normally carry around my waist containing my money and my personal belongings. I thought that this would be the last time it was seen!</p><p>However, I called the supermarket and to my surprise some kind person had found it by the door in the supermarket and handed it in to the cashier, complete with £30 and everything untouched.</p><p>Our town has had such a bad press recently. This goes to show that there are still kind, caring, genuine people about and I would like to say how proud of my community I am.</p><p><br></p><p>I am one very happy gentleman.</p><p>Yours faithfully,</p><p>R. McG.</p><p><br></p><p><i style='font-size:small'>(www.batleynews.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='statement'> The man regularly goes shopping with his uncle.</div><form class='radio-container default'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> Out in the street the man noticed that he didn’t have his bag with him.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> He was sure he would find the bag.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The bag was a present for his birthday.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The man contacted the supermarket by phone.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The person who found the bag was an elderly gentleman.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> No money had disappeared from his bag.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div><div class='gap-container'><div class='statement'> The man is happy about having nice people in his town.</div><form class='radio-container'><label><input name='t-f' type='radio'><span>true</span></label><label><input name='t-f' type='radio'><span>false</span></label><label><input name='t-f' type='radio'><span>doesn't say</span></label></form></div>"
    },
    {
        "taskId": "standard-16maj-reading-2",
        "type": "reading-dialogue",
        "solutions": "[\"E\",\"G\",\"D\",\"A\",\"I\",\"B\",\"H\"]",
        "taskTitle": "Task 2",
        "instructions": "[\"In the following interview with American meteorologist Greg Fishel the questions have been removed.\",\"Your task is to place each question into the appropriate box.\",\"Place the questions in the boxes as in the example.\",\"Remember that there is <u>one extra question</u> you do not need.\"]",
        "wordList": "{\"A\":\"What are the most interesting weather areas in North Carolina and why?\",\"B\":\"How can I learn more about tornadoes?\",\"D\":\"What made you decide to use a 7-day forecast?\",\"E\":\"When a forecast doesn't happen as predicted, such as the snow that didn't come last winter, do you get disappointed?\",\"F\":\"What’s your typical work week like?\",\"G\":\"When did you become interested in this job?\",\"H\":\"What advice would you offer someone considering this career?\",\"I\":\"How do you choose which city you show the temperatures for each night?\"}",
        "textTitle": "",
        "example": "What is the weather event that you will never forget?",
        "text": "(0)<p>There are several, but the March 1984 tornado outbreak was the worst tornado outbreak in North Carolina in 100 years!</p>(8)<p>In many ways, yes, although I have gotten better about this over the years. I have slowly learned that when things don't go as planned, it is an opportunity to learn.</p>(9)<p>As a teenager, I saw a television show. Elliot Abrams, one of the hosts of this program, is the biggest reason I decided to choose the field of meteorology.</p>(10)<p>Viewers wanted to get this type of information.</p>(11)<p>The central part of the state can experience the wildest weather. One night many years ago, I was doing the 11 p.m. broadcast and I showed a current temperature map. It was 15 °C in the city of Burlington and 1 °C in another town only 60 km away from it!</p>(12)<p>There is a plan. We’ve set up a routine to get as many of them on the forecast maps each week as possible.</p>(13)<p>The old saying goes: Learn more about what you're afraid of, so you won't be as scared any more! Find a group who actually know something about them, and who are scientifically oriented.</p>(14)<p>Don’t get into this just because you want to be on TV.</p><p><i style='font-size:small'>(www.wral.com)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16maj-reading-3",
        "type": "reading-matching",
        "solutions": "[\"I\",\"H\",\"A\",\"E\",\"B\",\"F\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"Read the following story about two naughty boys and then read the half sentences that follow the text.\",\"Your task is to match the half sentences based on the information in the text.\",\"Place the half sentences in the white boxes as in the example.\",\"Remember that there are <u>two extra half-sentences</u> you do not need.\"]",
        "wordList": "{\"A\":\"to notice the boys’ disappearance.\",\"B\":\"to have their children back.\",\"D\":\"to call the police.\",\"E\":\"to have a car like their fathers’.\",\"F\":\"to leave her job after the incident.\",\"G\":\"to phone one of the teachers.\",\"H\":\"to create their escape route.\",\"I\":\"to go to a shop for expensive cars.\"}",
        "textTitle": "THE GREAT NURSERY ESCAPE",
        "example": "were five years old.",
        "text": "<p>Two boys aged five dug under the fence of their Russian kindergarten playground in order to walk to a Jaguar car showroom to buy a 'grown-up car'. After using their sand spades over several days to dig their 'tunnel', the boys escaped from under their teacher's nose during an afternoon walk.</p><p>They then walked several miles to the Jaguar showroom in the Urals industrial city of Magnitogorsk. As police hunted for the friends, a woman noticed them looking at the expensive sports cars and asked them what they were doing. They happily told her they were there because their daddies’ cars were so similar to the ones they could see in the shop window, The Siberian Times reported. Eventually, the woman handed the boys over to the police.</p><p>Their worried parents decided not to complain at the shop when they realised that the children were safe. But the kindergarten teacher in charge of the boys was fired. As Olga Denisenko, Head of Pre-School Education in the city, explained: 'This is a very serious violation of rules. The head of the group that allowed this to happen had to leave.'</p><p>Sadly for the boys, they didn’t get their dream car, but they did have a couple of hours of freedom.</p><p></p><p><i style='font-size:small'>(dailymail.co.uk)</i></p>",
        "text2": "<div class='gap-container'><div class='half-sentence'>Both of the boys</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> They escaped from the kindergarten</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The boys used some toys </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Their teacher failed </div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> Eventually, the boys didn’t manage</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> The parents didn’t complain because they were happy</div><div class='gap'></div></div><div class='gap-container'><div class='half-sentence'> One of the teachers was forced</div><div class='gap'></div></div>"
    },
    {
        "taskId": "standard-16maj-reading-4",
        "type": "reading-text",
        "solutions": "[\"L\",\"F\",\"B\",\"I\",\"A\",\"E\",\"H\",\"D\",\"K\",\"M\"]",
        "taskTitle": "Task 4",
        "instructions": "[\"In this article about a man who flew to Australia for free, some parts of sentences have been left out.\",\"Your task is to reconstruct the text by filling in the gaps from the list below.\",\"Place the sentences in the boxes as in the example.\",\"Remember that there is <u>one extra sentence</u> you do not need.\"]",
        "wordList": "{\"A\":\"to be put on an Air India plane\",\"B\":\"let himself out\",\"D\":\"they opened the doors\",\"E\":\"I took off all my clothes\",\"F\":\"lie on his back with his knees pulled up\",\"G\":\"his daughter got back home\",\"H\":\"to think about it\",\"I\":\"a sticker on the box said “RED PAINT”\",\"K\":\"he was at home\",\"L\":\"he decided to post himself in a wooden box\",\"M\":\"he could even convince his wife\"}",
        "textTitle": "THE MAN WHO POSTED HIMSELF TO AUSTRALIA",
        "example": "with no money to buy a plane ticket home",
        "text": "<p>In the mid-1960s, Australian athlete Reg Spiers found himself stranded in London (0). He really wanted to get back to Australia in time for his daughter's birthday, so (21).</p><p>Built by one of Spiers' friends, the box allowed him to sit up straight-legged, or (22). The two ends of the box were held in place by wooden pegs that he used to (23). To stop anybody finding out that a person was inside, (24) and it was addressed to a fictitious Australian shoe company.</p><p>He packed some tinned food, a flashlight, a blanket and a pillow into the box plus two plastic bottles - one for water and one for urine, and then the box was ready (25) that was flying to Perth, Western Australia.</p><p>There was a stopover on the long journey in Bombay, where they parked Spiers - upside down - in the hot sun for four hours. &quot;It was really hot as hell in Bombay, so (26),&quot; he says. &quot;If they open the box then… Oh, it’s so funny even (27)!&quot;</p><p>When the flight finally landed in Perth, (28) and Spiers immediately recognised the accent of the Australian airport workers. He knew that finally (29).</p><p>Spiers had survived three days travelling in the wooden box. He managed to get back in time for his daughter's birthday and (30) that this whole story was true.</p><p></p><p><i style='font-size:small'>(bbc.co.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16maj-uoe-1",
        "type": "uoe-free-gap-filling",
        "solutions": "[[\"by\",\"under\"],[\"to\"],[\"the\",\"our\"],[\"more\"],[\"as\",\"is\"],[\"is\"],[\"which\",\"that\"],[\"his\"],[\"take\"],[\"on\"]]",
        "taskTitle": "Task 1",
        "instructions": "[\"You are going to read an article about St George, the patron saint of England. Some words are missing from the text.\",\"Your task is to fill in the gaps.\",\"Use only <u>one</u> word in each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "THE PATRON SAINT OF ENGLAND",
        "example": "on",
        "text": "<p>St George is the patron saint of England. His emblem, a red cross (0) a white background, is the flag of England, and part of the British flag. St George's emblem was adopted (1) Richard The Lion Heart and brought to England in the 12th century. The king's soldiers wore it on their clothes (2) avoid confusion in battle.</p><p>One of (3) best-known stories about Saint George is his fight with a dragon. But it is very unlikely that he ever fought a dragon, and even (4) unlikely that he ever visited England. Despite this, people throughout the world know St George (5) the dragon-slaying patron saint of England.</p><p>Very little (6) known nowadays about the real St George. He was probably born into a noble Christian family in the late third century in Cappadocia, an area (7) is now in Turkey. He followed (8) father's example, became a soldier and served under the Roman Emperor Diocletian. When the emperor ordered the persecution of Christians, George refused to (9) part. In 303, he was tortured and executed in Palestine, becoming an early Christian martyr.</p><p>St George's Day is celebrated in England (10) 23 April, reputed to be the day of George's martyrdom in 303.</p><p><i style='font-size:small'>(www.woodlands-junior.kent.sch.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16maj-uoe-2",
        "type": "uoe-word-transformation",
        "solutions": "[[\"responsibilities\"],[\"wealthy\"],[\"education\"],[\"helping\"],[\"suitable\"],[\"permission\"],[\"British\",\"Britain’s\"],[\"crowded\",\"overcrowded\"],[\"fast\"],[\"death\"]]",
        "taskTitle": "Task 2",
        "instructions": "[\"You are going to read an article about Florence Nightingale (1820–1910), who is famous for her nursing work during the Crimean War (1854–56). Some words are missing from the text.\",\"Use the words in brackets to form the words that fit in the gaps.\",\"There might be cases when you do not have to change the word in brackets.\",\"Use only <u>one</u> word for each gap.\",\"There is an example at the beginning.\"]",
        "wordList": "{}",
        "textTitle": "FLORENCE NIGHTINGALE",
        "example": "mostly",
        "text": "<p>Florence Nightingale changed nursing from a (0) <b>(most)</b> untrained job to a highly skilled medical profession with very important (11) <b>(responsible)</b>.</p><p></p><p>Florence Nightingale was born in 1820. Her father was a (12) <b>(wealth)</b> landowner. At that time, rich English girls were expected to do - almost nothing. However, Florence's father believed that all women should receive an (13) <b>(educate)</b>. He taught Florence science, mathematics, history and philosophy.</p><p></p><p>As Florence grew up she developed an interest in (14) <b>(help)</b> others. At first her parents refused to allow her to become a nurse because it wasn't a (15) <b>(suit)</b> profession for a well educated woman. But Florence didn't give up. Finally, in 1851 her father gave his (16) <b>(permit)</b> and Florence went to Germany to train to become a nurse.</p><p></p><p>In 1854 Florence went to Turkey to manage the nursing of (17) <b>(Britain)</b> soldiers wounded in the Crimean War. She found the hospital conditions very poor. Many of the wounded were unwashed and were sleeping in (18) <b>(crowd)</b>, dirty rooms without blankets or decent food. Diseases such as typhus spread (19) <b>(fast)</b>. As a result, the (20) <b>(die)</b> rate among wounded soldiers was very high. Florence and her nurses set up a kitchen, fed the wounded from their own supplies and asked the wives of the wounded for help. They were then able to properly care for the ill and wounded.</p><p><i style='font-size:small'>(www.woodlands-junior.kent.sch.uk)</i></p>",
        "text2": ""
    },
    {
        "taskId": "standard-16maj-uoe-3",
        "type": "uoe-closed-gap-filling",
        "solutions": "[\"A\",\"H\",\"I\",\"L\",\"G\",\"D\",\"K\",\"M\",\"B\",\"E\"]",
        "taskTitle": "Task 3",
        "instructions": "[\"You are going to read an anecdote about a philosophy exam. Some words are missing from the text.\",\"Your task is to choose the most appropriate word from the list for each gap in the text.\",\"Each word can be used once.\",\"There is an example at the beginning.\",\"Remember that there is <u>one extra word</u> you do not need.\"]",
        "wordList": "{\"A\":\"DEALING\",\"D\":\"HOWEVER\",\"G\":\"TRYING\",\"K\":\"WAS\",\"B\":\"HOW\",\"E\":\"OF\",\"H\":\"UP\",\"L\":\"WERE\",\"F\":\"OFF\",\"I\":\"USING\",\"M\":\"WHEN\"}",
        "textTitle": "THERE IS NO CHAIR",
        "example": "GAVE",
        "text": "<p>An eccentric philosophy professor (0) his students a one-question final exam after a semester (21) with a wide range of topics.</p><p>The class was already seated and ready to start the exam when the professor picked (22) his chair, put it on top of his desk and wrote on the board: &quot;Prove that this chair does not exist (23) everything we have learned this semester.&quot;</p><p>Fingers flew, erasers erased, notebooks (24) filled in furious fashion. Some students wrote over 30 pages in one hour (25) to disprove the existence of the chair. One member of the class, (26), was up and finished in less than a minute. Everybody (27) astonished when he stood up, handed in his exam paper and left the room.</p><p>A week later, (28) the grades were posted on the notice board, the rest of the group wondered (29) he could have gotten an &quot;A&quot; when he had hardly written anything at all. His answer consisted (30) two words: &quot;What chair?&quot;</p><p><i style='font-size:small'>(www.stephen-knapp.com)</i></p>",
        "text2": ""
    }
]